#Область СлужебныйПрограммныйИнтерфейс

Процедура МенеджерыЛогическихХранилищ(ВсеМенеджерыЛогическихХранилищ) Экспорт
    
    Если ТехнологияСервисаИнтеграцияСБСП.ПодсистемаСуществует("ТехнологияСервиса.ПоставляемыеДанныеОбластейДанных") Тогда
        МодульПоставляемыеДанныеОбластейДанных = ТехнологияСервисаИнтеграцияСБСП.ОбщийМодуль("ПоставляемыеДанныеОбластейДанных");
		ВсеМенеджерыЛогическихХранилищ.Вставить("supplied_data", МодульПоставляемыеДанныеОбластейДанных);
    КонецЕсли; 
    
    Если ТехнологияСервисаИнтеграцияСБСП.ПодсистемаСуществует("ТехнологияСервиса.ОчередьЗаданийВнешнийИнтерфейс") Тогда
        МодульОчередьЗаданийВнешнийИнтерфейс = ТехнологияСервисаИнтеграцияСБСП.ОбщийМодуль("ОчередьЗаданийВнешнийИнтерфейс");
        ИдентификаторХранилища = МодульОчередьЗаданийВнешнийИнтерфейс.ИдентификаторХранилища();
		ВсеМенеджерыЛогическихХранилищ.Вставить(ИдентификаторХранилища, МодульОчередьЗаданийВнешнийИнтерфейс);
    КонецЕсли; 
    
    Если ТехнологияСервисаИнтеграцияСБСП.ПодсистемаСуществует("ТехнологияСервиса.ФайлыОбластейДанных") Тогда
        МодульФайлыОбластейДанныхВнешнийИнтерфейс = ТехнологияСервисаИнтеграцияСБСП.ОбщийМодуль("ФайлыОбластейДанныхВнешнийИнтерфейс");
        ИдентификаторХранилища = МодульФайлыОбластейДанныхВнешнийИнтерфейс.ИдентификаторХранилища();
		ВсеМенеджерыЛогическихХранилищ.Вставить(ИдентификаторХранилища, МодульФайлыОбластейДанныхВнешнийИнтерфейс);
    КонецЕсли; 
    
    Если ТехнологияСервисаИнтеграцияСБСП.ПодсистемаСуществует("ТехнологияСервиса.ИнтеграцияОбъектовОбластейДанных") Тогда
        МодульИнтеграцияОбъектовОбластейДанных = ТехнологияСервисаИнтеграцияСБСП.ОбщийМодуль("ИнтеграцияОбъектовОбластейДанных");
        ИдентификаторХранилища = МодульИнтеграцияОбъектовОбластейДанных.ИдентификаторХранилища();
		ВсеМенеджерыЛогическихХранилищ.Вставить(ИдентификаторХранилища, МодульИнтеграцияОбъектовОбластейДанных);
    КонецЕсли; 
    
КонецПроцедуры

Процедура МенеджерыФизическихХранилищ(ВсеМенеджерыФизическихХранилищ) Экспорт
	
КонецПроцедуры

Процедура ПериодДействияВременногоИдентификатора(ПериодДействияВременногоИдентификатора) Экспорт
	
КонецПроцедуры

Процедура РазмерБлокаПолученияДанных(РазмерБлокаПолученияДанных) Экспорт
	
КонецПроцедуры

Процедура РазмерБлокаОтправкиДанных(РазмерБлокаОтправкиДанных) Экспорт
	
КонецПроцедуры

Процедура ОшибкаПриПолученииДанных(Ответ) Экспорт
	
КонецПроцедуры

Процедура ОшибкаПриОтправкеДанных(Ответ) Экспорт
	
КонецПроцедуры

#КонецОбласти