

#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ПараметрыФормы = Новый Структура("ТипОснованияАктаОРасхождении",
	                                 ПредопределенноеЗначение("Перечисление.ТипыОснованияАктаОРасхождении.ПриобретениеТоваровУслуг"));
	ОткрытьФорму("Документ.АктОРасхожденияхПослеПриемки.ФормаСписка",
	            ПараметрыФормы, 
	            ПараметрыВыполненияКоманды.Источник,
	            "ПриобретениеТоваровУслуг",
	            ПараметрыВыполненияКоманды.Окно, 
	            ПараметрыВыполненияКоманды.НавигационнаяСсылка);

КонецПроцедуры

#КонецОбласти

