
&НаСервере
Функция ПолучитьПолеРасшифровки(Расшифровка)
	
	КоллекцияРасшифровки = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	КоллекцияПолей = КоллекцияРасшифровки.Элементы[Расшифровка].ПолучитьПоля();
    
  //  КоллекцияРасшифровки = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
    Если КоллекцияПолей.Количество() > 0 Тогда 
    	Возврат  КоллекцияПолей[0].Поле;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция ПолучитьСтруктуруОтбора(Расшифровка, СтруктураПараметров)
	
	КоллекцияРасшифровки = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	КоллекцияРодителей = КоллекцияРасшифровки.Элементы[Расшифровка].ПолучитьРодителей();
	
	Для Каждого Родитель ИЗ КоллекцияРодителей Цикл
		
		Если ТипЗнч(Родитель)  = Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда
			
			ИдентификаторПоля = Родитель.Идентификатор;
			ПоляВыбора = КоллекцияРасшифровки.Элементы[ИдентификаторПоля].ПолучитьПоля();
			
			Для Каждого выбПоле Из ПоляВыбора Цикл
				Если СтруктураПараметров.Свойство(выбПоле.Поле) Тогда
					СтруктураПараметров.Вставить(выбПоле.Поле, выбПоле.Значение); 
				КонецЕсли;
			КонецЦикла;
			
		Иначе	
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции


&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Перем НайденноеЗначение;
	
	ПолеРасшифровки = ПолучитьПолеРасшифровки(Расшифровка);

	Если ПолеРасшифровки = "СуммаФакт" Тогда 	СтандартнаяОбработка = Ложь;

		СтруктураПараметров = Новый Структура("Период, ДатаНачала, ДатаОкончания, Отдел, СтатьяБюджета, Аналитика1, Аналитика2, Аналитика3");
		ПолучитьСтруктуруОтбора(Расшифровка, СтруктураПараметров);   
		
		Если СтруктураПараметров.Свойство("Период", НайденноеЗначение) и НайденноеЗначение <> Неопределено Тогда
			СтруктураПараметров.ДатаНачала 		= СтруктураПараметров.Период;
			СтруктураПараметров.ДатаОкончания 	= КонецМесяца(СтруктураПараметров.Период);
		Иначе Возврат;
		КонецЕсли;
		
		Если СтруктураПараметров.Отдел = Неопределено Тогда
			Для Каждого ЭлементНастроек Из Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
				Если ТипЗнч(ЭлементНастроек) = Тип("ЭлементОтбораКомпоновкиДанных") И ТипЗнч(ЭлементНастроек.ПравоеЗначение) = Тип("СправочникСсылка.Отделы") И ЭлементНастроек.Использование Тогда
					СтруктураПараметров.Вставить("Отдел",ЭлементНастроек.ПравоеЗначение);
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;	
		
		РезультатРасшифровки = Новый ТабличныйДокумент;

		ДанныеВложеннойРасшифровки ="";
		АдресСхемы = "";
		
		ПоказателиСуммаОткрытиеНаСервере(СтруктураПараметров, РезультатРасшифровки, ДанныеВложеннойРасшифровки, АдресСхемы, Новый УникальныйИдентификатор);
		ОткрытьФорму("Документ.ФактическиеДанныеБюджетирования.Форма.ФормаРасшифровки", Новый Структура("Результат, ДанныеРасшифровки, АдресСхемы", РезультатРасшифровки, ДанныеВложеннойРасшифровки, АдресСхемы), ЭтаФорма, Строка(УникальныйИдентификатор) + Строка(Расшифровка));
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПоказателиСуммаОткрытиеНаСервере(СтруктураПараметров, РезультатРасшифровки, ДанныеВложеннойРасшифровки, АдресСхемы, ГУИД)
	
	Документы.ФактическиеДанныеБюджетирования.ОбработкаРасшифровкиФактическойСуммыБюджетирования(СтруктураПараметров, РезультатРасшифровки, ДанныеВложеннойРасшифровки, АдресСхемы, ГУИД);

КонецПроцедуры
		
		
	

