
&НаКлиенте
Процедура Отменить(Команда)
	
	Записать(Новый Структура("Активно", Ложь));
	
КонецПроцедуры
&НаКлиенте
Процедура Установить(Команда)
	
	ПроойтиПроверкуПрограммистаИСохранить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи = Неопределено Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьЗначенияСвойств(ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры


#Область Проверка

Функция ПолучитьВопросыОтветы()
	
	ВопрОтв = Новый Массив;
	
	ВопрОтв.ВГраница(Новый Структура("Ответ, Вопрос", "1 + 2 = 12", 
			"Что выйдет на экран? если написать: Сообщить(""1 + 2 = "" + 1 + 2);"));
	
	ВопрОтв.ВГраница(Новый Структура("Ответ, Вопрос", "1 + 2 = 12", 
			"Что выйдет на экран? если написать: Сообщить(""1 + 2 = "" + 1 + 2);"));
	
КонецФункции

Функция ПроойтиПроверкуПрограммиста()
	
	Генератор = Новый ГенераторСлучайныхЧисел;
	
	Вопросы = ПолучитьВопросыОтветы();
	Вопрос = Вопросы[Генератор.СлучайноеЧисло(0, Вопросы.Количество() - 1];
	
	ПоказатьВводСтроки(Новый ОписаниеОповещения("СтудентВвел", ЭтаФорма, Вопрос),,"Сейчас мы узнаем кто ты такой");
	
КонецФункции
Процедура СтудентВвел(Строка, Вопрос) Экспорт
	
	Если Строка <> Неопределено Тогда
		
		Если Вопрос.Ответ = Строка Тогда
			Записать(Новый Структура("Активно", Истина));
		Иначе
			ПрекратитьРаботуСистемы(
		
		И ПроойтиПроверкуПрограммистаИСохранить() Тогда
		Записать(Новый Структура("Активно", Истина));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти