#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
		
	Если ТипЗнч(ПараметрыВыполненияКоманды.Источник) = Тип("УправляемаяФорма") Тогда
		Если Найти(ПараметрыВыполненияКоманды.Источник.ИмяФормы,"БизнесПроцесс") <> 0 Тогда
			ВнешнийОбъект = новый Структура;
			ВнешнийОбъект.Вставить("name", ПараметрыВыполненияКоманды.Источник.Наименование);
			ВнешнийОбъект.Вставить("id", ПараметрыВыполненияКоманды.Источник.ID);
			ВнешнийОбъект.Вставить("type", ПараметрыВыполненияКоманды.Источник.Тип);
			ВнешнийОбъект.Вставить("presentation", ПараметрыВыполненияКоманды.Источник.Представление);
			ПараметрыФормы = Новый Структура("ВнешнийОбъект",ВнешнийОбъект);
		КонецЕсли;
	КонецЕсли;
	
	ОткрытьФорму(
		"Обработка.ИнтеграцияС1СДокументооборот.Форма.ВсеЗадачи", 
		ПараметрыФормы, 
		ПараметрыВыполненияКоманды.Источник, 
		ПараметрыВыполненияКоманды.Уникальность, 
		ПараметрыВыполненияКоманды.Окно);

КонецПроцедуры

#КонецОбласти