#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВидимостьСогласования = ПолучитьФункциональнуюОпцию("ИспользоватьСогласованиеЦенНоменклатуры") 
	 И Не ПраваПользователяПовтИсп.УстановкаЦенНоменклатурыБезСогласования();
	 
	ТекстЗаголовка = НСтр("ru='Установка цен на %Дата%'");
	ТекстЗаголовка = СтрЗаменить(ТекстЗаголовка, "%Дата%", Формат(Параметры.Дата, "ДЛФ=DD"));
	Заголовок = ТекстЗаголовка;
	
	Элементы.ИнформационнаяНадписьСогласование.Видимость = ВидимостьСогласования;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Установить(Команда)
	
	СтруктураВозврата = Новый Структура();
	СтруктураВозврата.Вставить("Комментарий", Комментарий);
	СтруктураВозврата.Вставить("ВариантПримененияЦен", ВариантПримененияЦен);
	Закрыть(СтруктураВозврата);
	
КонецПроцедуры

#КонецОбласти
