
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("ДокументСсылка") Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ВыбраннаяФорма = "Форма";
	
	Если Не Параметры.Свойство("ПодключенноеОборудование") Тогда
		
		ПодключенноеОборудование = ПодключаемоеОборудованиеУТВызовСервера.ОборудованиеПодключенноеПоОрганизации(Параметры.Организация);
		Параметры.Вставить(
			"ПодключенноеОборудование",
			ПодключенноеОборудование);
		
		Если ПодключенноеОборудование.ККТ.Количество() = 0 Тогда
			ВыбраннаяФорма = "ОшибкаПодключенияККТ";
		КонецЕсли;
		
	КонецЕсли;
	
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		
		ВалютаРегл = Константы.ВалютаРегламентированногоУчета.Получить();
		
		Если ТипЗнч(Параметры.ДокументСсылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
			Или ТипЗнч(Параметры.ДокументСсылка) = Тип("ДокументСсылка.РеализацияУслугПрочихАктивов")
			Или ТипЗнч(Параметры.ДокументСсылка) = Тип("ДокументСсылка.АктВыполненныхРабот")
			Или ТипЗнч(Параметры.ДокументСсылка) = Тип("ДокументСсылка.ВыкупВозвратнойТарыКлиентом") Тогда
			
			Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметры.ДокументСсылка, "Валюта, ВалютаВзаиморасчетов");
			
			Если Реквизиты.Валюта <> ВалютаРегл
				Или Реквизиты.ВалютаВзаиморасчетов <> ВалютаРегл Тогда
				ВыбраннаяФорма = "ОшибкаИспользуемойВалюты";
			КонецЕсли;
			
		Иначе
			
			Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметры.ДокументСсылка, "Валюта");
			
			Если Реквизиты.Валюта <> ВалютаРегл Тогда
				ВыбраннаяФорма = "ОшибкаИспользуемойВалюты";
			КонецЕсли;
			
		КонецЕсли;
		
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти