
&НаСервере
Процедура СоздатьНовыйСправочникСимволов(Наименование, Символы)
	
	Спр = Справочники.АТ_ДопустимыеСимволы.СоздатьЭлемент();
	Спр.Наименование 	= Наименование;
	Спр.Символы 		= Символы;
	
	Спр.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьДопустимыеСимволыИСоздатьПоУмлочаниюЕслиИхНет()
	
	Спр = Справочники.АТ_ДопустимыеСимволы.Выбрать();
	Если Не Спр.Следующий() Тогда
		
		НачатьТранзакцию();
		
		СоздатьНовыйСправочникСимволов("Числа", 				"01234567890");
		СоздатьНовыйСправочникСимволов("Русские буквы", 		"АБВГДЕЁЖЗИКЛМНОПРСТУФХЦЧШЬЫЪЭЮЯабвгдеёжзиклмнопрстуфхцчшщьыъэючя");
		СоздатьНовыйСправочникСимволов("Числа и русские буквы", "01234567890АБВГДЕЁЖЗИКЛМНОПРСТУФХЦЧШЬЫЪЭЮЯабвгдеёжзиклмнопрстуфхцчшщьыъэючя");
		
		ЗафиксироватьТранзакцию();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ПустаяСтрока(Параметры.ИмяФормы) Тогда
		Объект.Формы.Добавить().ИмяФормы = Параметры.ИмяФормы;
	КонецЕсли;
	
	ПроверитьДопустимыеСимволыИСоздатьПоУмлочаниюЕслиИхНет();
	
КонецПроцедуры
