
#Область ПрограммныйИнтерфейс

// В функции требуется пересчитать количество введенных акцизных марок в количество единиц выбранной упаковки.
//
// Параметры:
//  Упаковка - ОпределяемыйТип.Упаковка - выбранная упаковка,
//  КоличествоАкцизныхМарок - Число - количество введенных акцизных марок,
//  КэшированныеЗначения - Струкктура, Неопределено - кэш формы документа.
//
// Возвращаемое значение:
//  Число - количество акцизных марок в единицах упаковки.
//
Функция КоличествоЕдиницАкцизныхМарок(Упаковка, КоличествоАкцизныхМарок, КэшированныеЗначения) Экспорт
	
	//++ НЕ ЕГАИС
	Возврат КоличествоАкцизныхМарок;
	//-- НЕ ЕГАИС
	
КонецФункции

Процедура ЗаполнитьПараметрыСканированияАкцизныхМарок(Параметры, Форма) Экспорт

	//++ НЕ ЕГАИС
	Если СтрНачинаетсяС(Форма.ИмяФормы, "Документ.ЧекККМВозврат") Тогда
		
		ЗаполнитьПараметрыСканированияАкцизныхМарокЧекККМВозврат(Параметры, Форма.Объект.ОрганизацияЕГАИС, Ложь);
		
	ИначеЕсли СтрНачинаетсяС(Форма.ИмяФормы, "Документ.ЧекККМ") Тогда
		
		ЗаполнитьПараметрыСканированияАкцизныхМарокЧекККМ(Параметры, Форма.Объект.ОрганизацияЕГАИС, Ложь);
		
	ИначеЕсли СтрНачинаетсяС(Форма.ИмяФормы, "ОбщаяФорма.ПроверкаЗаполненияДокументов") Тогда
		
		Если ТипЗнч(Форма.Ссылка) = Тип("ДокументСсылка.ЧекККМ") Тогда
			
			ЗаполнитьПараметрыСканированияАкцизныхМарокЧекККМ(Параметры, Форма.ОрганизацияЕГАИС, Истина);
			
		ИначеЕсли ТипЗнч(Форма.Ссылка) = Тип("ДокументСсылка.ЧекККМВозврат") Тогда
			
			ЗаполнитьПараметрыСканированияАкцизныхМарокЧекККМВозврат(Параметры, Форма.ОрганизацияЕГАИС, Истина);
			
		КонецЕсли;
		
	КонецЕсли;
	//-- НЕ ЕГАИС
	
КонецПроцедуры

#КонецОбласти

//++ НЕ ЕГАИС
#Область СлужебныеПроцедурыИФункцииУТ

Функция ЗаполнитьПараметрыСканированияАкцизныхМарокЧекККМ(Параметры, ОрганизацияЕГАИС, ПроверкаКоличества)
	
	Параметры.ДоступныеСтатусы.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыАкцизныхМарок.ВНаличии"));
	Параметры.ДоступныеСтатусы.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыАкцизныхМарок.ПустаяСсылка"));
	
	Параметры.КонтрольАкцизныхМарок         = Истина;
	Параметры.Операция                      = ПредопределенноеЗначение("Перечисление.ВидыДокументовЕГАИС.ЧекККМ");
	Параметры.ОперацияКонтроляАкцизныхМарок = "Продажа";
	
	Параметры.ОрганизацияЕГАИС              = ОрганизацияЕГАИС;
	Параметры.СоздаватьШтрихкодУпаковки     = Истина;
	
	Если ПроверкаКоличества Тогда
		Параметры.КлючевыеРеквизиты.Добавить("Штрихкод");
		Параметры.КлючевыеРеквизиты.Добавить("Помещение");
		Параметры.КлючевыеРеквизиты.Добавить("НоменклатураНабора");
		Параметры.КлючевыеРеквизиты.Добавить("ХарактеристикаНабора");
	Иначе
		Параметры.КлючевыеРеквизиты.Добавить("Цена");
		Параметры.КлючевыеРеквизиты.Добавить("СтавкаНДС");
		Параметры.КлючевыеРеквизиты.Добавить("Штрихкод");
		Параметры.КлючевыеРеквизиты.Добавить("Продавец");
		Параметры.КлючевыеРеквизиты.Добавить("Помещение");
		Параметры.КлючевыеРеквизиты.Добавить("НоменклатураНабора");
		Параметры.КлючевыеРеквизиты.Добавить("ХарактеристикаНабора");
	КонецЕсли;
	
КонецФункции

Функция ЗаполнитьПараметрыСканированияАкцизныхМарокЧекККМВозврат(Параметры, ОрганизацияЕГАИС, ПроверкаКоличества)
	
	Параметры.ДоступныеСтатусы.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыАкцизныхМарок.Реализована"));
	Параметры.ДоступныеСтатусы.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыАкцизныхМарок.ПустаяСсылка"));
	
	Параметры.КонтрольАкцизныхМарок         = Истина;
	Параметры.Операция                      = ПредопределенноеЗначение("Перечисление.ВидыДокументовЕГАИС.ЧекККМ");
	Параметры.ОперацияКонтроляАкцизныхМарок = "Возврат";
	Параметры.ОрганизацияЕГАИС              = ОрганизацияЕГАИС;
	Параметры.СоздаватьШтрихкодУпаковки     = Истина;
	
	Если ПроверкаКоличества Тогда
		Параметры.КлючевыеРеквизиты.Добавить("Штрихкод");
		Параметры.КлючевыеРеквизиты.Добавить("Помещение");
		Параметры.КлючевыеРеквизиты.Добавить("НоменклатураНабора");
		Параметры.КлючевыеРеквизиты.Добавить("ХарактеристикаНабора");
	Иначе
		Параметры.КлючевыеРеквизиты.Добавить("Цена");
		Параметры.КлючевыеРеквизиты.Добавить("СтавкаНДС");
		Параметры.КлючевыеРеквизиты.Добавить("Штрихкод");
		Параметры.КлючевыеРеквизиты.Добавить("Продавец");
		Параметры.КлючевыеРеквизиты.Добавить("Помещение");
		Параметры.КлючевыеРеквизиты.Добавить("НоменклатураНабора");
		Параметры.КлючевыеРеквизиты.Добавить("ХарактеристикаНабора");
	КонецЕсли;
	
КонецФункции

#КонецОбласти
//-- НЕ ЕГАИС