#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УникальныйИдентификаторСтроки = Параметры.УникальныйИдентификаторСтроки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("Цена", Цена);
	ПараметрыОповещения.Вставить("УникальныйИдентификаторСтроки", УникальныйИдентификаторСтроки);
	ИмяСобытия = "ЖелаемаяЦена";
	ФормаИсточник = "РегистрСведений.ПотребностьКлиентов.Форма.РегистрацияПотребностиСпроса";
	Оповестить(ИмяСобытия, ПараметрыОповещения, ФормаИсточник);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Цена) Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Требуется заполнить цену";
		Сообщение.Поле = "Цена";
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти



















