
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("ПараметрКоманды") Тогда
		ДокументПродажи = Параметры.ПараметрКоманды;
	ИначеЕсли Параметры.Свойство("ДокументПродажи") Тогда
		ДокументПродажи = Параметры.ДокументПродажи;
	Иначе 
		Отказ = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДокументПродажи) Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если Не Отказ Тогда
		СформироватьОтчет();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	ОчиститьСообщения();
	СформироватьОтчет();
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьОтчет()
	
	ТаблицаОтчета.Очистить();
	ПродажиСервер.СформироватьОтчетОтклоненияОтУсловийПродаж(ДокументПродажи,ТаблицаОтчета);
	
КонецПроцедуры

#КонецОбласти
