#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)

	// Нельзя установить константу в ИСТИНА, если запрещена работа с облачным архивом.
	Если НЕ ОблачныйАрхивПовтИсп.ВозможнаРаботаСОблачнымАрхивом() Тогда
		Если ЭтотОбъект.Значение = Истина Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)

	// В зависимости от текущего значения константы отключить или включить использование регламентного задания "ВсеОбновленияНовостей".
	ОблачныйАрхивВызовСервера.ИзменитьИспользованиеРегламентныхЗаданий(ЭтотОбъект.Значение);

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
