
&НаСервере
Функция ПолучитьРеализацииКП(Ссылкиреализации)
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ 	ДокументРезультат 
	|ИЗ 		РегистрСведений.АТ_СвязьОбъектовКП
	|
	|ГДЕ 	КП.Проведен И ДокументРезультат.Проведен И
	|		ДокументРезультат ССЫЛКА Документ.РеализацияТоваровУслуг И 
	|		КП В(&Ссылки)
	|");
	
	Запрос.УстановитьПараметр("Ссылки", Ссылкиреализации);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ДокументРезультат");
	
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати( 
			"РегистрСведений.НастройкиПечатиОбъектов", 
			"КомплектДокументов", 
			ПолучитьРеализацииКП(ПараметрКоманды), 
			Новый Структура 
			);
			
	Оповестить("РаспечатанПакетДокументов",,ПараметрКоманды);
	
КонецПроцедуры
