



&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//Если (ИмяФайла = Неопределено) И (ФайлИзображения = Неопределено) И (Картинка = Неопределено) Тогда
	//	Отказ = Истина;
	//КонецЕсли;
	
	//Нужна другая проверка
	//Если ТипЗнч(Картинка)<>Тип("Картинка") Тогда	
		//Если ИмяФайла = Неопределено Тогда		
		//	ИмяФайла =  ФайлИзображения;  		
		//КонецЕсли;
		//Заголовок = "Файл: " + ИмяФайла;
		//Картинка  = Новый Картинка(ФайлИзображения, Ложь);
	//Иначе
	//	Заголовок = "Внутренняя картинка: " + ИмяФайла;
	//	//Элементы.ОсновныеДействияФормы.Кнопки.ДействиеПросмотр.Доступность = Ложь;
	//КонецЕсли;
	
	//Элементы.ПолеИзображения.РазмерКартинки = РазмерКартинки.АвтоРазмер;
	//Элементы.ПолеИзображения.Картинка       = Картинка; 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьИзображение();
КонецПроцедуры

&НаСервере
Процедура ОбновитьИзображение()
	
	ОбъектЭлемента = РеквизитФормыВЗначение("Объект");	
	Фото = ПоместитьВоВременноеХранилище(lxОбщий.ПолучитьКартинкуПоURL(Параметры.ИмяФайла), УникальныйИдентификатор);
	Элементы.Фото.Заголовок = "Файл: " + Параметры.ИмяФайла; 
	
КонецПроцедуры

