&НаКлиенте
Перем ВыполняетсяЗакрытие;

&НаКлиенте
Перем ПараметрыОбработчикаОжидания;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("ПутьКФайлуЗагрузки")
		И ЗначениеЗаполнено(Параметры.ПутьКФайлуЗагрузки) Тогда
		Объект.ИмяФайлаДанных = Параметры.ПутьКФайлуЗагрузки;
	КонецЕсли;
	
	РазделениеВключено = ОбщегоНазначенияПовтИсп.РазделениеВключено();
	
	Объект.КонфигурацияПриемник = "";
	Если ПолучитьФункциональнуюОпцию("УправлениеПредприятием") Тогда
		Объект.КонфигурацияПриемник = "УП";
	ИначеЕсли ПолучитьФункциональнуюОпцию("КомплекснаяАвтоматизация") Тогда
		Объект.КонфигурацияПриемник = "КА";
	ИначеЕсли ПолучитьФункциональнуюОпцию("УправлениеТорговлей") Тогда
		Объект.КонфигурацияПриемник = "УТ";
	КонецЕсли;
	
	ЗаполнитьДоступныеКонфигурацииИсточника();
	
	Если Параметры.Свойство("КонфигурацияИсточник", Объект.КонфигурацияИсточник)
		И ДоступныеКонфигурацииИсточника.НайтиПоЗначению(Объект.КонфигурацияИсточник) = Неопределено Тогда
		Объект.КонфигурацияИсточник = "";
	КонецЕсли;
	
	АвтоТестОбмена = Параметры.Свойство("АвтоТестОбмена");
	Если АвтоТестОбмена Тогда
		#Область АвтоТестОбмена
		Ошибка = Ложь;
		Если ПустаяСтрока(Объект.ИмяФайлаДанных) Тогда
			ОписаниеОшибки = НСтр("ru = 'В переданных параметрах отсутствует путь к файлу с данными для загрузки.'");
			Рекомендации = НСтр("ru = 'В передаваемых параметрах должен быть элемент ПутьКФайлуЗагрузки.'");
			ЗафиксироватьОшибку(ЭтаФорма, ОписаниеОшибки, Рекомендации);
			Ошибка = Истина;
		КонецЕсли;
		Если ПустаяСтрока(Объект.КонфигурацияИсточник) Тогда
			Если Параметры.Свойство("КонфигурацияИсточник") И Не ПустаяСтрока(Параметры.КонфигурацияИсточник) Тогда
				ОписаниеОшибки = НСтр("ru = 'Загрузка данных из источника %1 не поддерживается.'");
				ОписаниеОшибки = СтрШаблон(ОписаниеОшибки, Параметры.КонфигурацияИсточник);
				Рекомендации = НСтр("ru = 'Проверить правильность переданного параметра.'");
			Иначе
				ОписаниеОшибки = НСтр("ru = 'В переданных параметрах отсутствует имя Конфигурации-источника.'");
				Рекомендации = НСтр("ru = 'В передаваемых параметрах должен быть элемент КонфигурацияИсточник.'");
			КонецЕсли;
			ЗафиксироватьОшибку(ЭтаФорма, ОписаниеОшибки, Рекомендации);
			Ошибка = Истина;
		КонецЕсли;
		Если Ошибка Тогда
			Возврат;
		КонецЕсли;
		#КонецОбласти
	Иначе
		МетаданныеСиноним = Метаданные.Синоним;
		
		УстановитьЗаголовкиКонфигурацииПриемника("ДекорацияНазваниеКонфигурацииПриемникаИзФайла");
		
		ЗаполнитьОписаниеДоступныхКонфигурацийИсточника();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВыполняетсяЗакрытие = Ложь;
	
	Если ПустаяСтрока(Объект.КонфигурацияПриемник) Тогда
		Отказ = Истина;
		
		ПоказатьПредупреждение(Неопределено, СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Данная обработка не предназначена для запуска в программе %1.'"), МетаданныеСиноним));
			
		Возврат;
	КонецЕсли;
	
	// Устанавливаем текущую таблицу переходов.
	ОбновитьТаблицуПереходов();
	
	Если ЗначениеЗаполнено(Объект.ИмяФайлаДанных) Тогда
		ПорядковыйНомерПерехода = 1;
	Иначе
		// Позиционируемся на первом шаге помощника.
		ПорядковыйНомерПерехода = 0;
	КонецЕсли;
	ВыполнитьПереходПоТаблицеПереходов(Истина);
	
	Если АвтоТестОбмена Тогда
		#Если ВебКлиент Тогда
			ТекстСообщения = Нстр("ru = 'Автотест переноса данных не может выполняться в режиме Веб-клиента.'");
			ЗафиксироватьОшибку(ЭтотОбъект, ТекстСообщения);
			АвтотестЗавершить();
		#Иначе
			Автотест();
		#КонецЕсли
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ВыполняетсяЗакрытие Тогда
		Отказ = Истина;
		НСтрока = НСтр("ru = 'Завершить работу с помощником?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект),
			НСтрока, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Ответ = РезультатВопроса;
    
    Если Ответ = КодВозвратаДиалога.Да Тогда
        ВыполняетсяЗакрытие = Истина;
		Закрыть();
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторЗадания)
		И СостояниеТекущегоЭтапа() = "Выполняется" Тогда
		Попытка
			Если Не ЗаданиеВыполнено(ИдентификаторЗадания) Тогда
				ОтменитьВыполнениеЗадания(ИдентификаторЗадания);
			КонецЕсли;
		Исключение
			// Исключение не обрабатывается, т.к. это может быть этап, выполняемый не в длительной операции.
		КонецПопытки;
	КонецЕсли;
	
	ОбновитьИнтерфейс();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИмяФайлаОбменаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыДиалога = Новый Структура;
	ПараметрыДиалога.Вставить("Заголовок", НСтр("ru = 'Выберите путь к файлу с данными'"));
	ПараметрыДиалога.Вставить("Фильтр",    НСтр("ru = 'ZIP-файл'") + " (*.zip)|*.zip");
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Объект",           Объект);
	ДополнительныеПараметры.Вставить("ИмяСвойства",      "ИмяФайлаДанных");
	ДополнительныеПараметры.Вставить("ПараметрыДиалога", ПараметрыДиалога);
	
	ПроверитьУстановкуРасширенияРаботыСФайлами(ДополнительныеПараметры, "ОбработчикВыбораФайлаЗавершение");
	
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаПротоколНажатие(Элемент)
	
	ПодготовитьОтчетОбОшибках();
	
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаОшибкиНажатие(Элемент)
	
	ПодготовитьОтчетОбОшибках();
	
КонецПроцедуры

#КонецОбласти

#Область РазделОбработчиковСобытийПерехода

// Обработчик выполняется при открытии страницы помощника "СтраницаОжидания".
//
// Параметры:
//
//  Отказ - Булево - флаг отказа от открытия страницы;
//			если в обработчике поднять этот флаг, то переход на страницу выполнен не будет,
//			останется открытой предыдущая страница помощника согласно направлению перехода (вперед или назад)
//
//  ПропуститьСтраницу - Булево. Если поднять этот флаг, то страница будет пропущена
//			и управление перейдет на следующую страницу помощника согласно направлению перехода (вперед или назад)
//
//  ЭтоПереходДалее (только чтение) - Булево - флаг определяет направление перехода.
//			Истина - выполняется переход далее; Ложь - выполняется переход назад.
//
// Логика данного обработчика пропускает отображение
// страницы помощника "СтраницаОжидания", если выполняется переход назад.
//
&НаКлиенте
Функция Подключаемый_СтраницаОжидание_ПриОткрытии(Отказ, ПропуститьСтраницу, Знач ЭтоПереходДалее)
	
	ИнициализацияЭтаповЗагрузки();
	Перерисовать();
	
	Элементы.ГруппаРезультат.Видимость         = Ложь;
	Элементы.ПанельНавигации.Доступность       = Ложь;
	Элементы.ОкончаниеГотово.КнопкаПоУмолчанию = Истина;
	
	// 1-й этап - передача архива на сервер и проверка содержимого.
	ТекущийЭтап = "Выгрузка";
	ОбновитьСостояниеТекущегоЭтапа(СостояниеЭтапаВыполняется());
	Перерисовать();
	
	ПодключитьОбработчикОжидания("ПомещениеФайлаВХранилищеНачать", 0.5, Истина);
	
КонецФункции

// Обработчик выполняется при открытии страницы помощника "СтраницаЗагрузкиИзФайла"
//
// Параметры:
//
//Отказ - Булево - флаг отказа от открытия страницы;
//			если в обработчике поднять этот флаг, то переход на страницу выполнен не будет,
//			останется открытой предыдущая страница помощника согласно направлению перехода (вперед или назад)
//
//ПропуститьСтраницу - Булево. Если поднять этот флаг, то страница будет пропущена
//			и управление перейдет на следующую страницу помощника согласно направлению перехода (вперед или назад)
//
//ЭтоПереходДалее (только чтение) - Булево - флаг определяет направление перехода.
//			Истина - выполняется переход далее; Ложь - выполняется переход назад
&НаКлиенте
Функция Подключаемый_СтраницаЗагрузкаИзФайла_ПриОткрытии(Отказ, ПропуститьСтраницу, Знач ЭтоПереходДалее)
	
	Элементы.ЗагрузитьДалее.КнопкаПоУмолчанию = Истина;
	Элементы.ПанельНавигации.Доступность      = Истина;
	
КонецФункции

// Обработчик перехода далее (на следующую страницу) при уходе со страницы помощника "СтраницаЗагрузкиИзФайла"
//
// Параметры:
// Отказ - Булево - флаг отказа от выполнения перехода далее;
//					если в обработчике поднять этот флаг, то переход на следующую страницу выполнен не будет.
//
&НаКлиенте
Функция Подключаемый_СтраницаЗагрузкаИзФайла_ПриПереходеДалее(Отказ)
	
	Если Не ЗначениеЗаполнено(Объект.ИмяФайлаДанных) Тогда
		Отказ = Истина;
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Необходимо выбрать файл для загрузки данных.'"), 30);
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция Подключаемый_СтраницаОжидание_ПриПереходеНазад(Отказ)
	
	ТаблицаОшибок.Очистить();
	
КонецФункции

#КонецОбласти

#Область РазделИнициализацииПереходовПомощника

&НаКлиенте
Процедура ТаблицаПереходовПоСценарию()
	
	ТаблицаПереходов.Очистить();
	
	НомерШага = 1;
	
	СтруктураПараметров = СоздатьСтруктуруПараметровСтрокиПерехода("СтраницаЗагрузкаИзФайла", 
		"СтраницаНавигацииЗагрузить", "СтраницаЗагрузкаИзФайла_ПриОткрытии");
	СтруктураПараметров.ИмяОбработчикаПриПереходеДалее = "СтраницаЗагрузкаИзфайла_ПриПереходеДалее";
	ТаблицаПереходовНоваяСтрока(НомерШага, СтруктураПараметров);
	
	СтруктураПараметров = СоздатьСтруктуруПараметровСтрокиПерехода("СтраницаОжидание", 
		"СтраницаНавигацииОкончание", "СтраницаОжидание_ПриОткрытии");
	СтруктураПараметров.ИмяОбработчикаПриПереходеНазад = "СтраницаОжидание_ПриПереходеНазад";
	ТаблицаПереходовНоваяСтрока(НомерШага, СтруктураПараметров);
	
КонецПроцедуры

// Готовит структуру параметров для дальнейшего добавления строки в таблицу переходов.
//
// Параметры:
//
//  	ИмяОсновнойСтраницы - Строка. Имя страницы панели "ПанельОсновная", 
//		которая соответствует текущему номеру перехода.
//
//  	ИмяСтраницыНавигации - Строка. Имя страницы панели "ПанельНавигации", 
//		которая соответствует текущему номеру перехода.
//
//  	ИмяОбработчикаПриОткрытии - Строка. Имя функции-обработчика события открытия текущей страницы помощника
&НаКлиенте
Функция СоздатьСтруктуруПараметровСтрокиПерехода(ИмяОсновнойСтраницы, ИмяСтраницыНавигации, ИмяОбработчикаПриОткрытии)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ИмяОсновнойСтраницы",            ИмяОсновнойСтраницы);
	СтруктураПараметров.Вставить("ИмяСтраницыНавигации",           ИмяСтраницыНавигации);
	СтруктураПараметров.Вставить("ИмяСтраницыДекорации",           "СтраницаДекорации");
	СтруктураПараметров.Вставить("ИмяОбработчикаПриОткрытии",      ИмяОбработчикаПриОткрытии);
	СтруктураПараметров.Вставить("ИмяОбработчикаПриПереходеДалее", "");
	СтруктураПараметров.Вставить("ИмяОбработчикаПриПереходеНазад", "");
	СтруктураПараметров.Вставить("ПропуститьШаг",                  Ложь);
	СтруктураПараметров.Вставить("ПропуститьНумерациюШага",        Ложь);
	
	Возврат СтруктураПараметров;
КонецФункции

// Добавляет новую строку в конец текущей таблицы переходов
//
// Параметры:
//
//  ПорядковыйНомерПерехода (обязательный) - Число. Порядковый номер перехода, который соответствует текущему шагу 
//  перехода
//  СтруктураПараметров - Структура, содержащая значения колонок в строке таблицы переходов
//  	ИмяОсновнойСтраницы - Строка. Имя страницы панели "ПанельОсновная", 
//		которая соответствует текущему номеру перехода
//
//  	ИмяСтраницыНавигации - Строка. Имя страницы панели "ПанельНавигации", 
//		которая соответствует текущему номеру перехода
//
//  	ИмяСтраницыДекорации - Строка. Имя страницы панели "ПанельДекорации", которая соответствует 
//  	текущему номеру перехода
//
//  	ИмяОбработчикаПриОткрытии - Строка. Имя функции-обработчика события открытия текущей страницы 
//  	помощника
//
//  	ИмяОбработчикаПриПереходеДалее - Строка. Имя функции-обработчика события перехода на следующую 
//  	страницу помощника
//
//  	ИмяОбработчикаПриПереходеНазад - Строка. Имя функции-обработчика события перехода на предыдущую 
//  	страницу помощника
// 
&НаСервере
Процедура ТаблицаПереходовНоваяСтрока(ПорядковыйНомерШага, СтруктураПараметров)
	НоваяСтрока = ТаблицаПереходов.Добавить();
	
	НоваяСтрока.ПорядковыйНомерПерехода = ПорядковыйНомерШага;
	ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураПараметров);
	
	ПорядковыйНомерШага = ПорядковыйНомерШага + 1;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПереходПоТаблицеПереходов(ЭтоПереходДалее)
	Итератор = 0;
	
	Если ПорядковыйНомерПерехода > 0
		И ПорядковыйНомерПерехода <= ТаблицаПереходов.Количество() Тогда
	
		СтрокиПерехода = ТаблицаПереходов.НайтиСтроки(Новый Структура("ПорядковыйНомерПерехода", ПорядковыйНомерПерехода));
		
		Если СтрокиПерехода.Количество() <> 1 Тогда
			// Ошибка в нумерации шагов таблицы переходов.
			Возврат;
		КонецЕсли;
		
		ВидОбработчика = ?(ЭтоПереходДалее, "ИмяОбработчикаПриПереходеДалее", "ИмяОбработчикаПриПереходеНазад");
		
		СтрокаПерехода = СтрокиПерехода[0];
		Если Не ПустаяСтрока(СтрокаПерехода[ВидОбработчика]) Тогда
			
			ИмяПроцедуры = "Подключаемый_[ИмяОбработчика](Отказ)";
			ИмяПроцедуры = СтрЗаменить(ИмяПроцедуры, "[ИмяОбработчика]", СтрокаПерехода[ВидОбработчика]);
			
			Отказ = Ложь;
			Попытка
				РезультатВычисления = Вычислить(ИмяПроцедуры);
			Исключение
				Информация = ИнформацияОбОшибке();
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = КраткоеПредставлениеОшибки(Информация);
				Сообщение.Сообщить();
				
				ТекстОшибки = ПодробноеПредставлениеОшибки(Информация);
				ЗаписатьОшибкуРаботыПомощника(ТекстОшибки);
				
				Отказ = Истина;
			КонецПопытки;
			
			Если Отказ Тогда
				Возврат;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЭтоПереходДалее Тогда
		Для Сч = ПорядковыйНомерПерехода + 1 По ТаблицаПереходов.Количество() Цикл
			СтрокаПереходов = ТаблицаПереходов[Сч - 1];
			
			Итератор = Итератор + 1;
			
			Если СтрокаПереходов.ПропуститьШаг Тогда
				Продолжить;
			КонецЕсли;
			
			Прервать;
		КонецЦикла;
	Иначе
		Для Сч = -(ПорядковыйНомерПерехода - 1) По -1 Цикл
			СтрокаПереходов = ТаблицаПереходов[-Сч - 1];
			
			Итератор = Итератор - 1;
			
			Если СтрокаПереходов.ПропуститьШаг Тогда
				Продолжить;
			КонецЕсли;
			
			Прервать;
		КонецЦикла;
	КонецЕсли;
	
	УстановитьПорядковыйНомерПерехода(ПорядковыйНомерПерехода + Итератор);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПорядковыйНомерПерехода(Знач Значение)
	
	ЭтоПереходДалее = (Значение > ПорядковыйНомерПерехода);
	ПорядковыйНомерПерехода = Макс(0, Значение);
	ПорядковыйНомерПереходаПриИзменении(ЭтоПереходДалее);
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядковыйНомерПереходаПриИзменении(ЭтоПереходДалее)
	
	СтрокиПереходаТекущие = ТаблицаПереходов.НайтиСтроки(Новый Структура("ПорядковыйНомерПерехода",
		ПорядковыйНомерПерехода));
	
	Если СтрокиПереходаТекущие.Количество() <> 1 Тогда
		// Ошибка в нумерации шагов таблицы переходов.
		Возврат;
	КонецЕсли;
	
	СтрокаПереходаТекущая = СтрокиПереходаТекущие[0];
	
	// Обработчик ПриОткрытии
	Если Не ПустаяСтрока(СтрокаПереходаТекущая.ИмяОбработчикаПриОткрытии) Тогда
		
		ИмяПроцедуры = "Подключаемый_[ИмяОбработчика](Отказ, ПропуститьСтраницу, ЭтоПереходДалее)";
		ИмяПроцедуры = СтрЗаменить(ИмяПроцедуры, "[ИмяОбработчика]", СтрокаПереходаТекущая.ИмяОбработчикаПриОткрытии);
		
		Отказ = Ложь;
		ПропуститьСтраницу = Ложь;
		
		Попытка
			РезультатВычисления = Вычислить(ИмяПроцедуры);
		Исключение
			Информация = ИнформацияОбОшибке();
				
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = КраткоеПредставлениеОшибки(Информация);
			Сообщение.Сообщить();
			
			ТекстОшибки = ПодробноеПредставлениеОшибки(Информация);
			ЗаписатьОшибкуРаботыПомощника(ТекстОшибки);
			
			Отказ = Истина;
		КонецПопытки;
		
		Если Отказ Тогда
			ВыполнитьПереходПоТаблицеПереходов(Ложь);
			Возврат;
		ИначеЕсли ПропуститьСтраницу Тогда
			ВыполнитьПереходПоТаблицеПереходов(ЭтоПереходДалее);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьОтображениеТекущейСтраницыПомощника(Элементы, СтрокаПереходаТекущая);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтображениеТекущейСтраницыПомощника(ЭлементыФормы, СтрокаПерехода)
	СтраницаДекорации = ЭлементыФормы.Найти(СтрокаПерехода.ИмяСтраницыДекорации);
	Если СтраницаДекорации <> Неопределено Тогда
		ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(ЭлементыФормы,
			"ПанельДекорации",
			"ТекущаяСтраница",
			СтраницаДекорации);
	КонецЕсли;
	
	СтраницаОсновная = ЭлементыФормы.Найти(СтрокаПерехода.ИмяОсновнойСтраницы);
	Если СтраницаОсновная <> Неопределено Тогда
		ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(ЭлементыФормы,
			"ПанельОсновная",
			"ТекущаяСтраница",
			СтраницаОсновная);
	КонецЕсли;
	
	СтраницаНавигации = ЭлементыФормы.Найти(СтрокаПерехода.ИмяСтраницыНавигации);
	Если СтраницаНавигации <> Неопределено Тогда
		ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(ЭлементыФормы,
			"ПанельНавигации",
			"ТекущаяСтраница",
			СтраницаНавигации);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПеренумероватьЗаголовкиШагов()
	
	Нумератор = 0;
	Для Каждого СтрокаПереходов Из ТаблицаПереходов Цикл
		Если СтрокаПереходов.ПропуститьШаг
			Или СтрокаПереходов.ПропуститьНумерациюШага Тогда
			Продолжить;
		КонецЕсли;
		
		Нумератор = Нумератор + 1;
		ИмяЭлементаДекорации = "ДекорацияНомерШага" + СтрокаПереходов.ИмяОсновнойСтраницы;
		
		Если Элементы.Найти(ИмяЭлементаДекорации) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Элементы[ИмяЭлементаДекорации].Заголовок = НСтр("ru = 'Шаг'") + " " + Нумератор + ".";
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаДалее(Команда)
	
	ВыполнитьПереходПоТаблицеПереходов(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаНазад(Команда)
	
	ВыполнитьПереходПоТаблицеПереходов(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаГотово(Команда)
	
	ВыполняетсяЗакрытие = Истина;
	Закрыть();	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ЗаписатьОшибкуРаботыПомощника(ТекстОшибки)
	
	ЗаписьЖурналаРегистрации(НСтр("ru = 'Помощник перехода с других конфигураций'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОписаниеДоступныхКонфигурацийИсточника()
	
	Если ПустаяСтрока(Объект.КонфигурацияИсточник) Тогда
		// Режим загрузки данных из произвольной доступной конфигурации.
		Заголовок = НСтр("ru = 'Помощник переноса данных из других конфигураций ""1С:Предприятие 8""'");
		
		ТекстОписание = "";
		КоличествоКонфигураций = ДоступныеКонфигурацииИсточника.Количество();
		
		Сч = 0;
		Для Каждого КонфигурацияИсточника Из ДоступныеКонфигурацииИсточника Цикл
			Сч = Сч + 1;
			
			Если Сч > 1 Тогда
				ТекстОписание = ТекстОписание + Символы.ПС;
			КонецЕсли;
			
			ТекстОписание = ТекстОписание + "  - " + КонфигурацияИсточника.Представление;
			
			Если Сч < КоличествоКонфигураций Тогда
				ТекстОписание = ТекстОписание + ";";
			Иначе
				ТекстОписание = ТекстОписание + ".";
			КонецЕсли;
		КонецЦикла;
		
		Элементы.Декорация1_1.Заголовок = НСтр("ru = 'Помощник позволит вам загрузить данные из конфигураций'");
		
		Элементы.Декорация1_2.Видимость = Истина;
		Элементы.Декорация1_2.Заголовок = ТекстОписание;
	Иначе
		// Режим загрузки данных из конкретной конфигурации.
		СинонимИсточника = "";
		
		ЭлементИсточник = ДоступныеКонфигурацииИсточника.НайтиПоЗначению(Объект.КонфигурацияИсточник);
		Если Не ЭлементИсточник = Неопределено Тогда
			СинонимИсточника = ЭлементИсточник.Представление;
		Иначе
			Возврат;
		КонецЕсли;
		
		Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Помощник переноса данных из ""%1""'"), СинонимИсточника);
			
		Элементы.Декорация1_1.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Помощник позволит вам загрузить данные из конфигурации ""%1"".'"), СинонимИсточника);
			
		Элементы.Декорация1_2.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДоступныеКонфигурацииИсточника()
	
	ДоступныеКонфигурацииИсточника.Очистить();
	
	Если Объект.КонфигурацияПриемник = "УП"
		Или Объект.КонфигурацияПриемник = "КА" Тогда
		ДоступныеКонфигурацииИсточника.Добавить("УПП", НСтр("ru = '1С:Управление производственным предприятием, редакция 1.3'"));
		ДоступныеКонфигурацииИсточника.Добавить("КА",  НСтр("ru = '1С:Комплексная автоматизация, редакция 1.1'"));
		ДоступныеКонфигурацииИсточника.Добавить("ЗУП25", НСтр("ru = '1С:Зарплата и управление персоналом, редакция 2.5'"));
		ДоступныеКонфигурацииИсточника.Добавить("ЗУП31", НСтр("ru = '1С:Зарплата и управление персоналом, редакция 3.1'"));
	КонецЕсли;
	
	Если Объект.КонфигурацияПриемник = "УП"
		Или Объект.КонфигурацияПриемник = "КА"
		Или Объект.КонфигурацияПриемник = "УТ" Тогда
		ДоступныеКонфигурацииИсточника.Добавить("УТ",  НСтр("ru = '1С:Управление торговлей, редакция 10.3'"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИмяМакетаПравилПоКонфигурацииИсточника(КонфигурацияИсточника, ВидДанных)
	
	ИмяМакета = "";
	
	Если ВидДанных = "ОД" Тогда
		Если КонфигурацияИсточника = "УПП"
			Или КонфигурацияИсточника = "КА" Тогда
			ИмяМакета = "ПравилаОбменаУПП";
		ИначеЕсли КонфигурацияИсточника = "УТ" Тогда
			ИмяМакета = "ПравилаОбменаУТ";
		ИначеЕсли КонфигурацияИсточника = "ЗУП25" Тогда
			ИмяМакета = "ПравилаОбменаЗУП";
		ИначеЕсли КонфигурацияИсточника = "ЗУП31" Тогда
			ИмяМакета = "ПравилаОбменаЗУП31";
		КонецЕсли;
	ИначеЕсли ВидДанных = "ЗУП" Тогда
		Если КонфигурацияИсточника = "УПП"
			Или КонфигурацияИсточника = "КА" Тогда
			ИмяМакета = "ПравилаОбменаЗУП";
		КонецЕсли;
	КонецЕсли;
	
	Возврат ИмяМакета;
	
КонецФункции

&НаСервере
Процедура УстановитьЗаголовкиКонфигурацииПриемника(Элемент)
	
	Элементы[Элемент].Заголовок = 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Элементы[Элемент].Заголовок, МетаданныеСиноним);

КонецПроцедуры
	
&НаКлиенте
Процедура ОбновитьТаблицуПереходов()
	
	ТаблицаПереходовПоСценарию();
	ПеренумероватьЗаголовкиШагов();
	
КонецПроцедуры

&НаКлиенте
Функция СостояниеЭтапаВОчереди()
	Возврат "ВОчереди";
КонецФункции

&НаКлиенте
Функция СостояниеЭтапаВыполняется()
	Возврат "Выполняется";
КонецФункции

&НаКлиенте
Функция СостояниеЭтапаОшибка()
	Возврат "Ошибка";
КонецФункции

&НаКлиенте
Функция СостояниеЭтапаУспех()
	Возврат "Успех";
КонецФункции

&НаКлиенте
Процедура ИнициализацияЭтаповЗагрузки()
	
	// Значение списка - идентификатор этапа, представление - состояние этапа.
	СписокЭтапов.Очистить();
	
	СписокЭтапов.Добавить("Выгрузка", СостояниеЭтапаВОчереди());
	СписокЭтапов.Добавить("Загрузка", СостояниеЭтапаВОчереди());
	СписокЭтапов.Добавить("Проверка", СостояниеЭтапаВОчереди());
	
КонецПроцедуры

&НаКлиенте
Процедура Перерисовать()
	
	ЗакладкиСостояний = Новый Структура;
	ЗакладкиСостояний.Вставить(СостояниеЭтапаВОчереди(),    "НеВыполняется");
	ЗакладкиСостояний.Вставить(СостояниеЭтапаВыполняется(), "Выполняется");
	ЗакладкиСостояний.Вставить(СостояниеЭтапаОшибка(),      "Выполнено");
	ЗакладкиСостояний.Вставить(СостояниеЭтапаУспех(),       "Выполнено");
	
	НомераСостояний = Новый Структура;
	НомераСостояний.Вставить(СостояниеЭтапаВОчереди(),    1);
	НомераСостояний.Вставить(СостояниеЭтапаВыполняется(), 2);
	НомераСостояний.Вставить(СостояниеЭтапаОшибка(),      3);
	НомераСостояний.Вставить(СостояниеЭтапаУспех(),       4);
	
	СброситьВидимость = Ложь;
	
	Для Каждого Этап Из СписокЭтапов Цикл
		ИмяЭтапа  = Этап.Значение;
		Состояние = Этап.Представление;
		
		Если ИмяЭтапа = "Проверка" Тогда
			Если Не Объект.КонфигурацияИсточник = "УПП"
				И Не Объект.КонфигурацияИсточник = "КА" Тогда
				СброситьВидимость = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Элементы[ИмяЭтапа].ТекущаяСтраница = Элементы[ИмяЭтапа + Формат(НомераСостояний[Состояние], "ЧГ=0")];
		Элементы[ИмяЭтапа + "Надпись"].ТекущаяСтраница = Элементы[ИмяЭтапа + "Надпись" + ЗакладкиСостояний[Состояние]];
		
		Если СброситьВидимость Тогда
			Элементы["Группа" + ИмяЭтапа].Видимость = Ложь;
		Иначе
			Элементы["Группа" + ИмяЭтапа].Видимость = Истина;
			Если Состояние = СостояниеЭтапаВыполняется()
				Или Состояние = СостояниеЭтапаОшибка()
				Или Состояние = СостояниеЭтапаВОчереди() Тогда
				СброситьВидимость = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСостояниеТекущегоЭтапа(Состояние)
	
	ЭлементЭтап = СписокЭтапов.НайтиПоЗначению(ТекущийЭтап);
	Если Не ЭлементЭтап = Неопределено Тогда
		ЭлементЭтап.Представление = Состояние;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СостояниеТекущегоЭтапа()
	
	Состояние = Неопределено;
	
	ЭлементЭтап = СписокЭтапов.НайтиПоЗначению(ТекущийЭтап);
	Если Не ЭлементЭтап = Неопределено Тогда
		Состояние = ЭлементЭтап.Представление;
	КонецЕсли;
	
	Возврат Состояние;
	
КонецФункции

&НаСервере
Процедура ОбработатьФайлПротокола(ФайлПротокола)
	
	Если АвтоТестОбмена Тогда
		ТекстПротокола = ФайлПротокола.ПолучитьТекст();
		Разделитель = ?(СтрНайти(ТекстПротокола, "Ошибка!") > 0, "Ошибка!", "Ошибка.");
		МассивОшибок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекстПротокола, Разделитель, Истина);
		Для Каждого ОписаниеОшибки Из МассивОшибок Цикл
			ЗафиксироватьОшибку(ЭтотОбъект, ОписаниеОшибки, "");
		КонецЦикла;
	Иначе
		СтрокиПоиска = Новый Массив;
		СтрокиПоиска.Добавить(НСтр("ru = 'Начало выгрузки'"));
		СтрокиПоиска.Добавить(ВРег(НСтр("ru = 'Правило выгрузки данных'")));
		СтрокиПоиска.Добавить(ВРег(НСтр("ru = 'Выгрузка объекта'")));
		СтрокиПоиска.Добавить(НСтр("ru = 'Конвертация объекта'"));
		СтрокиПоиска.Добавить(НСтр("ru = 'Ошибка'") + ".");
		СтрокиПоиска.Добавить(НСтр("ru = 'Окончание выгрузки'"));
		СтрокиПоиска.Добавить(НСтр("ru = 'Ошибка'") + "!!!");
		СтрокиПоиска.Добавить(НСтр("ru = 'ИмяПКО'"));
		СтрокиПоиска.Добавить(НСтр("ru = 'ТипОбъекта'"));
		СтрокиПоиска.Добавить(НСтр("ru = 'КодСообщения'"));
		СтрокиПоиска.Добавить(НСтр("ru = 'Загрузка объекта'"));
		
		КоличествоСтрокПоиска = СтрокиПоиска.Количество();
		
		Для Номер = 1 По ФайлПротокола.КоличествоСтрок() Цикл
			СтрокаРезультата = СокрЛП(ФайлПротокола.ПолучитьСтроку(Номер));
			
			Если ПустаяСтрока(СтрокаРезультата) Тогда
				Продолжить;
			КонецЕсли;
			
			НашлиСтроку = Ложь;
			Для Сч = 0 По КоличествоСтрокПоиска - 1 Цикл
				Если СтрНайти(СтрокаРезультата, СтрокиПоиска[Сч]) = 1 Тогда
					НашлиСтроку = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если НашлиСтроку Тогда
				Продолжить;
			КонецЕсли;
			
			ТекстОшибок = СтрокаРезультата;
			ЗафиксироватьОшибку(ЭтотОбъект, ТекстОшибок, "", Ложь);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗафиксироватьОшибку(Форма, ТекстОшибки, ТекстРекомендации = "", ВажнаяОшибка = Истина)
	
	Этап = Форма.ТекущийЭтап;
	Автотест = Форма.АвтоТестОбмена;
	Если ЗначениеЗаполнено(Этап) И Не Автотест
		Или Автотест И ВажнаяОшибка Тогда
		НоваяОшибка = Форма.ТаблицаОшибок.Добавить();
		НоваяОшибка.Этап         = Этап;
		НоваяОшибка.Ошибка       = ТекстОшибки;
		НоваяОшибка.Рекомендации = ТекстРекомендации;
		НоваяОшибка.Расшифровка  = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодготовитьОтчетОбОшибках()
	
	ОтчетОбОшибках = Новый ТабличныйДокумент;
	ПодготовитьОтчетОбОшибкахСервер(ОтчетОбОшибках);
	
	ОтчетОбОшибках.ТолькоПросмотр      = Истина;
	ОтчетОбОшибках.ОтображатьЗаголовки = Ложь;
	ОтчетОбОшибках.ОтображатьСетку     = Ложь;
	
	ОтчетОбОшибках.Показать(НСтр("ru = 'Список комментариев и ошибок'"));
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьОтчетОбОшибкахСервер(ОтчетОбОшибках)
	
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("СписокОшибок");
	
	ОбластьШапка             = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока            = Макет.ПолучитьОбласть("Строка");
	ОбластьЗаголовокВыгрузка = Макет.ПолучитьОбласть("ЗаголовокВыгрузка");
	ОбластьЗаголовокЗагрузка = Макет.ПолучитьОбласть("ЗаголовокЗагрузка");
	ОбластьЗаголовокПроверка = Макет.ПолучитьОбласть("ЗаголовокПроверка");
	ОбластьШапкаТаблицы      = Макет.ПолучитьОбласть("ШапкаТаблицы");
	
	КонфигурацияИсточника = ДоступныеКонфигурацииИсточника.НайтиПоЗначению(Объект.КонфигурацияИсточник);
	Если Не КонфигурацияИсточника = Неопределено Тогда
		ОбластьШапка.Параметры.ИмяИБ = КонфигурацияИсточника.Представление;
	КонецЕсли;
	
	ОбластьШапка.Параметры.ПутьКИБ = Объект.ИмяФайлаДанных;
	
	ОтчетОбОшибках.Вывести(ОбластьШапка);
	
	ВыведенЗаголовокВыгрузки = Ложь;
	ВыведенЗаголовокЗагрузки = Ложь;
	
	Для Каждого СтрокаТаблицы Из ТаблицаОшибок Цикл
		Если Не ВыведенЗаголовокВыгрузки
			И СтрНайти(СтрокаТаблицы.Этап, "Выгрузка") > 0 Тогда
			ОтчетОбОшибках.Вывести(ОбластьЗаголовокВыгрузка);
			ОтчетОбОшибках.Вывести(ОбластьШапкаТаблицы);
			ВыведенЗаголовокВыгрузки = Истина;
		КонецЕсли;
		
		Если Не ВыведенЗаголовокЗагрузки
			И СтрНайти(СтрокаТаблицы.Этап, "Загрузка") > 0 Тогда
			ОтчетОбОшибках.Вывести(ОбластьЗаголовокЗагрузка);
			ОтчетОбОшибках.Вывести(ОбластьШапкаТаблицы);
			ВыведенЗаголовокЗагрузки = Истина;
		КонецЕсли;
					
		ОбластьСтрока.Параметры.Ошибка = СтрокаТаблицы.Ошибка;
		
		ОтчетОбОшибках.Вывести(ОбластьСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьУстановкуРасширенияРаботыСФайлами(ДополнительныеПараметры, ИмяОповещения)
	
	ТекстПредупреждения = НСтр("ru = 'Для данной операции необходимо установить расширение для веб-клиента 1С:Предприятие.'");
	Оповещение = Новый ОписаниеОповещения(ИмяОповещения, ЭтотОбъект, ДополнительныеПараметры);
	ОбщегоНазначенияКлиент.ПоказатьВопросОбУстановкеРасширенияРаботыСФайлами(Оповещение, ТекстПредупреждения, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВыбораФайлаЗавершение(Знач Результат, Знач ДополнительныеПараметры) Экспорт
	
	Если Результат <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	ИмяСвойства = ДополнительныеПараметры.ИмяСвойства;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ЗаполнитьЗначенияСвойств(Диалог, ДополнительныеПараметры.ПараметрыДиалога);
	
	Диалог.ПолноеИмяФайла = Объект[ИмяСвойства];
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьФайлЗавершениеОтображенияДиалогаВыбораФайла", ЭтотОбъект, ДополнительныеПараметры);
	Диалог.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФайлЗавершениеОтображенияДиалогаВыбораФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		Объект[ДополнительныеПараметры.ИмяСвойства] = ВыбранныеФайлы[0];
		ЭтаФорма.ОбновитьОтображениеДанных();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПомещениеФайлаВХранилищеНачать()
	
	ОбработчикПомещенияФайла = Новый ОписаниеОповещения("ПомещениеФайлаВХранилищеЗавершить", ЭтотОбъект);
		
	Попытка
		НачатьПомещениеФайла(ОбработчикПомещенияФайла, , Объект.ИмяФайлаДанных, Ложь, УникальныйИдентификатор);
	Исключение
		ТекстСообщения = НСтр("ru = 'При помещении файлов во временное хранилище произошла ошибка'")
			+ ":" + Символы.ПС + ОписаниеОшибки();
		ЗафиксироватьОшибку(ЭтотОбъект, ТекстСообщения);
		
		ОбновитьСостояниеТекущегоЭтапа(СостояниеЭтапаОшибка());
		ЗагрузкаДанныхИзФайлаЗакончить();
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПомещениеФайлаВХранилищеЗавершить(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	Отказ = Ложь;
	ТекстСообщения = "";
	ТекстПояснения = "";
	
	Если Не ПустаяСтрока(Адрес) Тогда
		
		АдресДанныхДляЗагрузки     = Адрес;
		ПроверитьАрхивСДанными(Отказ, ТекстСообщения);
		
		Если Не Отказ Тогда
			
			ОбновитьСостояниеТекущегоЭтапа(СостояниеЭтапаУспех());
			Перерисовать();
			
			ПодключитьОбработчикОжидания("ЗагрузкаДанныхИзФайлаНачать", 0.5, Истина);
		Иначе
			
			ТекстПояснения = НСтр("ru = 'Проверьте корректность содержимого файла с данными'") + ".";
			
		КонецЕсли;
		
	Иначе
		
		Отказ = Истина;
		ТекстСообщения = Нстр("ru = 'Не удалось получить данные для загрузки'") + ".";
		ТекстПояснения = НСтр("ru = 'Укажите корректный путь к файлу данных'") + ".";
		
	КонецЕсли;
	
	Если Отказ Тогда
		
		ЗафиксироватьОшибку(ЭтотОбъект, ТекстСообщения, ТекстПояснения);
		
		ОбновитьСостояниеТекущегоЭтапа(СостояниеЭтапаОшибка());
		ЗагрузкаДанныхИзФайлаЗакончить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаДанныхИзФайлаНачать()
	
	ТекущийЭтап = "Загрузка";
	ОбновитьСостояниеТекущегоЭтапа(СостояниеЭтапаВыполняется());
	Перерисовать();
	
	Элементы.ГруппаРезультат.Видимость         = Истина;
	Элементы.СтраницыРезультат.ТекущаяСтраница = Элементы.ПроцессФайл;
	
	ПодключитьОбработчикОжидания("ЗагрузкаДанныхИзФайлаВыполнитьВФоне", 0.5, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаДанныхИзФайлаВыполнитьВФоне()
	
	Результат = РезультатЗагрузкиДанныхВДлительнойОперации();
	
	Если Результат.Статус = "Выполнено" Тогда
		
		РезультатыВыполнения = ПолучитьИзВременногоХранилища(АдресХранилища);
		ИдентификаторЗадания = Неопределено;
		ЗагрузкаДанныхИзФайлаЗакончить(РезультатыВыполнения);
		
	Иначе
		
		ИдентификаторЗадания = Результат.ИдентификаторЗадания;
		АдресХранилища       = Результат.АдресРезультата;
		
		ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаДанныхИзФайлаЗакончить(РезультатыВыполнения = Неопределено)
	
	Если Не РезультатыВыполнения = Неопределено Тогда
		Ошибка = Ложь;
		
		Для Каждого РезультатВыполнения Из РезультатыВыполнения Цикл
		
			Если РезультатВыполнения.Ошибка Тогда
				Ошибка = Истина;
			КонецЕсли;
		
			ОбработатьФайлПротокола(РезультатВыполнения.ПротоколОбмена);
		КонецЦикла;
		
		Если Ошибка Тогда
			ОбновитьСостояниеТекущегоЭтапа(СостояниеЭтапаОшибка());
		Иначе
			ОбновитьСостояниеТекущегоЭтапа(СостояниеЭтапаУспех());
			
			Если ТекущийЭтап = "Загрузка"
				И (Объект.КонфигурацияИсточник = "УПП"
					Или Объект.КонфигурацияИсточник = "КА") Тогда
				ТекущийЭтап = "Проверка";
				ОбновитьСостояниеТекущегоЭтапа(СостояниеЭтапаУспех());
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ПанельНавигации.Доступность = Истина;
	Элементы.ГруппаРезультат.Видимость   = Истина;
	
	Перерисовать();
	
	Если Не СостояниеТекущегоЭтапа() = "Ошибка" Тогда
		Элементы.СтраницыРезультат.ТекущаяСтраница = Элементы.Успех;
		
		Если ТаблицаОшибок.Количество() > 0 Тогда
			Элементы.ГиперссылкаПротокол.Видимость = Истина;
			Элементы.ГиперссылкаПротокол.Заголовок = НСтр("ru = 'Протокол загрузки данных'")
				+ " " + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = '(сообщений: %1)'"), ТаблицаОшибок.Количество());
			Иначе
				Элементы.ГиперссылкаПротокол.Видимость = Ложь;
				Элементы.ГиперссылкаПротокол.Заголовок = НСтр("ru = 'Протокол загрузки данных'");
		КонецЕсли;
	Иначе
		Элементы.СтраницыРезультат.ТекущаяСтраница = Элементы.Ошибки;
		
		Если ТаблицаОшибок.Количество() > 0 Тогда
			Элементы.ГиперссылкаОшибки.Видимость = Истина;
			Элементы.ГиперссылкаОшибки.Заголовок = НСтр("ru = 'Список комментариев и ошибок'")
			+ " " + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '(сообщений: %1)'"), ТаблицаОшибок.Количество());
		Иначе
			Элементы.ГиперссылкаОшибки.Видимость = Ложь;
			Элементы.ГиперссылкаОшибки.Заголовок = НСтр("ru = 'Список комментариев и ошибок'");
		КонецЕсли;
	КонецЕсли;
	
	Если АвтоТестОбмена Тогда
		АвтотестЗавершить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьАрхивСДанными(Отказ, ТекстСообщения)
	
	ЭтапыЗагрузки.Очистить();
	
	ИмяФайлаАрхива = ПолучитьИмяВременногоФайлаОбмена();
	
	ДанныеФайла = ПолучитьИзВременногоХранилища(АдресДанныхДляЗагрузки);
	ДанныеФайла.Записать(ИмяФайлаАрхива);
	
	Архив = Новый ЧтениеZipФайла(ИмяФайлаАрхива);
	
	Для Каждого ЭлементАрхива Из Архив.Элементы Цикл
		Если ЭлементАрхива.Расширение <> "xml" Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяФайла = ЭлементАрхива.Имя;
		
		ИсточникНайден     = Ложь;
		ИмяМакетаПравил    = "";
		ПредставлениеЭтапа = "";
		
		Если ПустаяСтрока(Объект.КонфигурацияИсточник) Тогда
			Для Каждого КонфигурацияИсточника Из ДоступныеКонфигурацииИсточника Цикл
				Если СтрНайти(ИмяФайла, КонфигурацияИсточника.Значение + Объект.КонфигурацияПриемник + "_ОД") = 1 Тогда
					Объект.КонфигурацияИсточник = КонфигурацияИсточника.Значение;
					ИсточникНайден     = Истина;
					ИмяМакетаПравил    = ИмяМакетаПравилПоКонфигурацииИсточника(КонфигурацияИсточника.Значение, "ОД");
					ПредставлениеЭтапа = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Загрузка основных данных из конфигурации %1'"), КонфигурацияИсточника.Представление);
					Прервать;
				ИначеЕсли СтрНайти(ИмяФайла, КонфигурацияИсточника.Значение + Объект.КонфигурацияПриемник + "_ЗУП") = 1 Тогда
					Объект.КонфигурацияИсточник = КонфигурацияИсточника.Значение;
					ИсточникНайден     = Истина;
					ИмяМакетаПравил    = ИмяМакетаПравилПоКонфигурацииИсточника(КонфигурацияИсточника.Значение, "ЗУП");
					ПредставлениеЭтапа = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Загрузка кадровых и зарплатных данных из конфигурации %1'"), КонфигурацияИсточника.Представление);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		Иначе
			КонфигурацияИсточника = ДоступныеКонфигурацииИсточника.НайтиПоЗначению(Объект.КонфигурацияИсточник);
			
		 	Если СтрНайти(ИмяФайла, Объект.КонфигурацияИсточник + Объект.КонфигурацияПриемник + "_ОД") = 1 Тогда
				ИсточникНайден     = Истина;
				ИмяМакетаПравил    = ИмяМакетаПравилПоКонфигурацииИсточника(Объект.КонфигурацияИсточник, "ОД");
				ПредставлениеЭтапа = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Загрузка основных данных из конфигурации %1'"), КонфигурацияИсточника.Представление);
			ИначеЕсли СтрНайти(ИмяФайла, Объект.КонфигурацияИсточник + Объект.КонфигурацияПриемник + "_ЗУП") = 1 Тогда
				ИсточникНайден     = Истина;
				ИмяМакетаПравил    = ИмяМакетаПравилПоКонфигурацииИсточника(Объект.КонфигурацияИсточник, "ЗУП");
				ПредставлениеЭтапа = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Загрузка кадровых и зарплатных данных из конфигурации %1'"), КонфигурацияИсточника.Представление);
			КонецЕсли;
		КонецЕсли;
		
		Если РазделениеВключено И Не ЗначениеЗаполнено(ИмяМакетаПравил)
			Или Не ИсточникНайден Тогда
			Отказ = Истина;
		КонецЕсли;
		
		Если Отказ Тогда
			ТекстСообщения = НСтр("ru = 'Ошибка формата файла. Выберите корректный файл с данными для загрузки.'");
			Прервать;
		Иначе
			ЭтапЗагрузки = Новый Структура;
			ЭтапЗагрузки.Вставить("ИмяФайлаДляЗагрузки", ЭлементАрхива.Имя);
			ЭтапЗагрузки.Вставить("ПредставлениеЭтапа",  ПредставлениеЭтапа);
			ЭтапЗагрузки.Вставить("ИмяМакетаПравил",     ИмяМакетаПравил);
			
			ЭтапыЗагрузки.Добавить(ЭтапЗагрузки);
		КонецЕсли;
	КонецЦикла;
	
	Если Не Отказ И ЭтапыЗагрузки.Количество() = 0 Тогда
		Отказ = Истина;
		ТекстСообщения = НСтр("ru = 'Ошибка формата файла. Выберите корректный файл с данными для загрузки.'");
	КонецЕсли;
	
	Если Не Отказ Тогда
		АдресВременногоФайлаСервер = ИмяФайлаАрхива;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция РезультатЗагрузкиДанныхВДлительнойОперации()
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ЭтапыЗагрузки",      ЭтапыЗагрузки);
	ПараметрыПроцедуры.Вставить("Источник",           Объект.КонфигурацияИсточник);
	ПараметрыПроцедуры.Вставить("Приемник",           Объект.КонфигурацияПриемник);
	ПараметрыПроцедуры.Вставить("БезопаснаяЗагрузка", РазделениеВключено);
	ПараметрыПроцедуры.Вставить("АвтотестОбмена",     АвтоТестОбмена);
	
	Если НЕ ЗначениеЗаполнено(АдресВременногоФайлаСервер) Тогда
		АдресВременногоФайлаСервер = ПолучитьИмяВременногоФайлаОбмена();
	КонецЕсли;
	
	ВременныйФайлСервер = Новый Файл(АдресВременногоФайлаСервер);
	Если НЕ ВременныйФайлСервер.Существует() Тогда
		ДанныеФайла = ПолучитьИзВременногоХранилища(АдресДанныхДляЗагрузки);
		ДанныеФайла.Записать(АдресВременногоФайлаСервер);
	КонецЕсли;
	
	ПараметрыПроцедуры.Вставить("ДанныеДляЗагрузки",  АдресВременногоФайлаСервер);
	
	Если Не ПустаяСтрока(Объект.КонфигурацияИсточник) Тогда
		КонфигурацияИсточника = ДоступныеКонфигурацииИсточника.НайтиПоЗначению(Объект.КонфигурацияИсточник);
		
		НаименованиеЗадания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Перенос данных из конфигурации ""%1""'"), КонфигурацияИсточника.Представление);
	Иначе
		НаименованиеЗадания = НСтр("ru = 'Перенос данных из другой конфигурации ""1С:Предприятие 8""'");
	КонецЕсли;
	
	ИмяПроцедуры = "Обработки.ПомощникПереходаСДругихКонфигураций.ЗагрузитьДанные";
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	
	Результат = ДлительныеОперации.ВыполнитьВФоне(ИмяПроцедуры, ПараметрыПроцедуры, ПараметрыВыполнения);
	
	АдресХранилища = Результат.АдресРезультата;
	
	Возврат Результат;
	
КонецФункции

// Унифицированная процедура проверки выполнения фонового задания.
//
&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
	
	Попытка
		Если ЗаданиеВыполнено(ИдентификаторЗадания) Тогда 
			
			РезультатыВыполнения  = ПолучитьИзВременногоХранилища(АдресХранилища);
			ИдентификаторЗадания = Неопределено;
			ЗагрузкаДанныхИзФайлаЗакончить(РезультатыВыполнения);
			
		Иначе
			ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
			ПодключитьОбработчикОжидания(
				"Подключаемый_ПроверитьВыполнениеЗадания",
				ПараметрыОбработчикаОжидания.ТекущийИнтервал,
				Истина);
		КонецЕсли;
	Исключение
		ЗафиксироватьОшибку(ЭтаФорма, ОписаниеОшибки());
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИмяВременногоФайлаОбмена()
	
	// Используем механизмы БСП для получения имени временного файла
	// вместо "ПолучитьИмяВременногоФайла", т.к. при использовании кластера
	// серверов имя может быть сформировано некорректно.
	ИмяВременногоФайла = ОбщегоНазначенияКлиентСервер.ПолучитьПолноеИмяФайла(
		ОбменДаннымиПовтИсп.КаталогВременногоХранилищаФайлов(),
		"Message{"+Строка(Новый УникальныйИдентификатор)+"}.zip");
		
	Возврат ИмяВременногоФайла;	
		
КонецФункции

&НаСервереБезКонтекста
Функция ЗаданиеВыполнено(ИдентификаторЗадания)
	
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
	
КонецФункции

&НаСервереБезКонтекста
Процедура ОтменитьВыполнениеЗадания(ИдентификаторЗадания)
	
	ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);
	
КонецПроцедуры

&НаКлиенте
Процедура Автотест()
	
	Попытка
		ИнициализацияЭтаповЗагрузки();
		ЗагрузкаДанныхИзФайлаНачать();
	Исключение
		ЗафиксироватьОшибку(ЭтаФорма, ОписаниеОшибки());
		АвтотестЗавершить();
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура АвтотестЗавершить()
	
	Если ТипЗнч(ЭтотОбъект.ОписаниеОповещенияОЗакрытии) = Тип("ОписаниеОповещения") Тогда
		ВыполнитьОбработкуОповещения(ЭтотОбъект.ОписаниеОповещенияОЗакрытии, ТаблицаОшибок);
		ЭтотОбъект.ОписаниеОповещенияОЗакрытии = Неопределено;
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти