#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РассылкаЭлектронныхЧеков.ПриСозданииСпискаОчереди(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РассылкаЭлектронныхЧековКлиент.ПриОткрытииСпискаОчереди(ЭтотОбъект, Список);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборПоОшибкамПриИзменении(Элемент)
	
	РассылкаЭлектронныхЧековКлиент.ПриОткрытииСпискаОчереди(ЭтотОбъект, Список);
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Отправить(Команда)
	
	ОтправитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	
	УдалитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьОтправкуЭлектронныхЧеков(Команда)
	
	РассылкаЭлектронныхЧековКлиент.НастроитьОтправкуЭлектронныхЧеков();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедуры

&НаСервере
Процедура УдалитьНаСервере()
	
	МассивСтрок = МассивВыделенныхСтрок();
	РассылкаЭлектронныхЧеков.УдалитьСообщенияМассива(МассивСтрок);
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьНаСервере()
	
	МассивСтрок = МассивВыделенныхСтрок();
	РассылкаЭлектронныхЧеков.ОтправитьСообщенияМассива(МассивСтрок);
	
КонецПроцедуры

Функция МассивВыделенныхСтрок()
	
	МассивСтрок = Новый Массив;
	
	Для каждого ВыделеннаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
		
		МассивСтрок.Добавить(ВыделеннаяСтрока.Ссылка);
		
	КонецЦикла;
	
	Возврат МассивСтрок;
КонецФункции

#КонецОбласти
