
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Получение обновлений программы".
// ОбщийМодуль.ПолучениеОбновленийПрограммыПереопределяемый.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Определяет в не базовых версиях конфигураций необходимость использования
// настройки сохранения полученного дистрибутива платформы 1С:Предприятие
// в каталоге на локальном компьютере или в сети.
// Настройка отображается в параметрах установки платформы 1С:Предприятие
// помощника обновления программы.
// В базовых версиях конфигураций настройка не используется.
//
// Параметры:
//	Использование - Булево - в параметре возвращается необходимость использования настройки.
//		Истина - использовать настройку, Ложь - не использовать.
//		Значение по умолчанию - Ложь.
//
Процедура ПриОпределенииИспользованияКаталогаСохраненияДистрибутиваПлатформы(Использование) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти
