#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ДобавлениеНоменклатуры" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура УстановитьСпособОбеспечения(Команда)
	УстановитьСпособОбеспеченияНаСервере();
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНоменклатуруПоПроизводителю(Команда)
	
	ПараметрыФормы = Новый Структура;
	
	Если Элементы.Список.ТекущиеДанные <> Неопределено И Элементы.Список.ТекущиеДанные.Свойство("Склад") И Элементы.Список.ТекущиеДанные.Свойство("СпособОбеспечения") Тогда
		ПараметрыФормы.Вставить("Склад", Элементы.Список.ТекущиеДанные.Склад);
		ПараметрыФормы.Вставить("СпособОбеспечения", Элементы.Список.ТекущиеДанные.СпособОбеспечения);
	КонецЕсли;
	
	НоваяФорма = ОткрытьФорму("РегистрСведений.АТ_НастройкаАссортиментаЗакупки.Форма.ДобавлениеНоменклатуры", ПараметрыФормы, ЭтаФорма, ,ВариантОткрытияОкна.ОтдельноеОкно, , ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура УстановитьСпособОбеспеченияНаСервере()
	
	Если Не ЗначениеЗаполнено(СпособОбеспечения) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Выберете способ обеспечения для установки";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Если Элементы.Список.ВыделенныеСтроки.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Выделите строки для изменения";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из Элементы.Список.ВыделенныеСтроки Цикл
		МенеджерЗаписи = РегистрыСведений.АТ_НастройкаАссортиментаЗакупки.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Склад = Строка.Склад;
		МенеджерЗаписи.Номенклатура = Строка.Номенклатура;
		МенеджерЗаписи.СпособОбеспечения = СпособОбеспечения;
		МенеджерЗаписи.Записать(Истина);
	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти





