
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект = Параметры.Объект;
	
КонецПроцедуры
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ЗначениеЗаполнено(Объект) Тогда
		ВызватьИсключение "Не указан объект при открытии формы";
	КонецЕсли;
	
	ИницилизироватьДоставку();
	
КонецПроцедуры

&НаСервере
Функция ЭтоПеремещение()
	
	Возврат Объект.Метаданные().Реквизиты.Найти("СкладОтправитель") <> Неопределено;
	
КонецФункции

#Область Доставка

// Настройки для этой формы менять тут:

&НаСервере
Функция ДоступныеСпособыДоставки()
	
	// Возвращает доступные способы доставки для этой формы
	
	Способы = Новый Массив;
	//Способы.Добавить(Перечисления.СпособыДоставки.Самовывоз);
	Способы.Добавить(Перечисления.СпособыДоставки.ДоКлиента);
	//Способы.Добавить(Перечисления.СпособыДоставки.СиламиПеревозчикаДоПунктаПередачи);
	Способы.Добавить(Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу);
	//Способы.Добавить(Перечисления.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки);
	
	Возврат Способы;
	
КонецФункции
&НаСервере
Функция ПолучитьСписокОтправителей() Экспорт
	
	// Возвращает возможных отправителей в зависимости от настроек формы
	
	Массив = Новый Массив;
	
	Если ЭтоПеремещение() Тогда
		Массив.Добавить(Объект.СкладОтправитель);
	Иначе
		Для Каждого Строка Из Объект.Товары Цикл
			Если Не Строка.Склад.Пустая() И Массив.Найти(Строка.Склад) = Неопределено Тогда
				Массив.Добавить(Строка.Склад);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Массив;
	
КонецФункции
&НаСервере
Функция ПолучитьСписокПолучателей() Экспорт
	
	// Возвращает возможных получателей в зависимости от настроек формы
	
	Массив = Новый Массив;
	Если ЭтоПеремещение() Тогда
		Массив.Добавить(Объект.СкладПолучатель);
	Иначе
		Массив.Добавить(Объект.Партнер);
		Массив.Добавить(Объект.Склад);
	КонецЕсли;
	
	Возврат Массив;
	
КонецФункции
&НаСервере
Функция ПолучитьДатуДоставкиНаСервере()
	
	МетаРекв = Объект.Метаданные().Реквизиты;
	Имя = ?(МетаРекв.Найти("ДатаОтгрузки") = Неопределено,
				?(МетаРекв.Найти("ЖелаемаяДатаПоступления") = Неопределено,
						"ДатаРаспоряжения", 
				"ЖелаемаяДатаПоступления"), 
			"ДатаОтгрузки");
	Возврат ?(Объект[Имя] = '00010101', ?(Объект.Дата = '00010101', ТекущаяДата() + 86400, Объект.Дата), Объект[Имя]);
	
КонецФункции
&НаКлиенте
Функция ПолучитьДатуДоставки() Экспорт
	
	// Возвращает дату на которую расчитана доставка (для определяения времни доставки)
	
	Возврат ПолучитьДатуДоставкиНаСервере();
	
КонецФункции

&НаКлиенте
Процедура ИницилизироватьДоставку()
	
	// При открытии пряем старую доставку и достаем новую
	
	АТ_ДоставкаКлиент.ИницилизироватьЗакладкуДоставки(ЭтаФорма);
		
КонецПроцедуры
&НаСервере
Процедура СоздатьЭлементыДляДоставкиНаСервере(АдресЭлементов)
	
	// При создании элементов доставки указываем группу к которой привязываем все элементы
	
	ГруппаРодительДоставки = Элементы.ГруппаДоставка;
	АТ_ДоставкаСервер.ЗаполнитьЭлементыПоШаблону(ЭтаФорма, ГруппаРодительДоставки, АдресЭлементов, ДоступныеСпособыДоставки());
	
КонецПроцедуры


// Далее везде одинаковое (трогать не надо)

// Действия

&НаСервере
Функция ОтпрИПолуч(Отправитель, Получатель)
	
	Возврат Новый Структура("Отправитель, Получатель", Отправитель, Получатель);
	
КонецФункции

&НаСервере
Процедура ПриИзмененииРеквизитаДоставкиНаСервере(текИндекс)
	
	АТ_ДоставкаСервер.ЗапомнитьЗначениеДоставки(ЭтаФорма, текИндекс);
	АТ_ДоставкаСервер.ОбновитьОтображениеСписка(ЭтаФорма);
	
КонецПроцедуры
&НаКлиенте
Процедура ПриИзмененииРеквизитаДоставки(Элемент)
	
	АТ_ДоставкаКлиент.ПриИзмененииПоля(ЭтаФорма, Элемент);
	ПриИзмененииРеквизитаДоставкиНаСервере(АТ_ДоставкаКлиент.текИндекс(ЭтаФорма));
		
КонецПроцедуры
&НаКлиенте
Процедура НачалоВыбораРеквизитаДоставки(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	АТ_ДоставкаКлиент.НачалоВыбораПоля(ЭтаФорма, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры
&НаКлиенте
Процедура АвтоПодборРеквизитаДоставки(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	АТ_ДоставкаКлиент.АвтоПодборПоля(ЭтаФорма, Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриНажатииНаДекорациюДоставки(Элемент)
	
	АТ_ДоставкаКлиент.ПриНажатииДекорации(ЭтаФорма, Элемент);
	
КонецПроцедуры
&НаКлиенте
Процедура НажатиеНаКнопкуДоставки(Кнопка)
	
	АТ_ДоставкаКлиент.НажатиеНаКнопку(ЭтаФорма, Кнопка);
	
КонецПроцедуры

Функция ПолучитьВозможныйСписокДоставок() Экспорт
	
	Возврат АТ_ДоставкаСервер.ПолучитьВозможныйСписокДоставок(ЭтаФорма);
	
КонецФункции

// Иницилизация

&НаКлиенте
Процедура СоздатьЭлементыДляДоставки(АдресЭлементов) Экспорт
	
	СоздатьЭлементыДляДоставкиНаСервере(АдресЭлементов);
	АТ_ДоставкаКлиент.ОбновитьВидимость(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриАктивизацииСтрокиДоставки(Элемент)
	
	АТ_ДоставкаКлиент.ПриАктивизацииСтроки(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьРеквизитыДоставкиНаСервере(ИндексСтроки)
	
	АТ_ДоставкаСервер.ОбновитьЗначениеДоставки(ЭтаФорма, ИндексСтроки);
	
КонецПроцедуры
&НаКлиенте
Процедура ОбновитьРеквизитыДоставки(ИндексСтроки) Экспорт

	ОбновитьРеквизитыДоставкиНаСервере(ИндексСтроки);
	
КонецПроцедуры

&НаСервере
Процедура ЗапомнитьРеквизитыДоставкиНаСервере(ИндексСтроки)
	
	АТ_ДоставкаСервер.ЗапомнитьЗначениеДоставки(ЭтаФорма, ИндексСтроки);
	
КонецПроцедуры
&НаКлиенте
Процедура ЗапомнитьРеквизитыДоставки(ИндексСтроки) Экспорт
	
	ЗапомнитьРеквизитыДоставкиНаСервере(ИндексСтроки);
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Функция ЗаписатьНаСервере()
	
	Отказ = Ложь;
	АТ_ДоставкаСервер.ПриЗаписиНаСервере(Отказ, Объект, Новый Структура, ЭтаФорма);
	Модифицированность = Ложь;
	
	Возврат Не Отказ;
	
КонецФункции
&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Если ЗаписатьНаСервере() Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Модифицированность Тогда
		
		Отказ = Истина;
		ПоказатьВопрос(Новый ОписаниеОповещения("РешилВыйтиССохранением", ЭтаФорма),
			"Сохранить перед закрытием?", РежимДиалогаВопрос.ДаНетОтмена,,,"Куда же ты собрался");
		
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура РешилВыйтиССохранением(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		ЗаписатьНаСервере();
		Закрыть();
		
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
		
		Модифицированность = Ложь;
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры