
#Область СлужебныеПроцедурыИФункции

Процедура КопироватьИДополнитьНастройки(КомпоновщикНастроек, НовыеНастройки, Расшифровка) Экспорт
	
	НовыеНастройки = КомпоновщикНастроек.ПолучитьНастройки();
	НовыеНастройки.ДополнительныеСвойства.Вставить("Расшифровка", Расшифровка);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		НовыеНастройки.Отбор,
		"Магазин",
		Расшифровка.Магазин,
		ВидСравненияКомпоновкиДанных.Равно,
		,
		Истина);
	
	Если Расшифровка.ИмяГруппировки = "ВидНоменклатуры" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			НовыеНастройки.Отбор,
			"ВидНоменклатуры",
			Расшифровка.ВидНоменклатуры,
			ВидСравненияКомпоновкиДанных.Равно,
			,
			Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			НовыеНастройки.Отбор,
			"ТоварнаяКатегория",
			Расшифровка.ТоварнаяКатегория,
			ВидСравненияКомпоновкиДанных.Равно,
			,
			Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

