
#Область ОбработчикиКомандФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	РазрешитьРедактированиеКод                = Истина;
	РазрешитьРедактированиеНомерОтправленного = Истина;
	РазрешитьРедактированиеНомерПринятого     = Истина;
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура РазрешитьРедактирование(Команда)
	
	Результат = Новый Массив;
	
	Если РазрешитьРедактированиеКод Тогда
		Результат.Добавить("Код");
	КонецЕсли;
	
	Если РазрешитьРедактированиеНомерОтправленного Тогда
		Результат.Добавить("НомерОтправленного");
	КонецЕсли;
	
	Если РазрешитьРедактированиеНомерОтправленного Тогда
		Результат.Добавить("НомерПринятого");
	КонецЕсли;
	
	Закрыть(Результат);
	
КонецПроцедуры // РазрешитьРедактирование()

#КонецОбласти
