
&НаСервере
Функция СоздатьРеализации(СсылкаКП)
	
	Ссылки = Новый Массив;
	
	Для Каждого Ссылка Из СсылкаКП Цикл
		
		Реализация = Документы.КП.СформироватьРеализацию(Ссылка);
		Если Не Реализация.Пустая() Тогда
			Ссылки.Добавить(Реализация);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ссылки;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	СсылкиСозданных = СоздатьРеализации(ПараметрКоманды);
	
	Если СсылкиСозданных.Количество() = 1 Тогда
		ПоказатьОповещениеПользователя("Сформирована реализация", ПолучитьНавигационнуюСсылку(СсылкиСозданных[0]), СсылкиСозданных[0], БиблиотекаКартинок.Сформироватьреализацию);
	ИначеЕсли СсылкиСозданных.Количество() Тогда
		ПоказатьОповещениеПользователя("Сформированы реализации",,СтрШаблон("В количестве %1 шт.", СсылкиСозданных.Количество()), БиблиотекаКартинок.Сформироватьреализацию);
	Иначе
		ПоказатьОповещениеПользователя("Не удалось создать реализацию",,,БиблиотекаКартинок.Ошибка32);		
		Возврат;	
	КонецЕсли;
	
	Оповестить("СозданыРеализацииИзКП",,ПараметрКоманды);
	
КонецПроцедуры
