#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Перем НачалоПериода;
Перем КонецПериода;
Перем МассивОрганизаций;
Перем МассивОрганизацийСФИФОСкользящая;
Перем МассивИсключенныхОрганизаций;

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтандартнаяОбработка = Ложь;
	
	ДокументРезультат.Очистить();
	
	ВнешниеНаборыДанных = Новый Структура(
		"ТаблицаСверкиРегистров",
		СформироватьТаблицуСверкиРегистров(КомпоновщикНастроек));
	
	НастройкиКомпоновкиДанных = КомпоновщикНастроек.ПолучитьНастройки();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(
		СхемаКомпоновкиДанных,
		НастройкиКомпоновкиДанных,
		ДанныеРасшифровки);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	
	ДобавитьПредупреждениеОбОсобенностяхФормированияОтчета(ДокументРезультат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);
	
	ОтчетПустой = ВзаиморасчетыСервер.ОтчетПустой(ПроцессорКомпоновкиДанных);
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ОтчетПустой", ОтчетПустой);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьТаблицуСверкиРегистров(КомпоновщикНастроек)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	// Получим параметры СКД из компоновщика настроек
	ПараметрПериодОтчета  	  = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "Период").Значение;
	ПараметрОрганизация 	  = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "Организация").Значение;
	ПараметрСклад 			  = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "Склад").Значение;
	Номенклатура 			  = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "Номенклатура").Значение;
	ТолькоСОшибками 	  	  = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ТолькоСОшибками").Значение;
	ДетализацияДоРегистратора = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ДетализацияДоРегистратора").Значение;
	
	// Установим параметры запроса для выборки данных
	НачалоПериода 	  = ПараметрПериодОтчета.ДатаНачала;
	КонецПериода  	  = ?(ЗначениеЗаполнено(ПараметрПериодОтчета.ДатаОкончания),
		КонецДня(ПараметрПериодОтчета.ДатаОкончания),
		КонецМесяца(ТекущаяДатаСеанса()));
	Склад 			  = ?(ЗначениеЗаполнено(ПараметрСклад), ПараметрСклад, Неопределено);
	
	ПолучитьДоступныеОрганизации(ПараметрОрганизация);
	
	Запрос.УстановитьПараметр("НачалоПериода",     		   НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", 	   		   КонецПериода);
	Запрос.УстановитьПараметр("МассивОрганизаций", 		   МассивОрганизаций);
	Запрос.УстановитьПараметр("Номенклатура", 		  	   Номенклатура);
	Запрос.УстановитьПараметр("Склад", 		  	   		   Склад);
	Запрос.УстановитьПараметр("ДетализацияДоРегистратора", ДетализацияДоРегистратора);
	Запрос.УстановитьПараметр("КоэффициентПРиВР", 		   ?(ПолучитьФункциональнуюОпцию("УправлениеТорговлей"), 0, 1));
	
	Запрос.УстановитьПараметр("ОтключитьВидЗапасов",	   Истина);
	Запрос.УстановитьПараметр("УчитыватьСебестоимостьТоваровПоВидамЗапасов",
		ПолучитьФункциональнуюОпцию("УчитыватьСебестоимостьТоваровПоВидамЗапасов"));
	Запрос.УстановитьПараметр("ПартионныйУчетВерсии22",
		УниверсальныеМеханизмыПартийИСебестоимостиПовтИсп.ПартионныйУчетВерсии22(НачалоПериода));
	
	// Подготовим текст запроса
	// Чтобы правильно посчитать различия по остатам, выбираем данные из регистров следующим образом:
	// - получаем остатки и обороты по регистраторам - для вывода в отчет "как есть"
	// - получаем остатки и обороты по месяцам - по этим строкам будут считаться различия в остатках (и оборотам),
	//	 а также итоги по вышестоящим группировкам; в этих строка Регистратор = NULL
	ТекстЗапроса = ""
		// Отборы по аналитикам во временные таблицы АналитикаНоменклатуры и АналитикаПартий
		+ ТекстЗапросаОтборАналитикаНоменклатуры()
			+ РазделениеТекстовЗапросовПакета()
		+ ТекстЗапросаОтборАналитикаПартий()
			+ РазделениеТекстовЗапросовПакета()
		+ ТекстЗапросаОтборВидыЗапасов()
			+ РазделениеТекстовЗапросовПакета()
		// Данные партионных регистров во временую таблицу Партии
		+ ТекстЗапросаПартииТоваровОрганизаций()
			+ ОбъединениеТекстовЗапроса()
		+ ТекстЗапросаПартииТоваровПереданныеНаКомиссию()
			+ ОбъединениеТекстовЗапроса()
		+ ТекстЗапросаПартииПроизводственныхЗатрат()
			+ ОбъединениеТекстовЗапроса()
		+ ТекстЗапросаПартииЗатратНаВыпуск()
			+ ОбъединениеТекстовЗапроса()
		+ ТекстЗапросаПартииРасходовНаСебестоимостьТоваров()
			+ РазделениеТекстовЗапросовПакета()
		// Данные регистра себестоимости во временую таблицу СебестоимостьТоваров
		+ ТекстЗапросаСебестоимостьТоваров()
			+ РазделениеТекстовЗапросовПакета()
		// Расхождения партий и себестоимости во временную таблицу Расхождения
		+ ТекстЗапросаРасхождения()
			+ РазделениеТекстовЗапросовПакета()
		+ ?(ТолькоСОшибками,
			ТекстЗапросаОтборОшибки() // во временную таблицу ОтборОшибки
				+ РазделениеТекстовЗапросовПакета(),
			"")
		// Итоговая выборка данных
		+ ТекстЗапросаИтоговый(ТолькоСОшибками);
		
	// Единообразно заполним значения поля ИсточникДанных во всех запросах
	ТекстЗапроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ТекстЗапроса,
		НСтр("ru='1. Партионный учет'"),
		НСтр("ru='2. Себестоимость'"),
		НСтр("ru='3. Расхождения (Партионный учет - Себестоимость)'"));
	
	// Получим таблицу значений - источник данных для СКД
	Запрос.Текст = ТекстЗапроса;
	Таблица = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.Прямой);
	
	Возврат Таблица;
	
КонецФункции


#Область ЗапросыДляОтборовПоАналитикам

Функция ТекстЗапросаОтборАналитикаНоменклатуры()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Аналитика.КлючАналитики 	КАК КлючАналитики,
	|	Аналитика.Номенклатура 		КАК Номенклатура,
	|	Аналитика.Характеристика 	КАК Характеристика,
	|	Аналитика.Серия 			КАК Серия,
	|	Аналитика.Склад 			КАК Склад
	|ПОМЕСТИТЬ АналитикаНоменклатуры
	|ИЗ
	|	РегистрСведений.АналитикаУчетаНоменклатуры КАК Аналитика
	|ГДЕ
	|	НЕ &ПартионныйУчетВерсии22
	|	И (&Номенклатура = НЕОПРЕДЕЛЕНО
	|		ИЛИ &Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|		ИЛИ Аналитика.Номенклатура В ИЕРАРХИИ (&Номенклатура))
	|	И (&Склад = НЕОПРЕДЕЛЕНО
	|		ИЛИ Аналитика.Склад = &Склад)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	КлючАналитики";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаОтборАналитикаПартий()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Аналитика.КлючАналитики КАК КлючАналитики,
	|	1 						КАК К
	|ПОМЕСТИТЬ АналитикаПартий
	|ИЗ
	|	РегистрСведений.АналитикаУчетаПартий КАК Аналитика
	|ГДЕ
	|	Аналитика.НалогообложениеНДС В (
	|		ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
	|		ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
	|ИНДЕКСИРОВАТЬ ПО
	|	КлючАналитики";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаОтборВидыЗапасов()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВидыЗапасов.Ссылка 	КАК ВидЗапасов,
	|	0 					КАК К
	|ПОМЕСТИТЬ ВидыЗапасов
	|ИЗ
	|	Справочник.ВидыЗапасов КАК ВидыЗапасов
	|ГДЕ
	|	ВидыЗапасов.ТипЗапасов В (
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар),
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.МатериалДавальца),
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПродукцияДавальца))
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидЗапасов";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область ЗапросыКПартионнымРегистрам

Функция ТекстЗапросаПартииТоваровОрганизаций()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	""%1"" 										КАК ИсточникДанных,
	|	""ПартииТоваровОрганизаций"" 				КАК РазделИсточникаДанных,
	|	1											КАК Знак,
	|
	|	Партии.Организация 							КАК Организация,
	|	Аналитика.Склад 							КАК Склад,
	|
	|	Аналитика.Номенклатура 						КАК Номенклатура,
	|	Аналитика.Характеристика 					КАК Характеристика,
	|	Аналитика.Серия 							КАК Серия,
	|
	|	ВЫБОР КОГДА &ОтключитьВидЗапасов
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов
	|			ТОГДА Партии.ВидЗапасов
	|			ИНАЧЕ Партии.ВидЗапасов.ТипЗапасов
	|	КОНЕЦ 										КАК ВидЗапасов,
	|
	|	Партии.КоличествоНачальныйОстаток 			КАК КоличествоНачальныйОстаток,
	|	Партии.СтоимостьНачальныйОстаток 			КАК СтоимостьНачальныйОстаток,
	|	ЕСТЬNULL(ВидыЗапасов.К, 1)
	|		* Партии.СтоимостьБезНДСНачальныйОстаток КАК СтоимостьБезНДСНачальныйОстаток,
	|	Партии.СтоимостьРеглНачальныйОстаток
	|		+ ЕСТЬNULL(АналитикаПартий.К, 0)
	|			* Партии.НДСРеглНачальныйОстаток	КАК СтоимостьРеглНачальныйОстаток,
	|	&КоэффициентПРиВР *
	|	Партии.ПостояннаяРазницаНачальныйОстаток 	КАК ПостояннаяРазницаНачальныйОстаток,
	|	&КоэффициентПРиВР *
	|	Партии.ВременнаяРазницаНачальныйОстаток 	КАК ВременнаяРазницаНачальныйОстаток,
	|
	|	Партии.КоличествоПриход 					КАК КоличествоПриход,
	|	Партии.СтоимостьПриход 						КАК СтоимостьПриход,
	|	ЕСТЬNULL(ВидыЗапасов.К, 1)
	|		* Партии.СтоимостьБезНДСПриход 			КАК СтоимостьБезНДСПриход,
	|	Партии.СтоимостьРеглПриход
	|		+ ЕСТЬNULL(АналитикаПартий.К, 0)
	|			* Партии.НДСРеглПриход				КАК СтоимостьРеглПриход,
	|	&КоэффициентПРиВР *
	|	Партии.ПостояннаяРазницаПриход 				КАК ПостояннаяРазницаПриход,
	|	&КоэффициентПРиВР *
	|	Партии.ВременнаяРазницаПриход 				КАК ВременнаяРазницаПриход,
	|
	|	Партии.КоличествоРасход 					КАК КоличествоРасход,
	|	Партии.СтоимостьРасход 						КАК СтоимостьРасход,
	|	ЕСТЬNULL(ВидыЗапасов.К, 1)
	|		* Партии.СтоимостьБезНДСРасход 			КАК СтоимостьБезНДСРасход,
	|	Партии.СтоимостьРеглРасход 					
	|		+ ЕСТЬNULL(АналитикаПартий.К, 0)
	|			* Партии.НДСРеглРасход				КАК СтоимостьРеглРасход,
	|	&КоэффициентПРиВР *
	|	Партии.ПостояннаяРазницаРасход 				КАК ПостояннаяРазницаРасход,
	|	&КоэффициентПРиВР *
	|	Партии.ВременнаяРазницаРасход 				КАК ВременнаяРазницаРасход,
	|
	|	Партии.КоличествоКонечныйОстаток 			КАК КоличествоКонечныйОстаток,
	|	Партии.СтоимостьКонечныйОстаток 			КАК СтоимостьКонечныйОстаток,
	|	ЕСТЬNULL(ВидыЗапасов.К, 1)
	|		* Партии.СтоимостьБезНДСКонечныйОстаток КАК СтоимостьБезНДСКонечныйОстаток,
	|	Партии.СтоимостьРеглКонечныйОстаток
	|		+ ЕСТЬNULL(АналитикаПартий.К, 0)
	|			* Партии.НДСРеглКонечныйОстаток		КАК СтоимостьРеглКонечныйОстаток,
	|	&КоэффициентПРиВР *
	|	Партии.ПостояннаяРазницаКонечныйОстаток 	КАК ПостояннаяРазницаКонечныйОстаток,
	|	&КоэффициентПРиВР *
	|	Партии.ВременнаяРазницаКонечныйОстаток 		КАК ВременнаяРазницаКонечныйОстаток,
	|
	|	Партии.Регистратор 							КАК Регистратор,
	|	НАЧАЛОПЕРИОДА(Партии.Период, МЕСЯЦ) 		КАК Период
	|ПОМЕСТИТЬ Партии
	|ИЗ
	|	РегистрНакопления.ПартииТоваровОрганизаций.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			,
	|			&ДетализацияДоРегистратора И Организация В (&МассивОрганизаций)
	|			И АналитикаУчетаНоменклатуры В (ВЫБРАТЬ Т.КлючАналитики ИЗ АналитикаНоменклатуры КАК Т)) КАК Партии
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ АналитикаНоменклатуры КАК Аналитика
	|		ПО Партии.АналитикаУчетаНоменклатуры = Аналитика.КлючАналитики
	|	ЛЕВОЕ СОЕДИНЕНИЕ АналитикаПартий КАК АналитикаПартий
	|		ПО Партии.АналитикаУчетаПартий = АналитикаПартий.КлючАналитики
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВидыЗапасов КАК ВидыЗапасов
	|		ПО Партии.ВидЗапасов = ВидыЗапасов.ВидЗапасов
	|";
	
	// Преобразуем этот текст для запроса получения остатков и оборотов по регистру
	ТекстЗапросаОстатки = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ Партии", "");
	ТекстЗапросаОстатки = СтрЗаменить(ТекстЗапросаОстатки, "Партии.Регистратор", "NULL");
	ТекстЗапросаОстатки = СтрЗаменить(ТекстЗапросаОстатки, "Регистратор,", "МЕСЯЦ,");
	ТекстЗапросаОстатки = СтрЗаменить(ТекстЗапросаОстатки, "&ДетализацияДоРегистратора И ", "");
	
	ТекстЗапроса = ТекстЗапроса + "
		|
		|ГДЕ
		|	Партии.Регистратор <> НЕОПРЕДЕЛЕНО"
		+ ОбъединениеТекстовЗапроса()
		+ ТекстЗапросаОстатки;
		
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаПартииТоваровПереданныеНаКомиссию()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	""%1"" 										КАК ИсточникДанных,
	|	""ПартииТоваровПереданныеНаКомиссию"" 		КАК РазделИсточникаДанных,
	|	1											КАК Знак,
	|
	|	Партии.Организация 							КАК Организация,
	|	Аналитика.Склад 							КАК Склад,
	|
	|	Аналитика.Номенклатура 						КАК Номенклатура,
	|	Аналитика.Характеристика 					КАК Характеристика,
	|	Аналитика.Серия 							КАК Серия,
	|
	|	ВЫБОР КОГДА &ОтключитьВидЗапасов
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов
	|			ТОГДА Партии.ВидЗапасов
	|			ИНАЧЕ Партии.ВидЗапасов.ТипЗапасов
	|	КОНЕЦ 										КАК ВидЗапасов,
	|
	|	Партии.КоличествоНачальныйОстаток 			КАК КоличествоНачальныйОстаток,
	|	Партии.СтоимостьНачальныйОстаток 			КАК СтоимостьНачальныйОстаток,
	|	ЕСТЬNULL(ВидыЗапасов.К, 1)
	|		* Партии.СтоимостьБезНДСНачальныйОстаток КАК СтоимостьБезНДСНачальныйОстаток,
	|	Партии.СтоимостьРеглНачальныйОстаток 		КАК СтоимостьРеглНачальныйОстаток,
	|	&КоэффициентПРиВР *
	|	Партии.ПостояннаяРазницаНачальныйОстаток 	КАК ПостояннаяРазницаНачальныйОстаток,
	|	&КоэффициентПРиВР *
	|	Партии.ВременнаяРазницаНачальныйОстаток 	КАК ВременнаяРазницаНачальныйОстаток,
	|
	|	Партии.КоличествоПриход 					КАК КоличествоПриход,
	|	Партии.СтоимостьПриход 						КАК СтоимостьПриход,
	|	ЕСТЬNULL(ВидыЗапасов.К, 1)
	|		* Партии.СтоимостьБезНДСПриход 			КАК СтоимостьБезНДСПриход,
	|	Партии.СтоимостьРеглПриход 					КАК СтоимостьРеглПриход,
	|	&КоэффициентПРиВР *
	|	Партии.ПостояннаяРазницаПриход 				КАК ПостояннаяРазницаПриход,
	|	&КоэффициентПРиВР *
	|	Партии.ВременнаяРазницаПриход 				КАК ВременнаяРазницаПриход,
	|
	|	Партии.КоличествоРасход 					КАК КоличествоРасход,
	|	Партии.СтоимостьРасход 						КАК СтоимостьРасход,
	|	ЕСТЬNULL(ВидыЗапасов.К, 1)
	|		* Партии.СтоимостьБезНДСРасход 			КАК СтоимостьБезНДСРасход,
	|	Партии.СтоимостьРеглРасход 					КАК СтоимостьРеглРасход,
	|	&КоэффициентПРиВР *
	|	Партии.ПостояннаяРазницаРасход 				КАК ПостояннаяРазницаРасход,
	|	&КоэффициентПРиВР *
	|	Партии.ВременнаяРазницаРасход 				КАК ВременнаяРазницаРасход,
	|
	|	Партии.КоличествоКонечныйОстаток 			КАК КоличествоКонечныйОстаток,
	|	Партии.СтоимостьКонечныйОстаток 			КАК СтоимостьКонечныйОстаток,
	|	ЕСТЬNULL(ВидыЗапасов.К, 1)
	|		* Партии.СтоимостьБезНДСКонечныйОстаток КАК СтоимостьБезНДСКонечныйОстаток,
	|	Партии.СтоимостьРеглКонечныйОстаток 		КАК СтоимостьРеглКонечныйОстаток,
	|	&КоэффициентПРиВР *
	|	Партии.ПостояннаяРазницаКонечныйОстаток 	КАК ПостояннаяРазницаКонечныйОстаток,
	|	&КоэффициентПРиВР *
	|	Партии.ВременнаяРазницаКонечныйОстаток 		КАК ВременнаяРазницаКонечныйОстаток,
	|
	|	Партии.Регистратор 							КАК Регистратор,
	|	НАЧАЛОПЕРИОДА(Партии.Период, МЕСЯЦ) 		КАК Период
	|//ПОМЕСТИТЬ ПартииТоваровПереданныеНаКомиссию
	|ИЗ
	|	РегистрНакопления.ПартииТоваровПереданныеНаКомиссию.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			,
	|			&ДетализацияДоРегистратора И Организация В (&МассивОрганизаций)
	|			И АналитикаУчетаНоменклатуры В (ВЫБРАТЬ Т.КлючАналитики ИЗ АналитикаНоменклатуры КАК Т)) КАК Партии
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ АналитикаНоменклатуры КАК Аналитика
	|		ПО Партии.АналитикаУчетаНоменклатуры = Аналитика.КлючАналитики
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВидыЗапасов КАК ВидыЗапасов
	|		ПО Партии.ВидЗапасов = ВидыЗапасов.ВидЗапасов
	|";
	
	// Преобразуем этот текст для запроса получения остатков и оборотов по регистру
	ТекстЗапросаОстатки = СтрЗаменить(ТекстЗапроса, "Партии.Регистратор", "NULL");
	ТекстЗапросаОстатки = СтрЗаменить(ТекстЗапросаОстатки, "Регистратор,", "МЕСЯЦ,");
	ТекстЗапросаОстатки = СтрЗаменить(ТекстЗапросаОстатки, "&ДетализацияДоРегистратора И ", "");
	
	ТекстЗапроса = ТекстЗапроса + "
		|
		|ГДЕ
		|	Партии.Регистратор <> НЕОПРЕДЕЛЕНО"
		+ ОбъединениеТекстовЗапроса()
		+ ТекстЗапросаОстатки;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаПартииПроизводственныхЗатрат()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	""%1"" 										КАК ИсточникДанных,
	|	""ПартииПроизводственныхЗатрат""			КАК РазделИсточникаДанных,
	|	1											КАК Знак,
	|
	|	Партии.Организация 							КАК Организация,
	|	Аналитика.Склад 							КАК Склад,
	|
	|	Аналитика.Номенклатура 						КАК Номенклатура,
	|	Аналитика.Характеристика 					КАК Характеристика,
	|	Аналитика.Серия 							КАК Серия,
	|
	|	ВЫБОР КОГДА &ОтключитьВидЗапасов
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов
	|			ТОГДА Партии.ВидЗапасов
	|			ИНАЧЕ Партии.ВидЗапасов.ТипЗапасов
	|	КОНЕЦ 										КАК ВидЗапасов,
	|
	|	Партии.КоличествоНачальныйОстаток 			КАК КоличествоНачальныйОстаток,
	|	Партии.СтоимостьНачальныйОстаток 			КАК СтоимостьНачальныйОстаток,
	|	ЕСТЬNULL(ВидыЗапасов.К, 1)
	|		* Партии.СтоимостьБезНДСНачальныйОстаток КАК СтоимостьБезНДСНачальныйОстаток,
	|	Партии.СтоимостьРеглНачальныйОстаток 		КАК СтоимостьРеглНачальныйОстаток,
	|	&КоэффициентПРиВР *
	|	Партии.ПостояннаяРазницаНачальныйОстаток 	КАК ПостояннаяРазницаНачальныйОстаток,
	|	&КоэффициентПРиВР *
	|	Партии.ВременнаяРазницаНачальныйОстаток 	КАК ВременнаяРазницаНачальныйОстаток,
	|
	|	Партии.КоличествоПриход 					КАК КоличествоПриход,
	|	Партии.СтоимостьПриход 						КАК СтоимостьПриход,
	|	ЕСТЬNULL(ВидыЗапасов.К, 1)
	|		* Партии.СтоимостьБезНДСПриход 			КАК СтоимостьБезНДСПриход,
	|	Партии.СтоимостьРеглПриход 					КАК СтоимостьРеглПриход,
	|	&КоэффициентПРиВР *
	|	Партии.ПостояннаяРазницаПриход 				КАК ПостояннаяРазницаПриход,
	|	&КоэффициентПРиВР *
	|	Партии.ВременнаяРазницаПриход 				КАК ВременнаяРазницаПриход,
	|
	|	Партии.КоличествоРасход 					КАК КоличествоРасход,
	|	Партии.СтоимостьРасход 						КАК СтоимостьРасход,
	|	ЕСТЬNULL(ВидыЗапасов.К, 1)
	|		* Партии.СтоимостьБезНДСРасход 			КАК СтоимостьБезНДСРасход,
	|	Партии.СтоимостьРеглРасход 					КАК СтоимостьРеглРасход,
	|	&КоэффициентПРиВР *
	|	Партии.ПостояннаяРазницаРасход 				КАК ПостояннаяРазницаРасход,
	|	&КоэффициентПРиВР *
	|	Партии.ВременнаяРазницаРасход 				КАК ВременнаяРазницаРасход,
	|
	|	Партии.КоличествоКонечныйОстаток 			КАК КоличествоКонечныйОстаток,
	|	Партии.СтоимостьКонечныйОстаток 			КАК СтоимостьКонечныйОстаток,
	|	ЕСТЬNULL(ВидыЗапасов.К, 1)
	|		* Партии.СтоимостьБезНДСКонечныйОстаток КАК СтоимостьБезНДСКонечныйОстаток,
	|	Партии.СтоимостьРеглКонечныйОстаток 		КАК СтоимостьРеглКонечныйОстаток,
	|	&КоэффициентПРиВР *
	|	Партии.ПостояннаяРазницаКонечныйОстаток 	КАК ПостояннаяРазницаКонечныйОстаток,
	|	&КоэффициентПРиВР *
	|	Партии.ВременнаяРазницаКонечныйОстаток 		КАК ВременнаяРазницаКонечныйОстаток,
	|
	|	Партии.Регистратор 							КАК Регистратор,
	|	НАЧАЛОПЕРИОДА(Партии.Период, МЕСЯЦ) 		КАК Период
	|//ПОМЕСТИТЬ ПартииПроизводственныхЗатрат
	|ИЗ
	|	РегистрНакопления.ПартииПроизводственныхЗатрат.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			,
	|			&ДетализацияДоРегистратора И Организация В (&МассивОрганизаций)
	|			И АналитикаУчетаНоменклатуры В (ВЫБРАТЬ Т.КлючАналитики ИЗ АналитикаНоменклатуры КАК Т)) КАК Партии
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ АналитикаНоменклатуры КАК Аналитика
	|		ПО Партии.АналитикаУчетаНоменклатуры = Аналитика.КлючАналитики
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВидыЗапасов КАК ВидыЗапасов
	|		ПО Партии.ВидЗапасов = ВидыЗапасов.ВидЗапасов
	|";
	
	// Преобразуем этот текст для запроса получения остатков и оборотов по регистру
	ТекстЗапросаОстатки = СтрЗаменить(ТекстЗапроса, "Партии.Регистратор", "NULL");
	ТекстЗапросаОстатки = СтрЗаменить(ТекстЗапросаОстатки, "Регистратор,", "МЕСЯЦ,");
	ТекстЗапросаОстатки = СтрЗаменить(ТекстЗапросаОстатки, "&ДетализацияДоРегистратора И ", "");
	
	ТекстЗапроса = ТекстЗапроса + "
		|
		|ГДЕ
		|	Партии.Регистратор <> НЕОПРЕДЕЛЕНО"
		+ ОбъединениеТекстовЗапроса()
		+ ТекстЗапросаОстатки;
	
	Возврат ТекстЗапроса;
	
КонецФункции


Функция ТекстЗапросаПартииЗатратНаВыпуск()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	""%1"" 										КАК ИсточникДанных,
	|	""ПартииЗатратНаВыпуск"" 					КАК РазделИсточникаДанных,
	|	1											КАК Знак,
	|
	|	Партии.Организация 							КАК Организация,
	|	Аналитика.Склад 							КАК Склад,
	|
	|	Аналитика.Номенклатура 						КАК Номенклатура,
	|	Аналитика.Характеристика 					КАК Характеристика,
	|	Аналитика.Серия 							КАК Серия,
	|
	|	ВЫБОР КОГДА &ОтключитьВидЗапасов
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов
	|			ТОГДА Партии.ВидЗапасов
	|			ИНАЧЕ Партии.ВидЗапасов.ТипЗапасов
	|	КОНЕЦ 										КАК ВидЗапасов,
	|
	|	0 											КАК КоличествоНачальныйОстаток,
	|	Партии.СтоимостьНачальныйОстаток 			КАК СтоимостьНачальныйОстаток,
	|	ЕСТЬNULL(ВидыЗапасов.К, 1)
	|		* Партии.СтоимостьБезНДСНачальныйОстаток КАК СтоимостьБезНДСНачальныйОстаток,
	|	Партии.СтоимостьРеглНачальныйОстаток
	|		+ ЕСТЬNULL(АналитикаПартий.К, 0)
	|			* Партии.НДСРеглНачальныйОстаток	КАК СтоимостьРеглНачальныйОстаток,
	|	&КоэффициентПРиВР *
	|	Партии.ПостояннаяРазницаНачальныйОстаток 	КАК ПостояннаяРазницаНачальныйОстаток,
	|	&КоэффициентПРиВР *
	|	Партии.ВременнаяРазницаНачальныйОстаток 	КАК ВременнаяРазницаНачальныйОстаток,
	|
	|	0 											КАК КоличествоПриход,
	|	Партии.СтоимостьПриход 						КАК СтоимостьПриход,
	|	ЕСТЬNULL(ВидыЗапасов.К, 1)
	|		* Партии.СтоимостьБезНДСПриход 			КАК СтоимостьБезНДСПриход,
	|	Партии.СтоимостьРеглПриход
	|		+ ЕСТЬNULL(АналитикаПартий.К, 0)
	|			* Партии.НДСРеглПриход				КАК СтоимостьРеглПриход,
	|	&КоэффициентПРиВР *
	|	Партии.ПостояннаяРазницаПриход 				КАК ПостояннаяРазницаПриход,
	|	&КоэффициентПРиВР *
	|	Партии.ВременнаяРазницаПриход 				КАК ВременнаяРазницаПриход,
	|
	|	0 											КАК КоличествоРасход,
	|	Партии.СтоимостьРасход 						КАК СтоимостьРасход,
	|	ЕСТЬNULL(ВидыЗапасов.К, 1)
	|		* Партии.СтоимостьБезНДСРасход 			КАК СтоимостьБезНДСРасход,
	|	Партии.СтоимостьРеглРасход 					
	|		+ ЕСТЬNULL(АналитикаПартий.К, 0)
	|			* Партии.НДСРеглРасход				КАК СтоимостьРеглРасход,
	|	&КоэффициентПРиВР *
	|	Партии.ПостояннаяРазницаРасход 				КАК ПостояннаяРазницаРасход,
	|	&КоэффициентПРиВР *
	|	Партии.ВременнаяРазницаРасход 				КАК ВременнаяРазницаРасход,
	|
	|	0 											КАК КоличествоКонечныйОстаток,
	|	Партии.СтоимостьКонечныйОстаток 			КАК СтоимостьКонечныйОстаток,
	|	ЕСТЬNULL(ВидыЗапасов.К, 1)
	|		* Партии.СтоимостьБезНДСКонечныйОстаток КАК СтоимостьБезНДСКонечныйОстаток,
	|	Партии.СтоимостьРеглКонечныйОстаток
	|		+ ЕСТЬNULL(АналитикаПартий.К, 0)
	|			* Партии.НДСРеглКонечныйОстаток		КАК СтоимостьРеглКонечныйОстаток,
	|	&КоэффициентПРиВР *
	|	Партии.ПостояннаяРазницаКонечныйОстаток 	КАК ПостояннаяРазницаКонечныйОстаток,
	|	&КоэффициентПРиВР *
	|	Партии.ВременнаяРазницаКонечныйОстаток 		КАК ВременнаяРазницаКонечныйОстаток,
	|
	|	Партии.Регистратор 							КАК Регистратор,
	|	НАЧАЛОПЕРИОДА(Партии.Период, МЕСЯЦ) 		КАК Период
	|//ПОМЕСТИТЬ ПартииЗатратНаВыпуск
	|ИЗ
	|	РегистрНакопления.ПартииЗатратНаВыпуск.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			,
	|			&ДетализацияДоРегистратора И Организация В (&МассивОрганизаций)
	|			И АналитикаУчетаПродукции В (ВЫБРАТЬ Т.КлючАналитики ИЗ АналитикаНоменклатуры КАК Т)) КАК Партии
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ АналитикаНоменклатуры КАК Аналитика
	|		ПО Партии.АналитикаУчетаПродукции = Аналитика.КлючАналитики
	|	ЛЕВОЕ СОЕДИНЕНИЕ АналитикаПартий КАК АналитикаПартий
	|		ПО Партии.АналитикаУчетаПартий = АналитикаПартий.КлючАналитики
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВидыЗапасов КАК ВидыЗапасов
	|		ПО Партии.ВидЗапасов = ВидыЗапасов.ВидЗапасов
	|";
	
	// Преобразуем этот текст для запроса получения остатков и оборотов по регистру
	ТекстЗапросаОстатки = СтрЗаменить(ТекстЗапроса, "Партии.Регистратор", "NULL");
	ТекстЗапросаОстатки = СтрЗаменить(ТекстЗапросаОстатки, "Регистратор,", "МЕСЯЦ,");
	ТекстЗапросаОстатки = СтрЗаменить(ТекстЗапросаОстатки, "&ДетализацияДоРегистратора И ", "");
	
	ТекстЗапроса = ТекстЗапроса + "
		|
		|ГДЕ
		|	Партии.Регистратор <> НЕОПРЕДЕЛЕНО"
		+ ОбъединениеТекстовЗапроса()
		+ ТекстЗапросаОстатки;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаПартииРасходовНаСебестоимостьТоваров()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	""%1"" 										КАК ИсточникДанных,
	|	""ПартииРасходовНаСебестоимостьТоваров""	КАК РазделИсточникаДанных,
	|	1											КАК Знак,
	|
	|	Партии.Организация 							КАК Организация,
	|	Аналитика.Склад 							КАК Склад,
	|
	|	Аналитика.Номенклатура 						КАК Номенклатура,
	|	Аналитика.Характеристика 					КАК Характеристика,
	|	Аналитика.Серия 							КАК Серия,
	|
	|	ВЫБОР КОГДА &ОтключитьВидЗапасов
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов
	|			ТОГДА Партии.ВидЗапасов
	|			ИНАЧЕ Партии.ВидЗапасов.ТипЗапасов
	|	КОНЕЦ 										КАК ВидЗапасов,
	|
	|	0 											КАК КоличествоНачальныйОстаток,
	|	Партии.СтоимостьНачальныйОстаток 			КАК СтоимостьНачальныйОстаток,
	|	ЕСТЬNULL(ВидыЗапасов.К, 1)
	|		* Партии.СтоимостьБезНДСНачальныйОстаток КАК СтоимостьБезНДСНачальныйОстаток,
	|	Партии.СтоимостьРеглНачальныйОстаток
	|		+ ЕСТЬNULL(АналитикаПартий.К, 0)
	|			* Партии.НДСРеглНачальныйОстаток	КАК СтоимостьРеглНачальныйОстаток,
	|	&КоэффициентПРиВР *
	|	Партии.ПостояннаяРазницаНачальныйОстаток 	КАК ПостояннаяРазницаНачальныйОстаток,
	|	&КоэффициентПРиВР *
	|	Партии.ВременнаяРазницаНачальныйОстаток 	КАК ВременнаяРазницаНачальныйОстаток,
	|
	|	0 											КАК КоличествоПриход,
	|	Партии.СтоимостьПриход 						КАК СтоимостьПриход,
	|	ЕСТЬNULL(ВидыЗапасов.К, 1)
	|		* Партии.СтоимостьБезНДСПриход 			КАК СтоимостьБезНДСПриход,
	|	Партии.СтоимостьРеглПриход
	|		+ ЕСТЬNULL(АналитикаПартий.К, 0)
	|			* Партии.НДСРеглПриход				КАК СтоимостьРеглПриход,
	|	&КоэффициентПРиВР *
	|	Партии.ПостояннаяРазницаПриход 				КАК ПостояннаяРазницаПриход,
	|	&КоэффициентПРиВР *
	|	Партии.ВременнаяРазницаПриход 				КАК ВременнаяРазницаПриход,
	|
	|	0 											КАК КоличествоРасход,
	|	Партии.СтоимостьРасход 						КАК СтоимостьРасход,
	|	ЕСТЬNULL(ВидыЗапасов.К, 1)
	|		* Партии.СтоимостьБезНДСРасход 			КАК СтоимостьБезНДСРасход,
	|	Партии.СтоимостьРеглРасход 					
	|		+ ЕСТЬNULL(АналитикаПартий.К, 0)
	|			* Партии.НДСРеглРасход				КАК СтоимостьРеглРасход,
	|	&КоэффициентПРиВР *
	|	Партии.ПостояннаяРазницаРасход 				КАК ПостояннаяРазницаРасход,
	|	&КоэффициентПРиВР *
	|	Партии.ВременнаяРазницаРасход 				КАК ВременнаяРазницаРасход,
	|
	|	0 											КАК КоличествоКонечныйОстаток,
	|	Партии.СтоимостьКонечныйОстаток 			КАК СтоимостьКонечныйОстаток,
	|	ЕСТЬNULL(ВидыЗапасов.К, 1)
	|		* Партии.СтоимостьБезНДСКонечныйОстаток КАК СтоимостьБезНДСКонечныйОстаток,
	|	Партии.СтоимостьРеглКонечныйОстаток
	|		+ ЕСТЬNULL(АналитикаПартий.К, 0)
	|			* Партии.НДСРеглКонечныйОстаток		КАК СтоимостьРеглКонечныйОстаток,
	|	&КоэффициентПРиВР *
	|	Партии.ПостояннаяРазницаКонечныйОстаток 	КАК ПостояннаяРазницаКонечныйОстаток,
	|	&КоэффициентПРиВР *
	|	Партии.ВременнаяРазницаКонечныйОстаток 		КАК ВременнаяРазницаКонечныйОстаток,
	|
	|	Партии.Регистратор 							КАК Регистратор,
	|	НАЧАЛОПЕРИОДА(Партии.Период, МЕСЯЦ) 		КАК Период
	|//ПОМЕСТИТЬ ПартииРасходовНаСебестоимостьТоваров
	|ИЗ
	|	РегистрНакопления.ПартииРасходовНаСебестоимостьТоваров.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			,
	|			&ДетализацияДоРегистратора И Организация В (&МассивОрганизаций)
	|			И АналитикаУчетаНоменклатуры В (ВЫБРАТЬ Т.КлючАналитики ИЗ АналитикаНоменклатуры КАК Т)) КАК Партии
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ АналитикаНоменклатуры КАК Аналитика
	|		ПО Партии.АналитикаУчетаНоменклатуры = Аналитика.КлючАналитики
	|	ЛЕВОЕ СОЕДИНЕНИЕ АналитикаПартий КАК АналитикаПартий
	|		ПО Партии.АналитикаУчетаПартий = АналитикаПартий.КлючАналитики
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВидыЗапасов КАК ВидыЗапасов
	|		ПО Партии.ВидЗапасов = ВидыЗапасов.ВидЗапасов
	|";
	
	// Преобразуем этот текст для запроса получения остатков и оборотов по регистру
	ТекстЗапросаОстатки = СтрЗаменить(ТекстЗапроса, "Партии.Регистратор", "NULL");
	ТекстЗапросаОстатки = СтрЗаменить(ТекстЗапросаОстатки, "Регистратор,", "МЕСЯЦ,");
	ТекстЗапросаОстатки = СтрЗаменить(ТекстЗапросаОстатки, "&ДетализацияДоРегистратора И ", "");
	
	ТекстЗапроса = ТекстЗапроса + "
		|
		|ГДЕ
		|	Партии.Регистратор <> НЕОПРЕДЕЛЕНО"
		+ ОбъединениеТекстовЗапроса()
		+ ТекстЗапросаОстатки;
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область ЗапросыКРегиструСебестоимости

Функция ТекстЗапросаСебестоимостьТоваров()
	
	// Обороты по регистраторам получаем из реальной таблицы регистра,
	// т.к. для определения "правильного" регистратора необходимо значение реквизита ДокументДвижения, которого нет в таблице оборотов.
	// Не учитываем движения формирования остатков для партионного учета версии 2.2.
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	""%2"" 													КАК ИсточникДанных,
	|	Себестоимость.РазделИсточникаДанных 					КАК РазделИсточникаДанных,
	|	-1														КАК Знак,
	|
	|	Себестоимость.Организация 								КАК Организация,
	|	Себестоимость.Склад 									КАК Склад,
	|
	|	Себестоимость.Номенклатура 								КАК Номенклатура,
	|	Себестоимость.Характеристика 							КАК Характеристика,
	|	Себестоимость.Серия 									КАК Серия,
	|
	|	Себестоимость.ВидЗапасов 								КАК ВидЗапасов,
	|
	|	СУММА(Себестоимость.КоличествоНачальныйОстаток) 		КАК КоличествоНачальныйОстаток,
	|	СУММА(Себестоимость.СтоимостьНачальныйОстаток) 			КАК СтоимостьНачальныйОстаток,
	|	СУММА(Себестоимость.СтоимостьБезНДСНачальныйОстаток) 	КАК СтоимостьБезНДСНачальныйОстаток,
	|	СУММА(Себестоимость.СтоимостьРеглНачальныйОстаток) 		КАК СтоимостьРеглНачальныйОстаток,
	|	СУММА(Себестоимость.ПостояннаяРазницаНачальныйОстаток) 	КАК ПостояннаяРазницаНачальныйОстаток,
	|	СУММА(Себестоимость.ВременнаяРазницаНачальныйОстаток) 	КАК ВременнаяРазницаНачальныйОстаток,
	|
	|	СУММА(Себестоимость.КоличествоПриход)					КАК КоличествоПриход,
	|	СУММА(Себестоимость.СтоимостьПриход) 					КАК СтоимостьПриход,
	|	СУММА(Себестоимость.СтоимостьБезНДСПриход) 				КАК СтоимостьБезНДСПриход,
	|	СУММА(Себестоимость.СтоимостьРеглПриход) 				КАК СтоимостьРеглПриход,
	|	СУММА(Себестоимость.ПостояннаяРазницаПриход) 			КАК ПостояннаяРазницаПриход,
	|	СУММА(Себестоимость.ВременнаяРазницаПриход) 			КАК ВременнаяРазницаПриход,
	|
	|	СУММА(Себестоимость.КоличествоРасход) 					КАК КоличествоРасход,
	|	СУММА(Себестоимость.СтоимостьРасход) 					КАК СтоимостьРасход,
	|	СУММА(Себестоимость.СтоимостьБезНДСРасход) 				КАК СтоимостьБезНДСРасход,
	|	СУММА(Себестоимость.СтоимостьРеглРасход) 				КАК СтоимостьРеглРасход,
	|	СУММА(Себестоимость.ПостояннаяРазницаРасход) 			КАК ПостояннаяРазницаРасход,
	|	СУММА(Себестоимость.ВременнаяРазницаРасход) 			КАК ВременнаяРазницаРасход,
	|
	|	СУММА(Себестоимость.КоличествоКонечныйОстаток) 			КАК КоличествоКонечныйОстаток,
	|	СУММА(Себестоимость.СтоимостьКонечныйОстаток)			КАК СтоимостьКонечныйОстаток,
	|	СУММА(Себестоимость.СтоимостьБезНДСКонечныйОстаток) 	КАК СтоимостьБезНДСКонечныйОстаток,
	|	СУММА(Себестоимость.СтоимостьРеглКонечныйОстаток) 		КАК СтоимостьРеглКонечныйОстаток,
	|	СУММА(Себестоимость.ПостояннаяРазницаКонечныйОстаток) 	КАК ПостояннаяРазницаКонечныйОстаток,
	|	СУММА(Себестоимость.ВременнаяРазницаКонечныйОстаток) 	КАК ВременнаяРазницаКонечныйОстаток,
	|
	|	Себестоимость.Регистратор 								КАК Регистратор,
	|	Себестоимость.Период 									КАК Период
	|ПОМЕСТИТЬ СебестоимостьТоваров
	|ИЗ
	|(ВЫБРАТЬ
	|	Себестоимость.РазделУчета 									КАК РазделИсточникаДанных,
	|
	|	Себестоимость.Организация 									КАК Организация,
	|	Аналитика.Склад 											КАК Склад,
	|
	|	Аналитика.Номенклатура 										КАК Номенклатура,
	|	Аналитика.Характеристика 									КАК Характеристика,
	|	Аналитика.Серия 											КАК Серия,
	|
	|	ВЫБОР КОГДА &ОтключитьВидЗапасов
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов
	|			ТОГДА Себестоимость.ВидЗапасов
	|		КОГДА Аналитика.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	|		КОГДА Себестоимость.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|		КОГДА Себестоимость.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.МатериалДавальца)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
	|		КОНЕЦ 													КАК ВидЗапасов,
	|
	|	Себестоимость.КоличествоНачальныйОстаток 					КАК КоличествоНачальныйОстаток,
	|	Себестоимость.СтоимостьНачальныйОстаток
	|		+ Себестоимость.СтоимостьЗабалансоваяНачальныйОстаток
	|		+ Себестоимость.ДопРасходыНачальныйОстаток		КАК СтоимостьНачальныйОстаток,
	|	Себестоимость.СтоимостьБезНДСНачальныйОстаток
	|		+ Себестоимость.ДопРасходыБезНДСНачальныйОстаток 	КАК СтоимостьБезНДСНачальныйОстаток,
	|	Себестоимость.СтоимостьРеглНачальныйОстаток
	|		+ Себестоимость.СтоимостьЗабалансоваяРеглНачальныйОстаток КАК СтоимостьРеглНачальныйОстаток,
	|	&КоэффициентПРиВР *
	|	Себестоимость.ПостояннаяРазницаНачальныйОстаток 			КАК ПостояннаяРазницаНачальныйОстаток,
	|	&КоэффициентПРиВР *
	|	Себестоимость.ВременнаяРазницаНачальныйОстаток 				КАК ВременнаяРазницаНачальныйОстаток,
	|
	|	0 															КАК КоличествоПриход,
	|	0 															КАК СтоимостьПриход,
	|	0 															КАК СтоимостьБезНДСПриход,
	|	0 															КАК СтоимостьРеглПриход,
	|	0 															КАК ПостояннаяРазницаПриход,
	|	0 															КАК ВременнаяРазницаПриход,
	|
	|	0 															КАК КоличествоРасход,
	|	0 															КАК СтоимостьРасход,
	|	0 															КАК СтоимостьБезНДСРасход,
	|	0 															КАК СтоимостьРеглРасход,
	|	0 															КАК ПостояннаяРазницаРасход,
	|	0															КАК ВременнаяРазницаРасход,
	|
	|	Себестоимость.КоличествоКонечныйОстаток 					КАК КоличествоКонечныйОстаток,
	|	Себестоимость.СтоимостьКонечныйОстаток
	|		+ Себестоимость.СтоимостьЗабалансоваяКонечныйОстаток
	|		+ Себестоимость.ДопРасходыКонечныйОстаток 		КАК СтоимостьКонечныйОстаток,
	|	Себестоимость.СтоимостьБезНДСКонечныйОстаток
	|		+ Себестоимость.ДопРасходыБезНДСКонечныйОстаток 	КАК СтоимостьБезНДСКонечныйОстаток,
	|	Себестоимость.СтоимостьРеглКонечныйОстаток 					
	|		+ Себестоимость.СтоимостьЗабалансоваяРеглКонечныйОстаток КАК СтоимостьРеглКонечныйОстаток,
	|	&КоэффициентПРиВР *
	|	Себестоимость.ПостояннаяРазницаКонечныйОстаток 				КАК ПостояннаяРазницаКонечныйОстаток,
	|	&КоэффициентПРиВР *
	|	Себестоимость.ВременнаяРазницаКонечныйОстаток 				КАК ВременнаяРазницаКонечныйОстаток,
	|
	|	Себестоимость.Регистратор 									КАК Регистратор,
	|	НАЧАЛОПЕРИОДА(Себестоимость.Период, МЕСЯЦ) 					КАК Период
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			,
	|			&ДетализацияДоРегистратора И Организация В (&МассивОрганизаций)
	|			И АналитикаУчетаНоменклатуры В (ВЫБРАТЬ Т.КлючАналитики ИЗ АналитикаНоменклатуры КАК Т)) КАК Себестоимость
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ АналитикаНоменклатуры КАК Аналитика
	|		ПО Себестоимость.АналитикаУчетаНоменклатуры = Аналитика.КлючАналитики
	|
	|ГДЕ
	|	Себестоимость.Регистратор <> НЕОПРЕДЕЛЕНО
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Себестоимость.РазделУчета 									КАК РазделИсточникаДанных,
	|
	|	Себестоимость.Организация 									КАК Организация,
	|	Аналитика.Склад 											КАК Склад,
	|
	|	Аналитика.Номенклатура 										КАК Номенклатура,
	|	Аналитика.Характеристика 									КАК Характеристика,
	|	Аналитика.Серия 											КАК Серия,
	|
	|	ВЫБОР КОГДА &ОтключитьВидЗапасов
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов
	|			ТОГДА Себестоимость.ВидЗапасов
	|		КОГДА Аналитика.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	|		КОГДА Себестоимость.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|		КОГДА Себестоимость.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.МатериалДавальца)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
	|		КОНЕЦ 													КАК ВидЗапасов,
	|
	|	0 															КАК КоличествоНачальныйОстаток,
	|	0															КАК СтоимостьНачальныйОстаток,
	|	0 															КАК СтоимостьБезНДСНачальныйОстаток,
	|	0 															КАК СтоимостьРеглНачальныйОстаток,
	|	0 															КАК ПостояннаяРазницаНачальныйОстаток,
	|	0 															КАК ВременнаяРазницаНачальныйОстаток,
	|
	|	(ВЫБОР
	|		КОГДА Себестоимость.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА Себестоимость.Количество
	|			ИНАЧЕ 0 КОНЕЦ) 										КАК КоличествоПриход,
	|	(ВЫБОР
	|		КОГДА Себестоимость.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА Себестоимость.Стоимость + Себестоимость.СтоимостьЗабалансовая + Себестоимость.ДопРасходы
	|			ИНАЧЕ 0 КОНЕЦ) 										КАК СтоимостьПриход,
	|	(ВЫБОР
	|		КОГДА Себестоимость.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА Себестоимость.СтоимостьБезНДС + Себестоимость.ДопРасходыБезНДС
	|			ИНАЧЕ 0 КОНЕЦ) 										КАК СтоимостьБезНДСПриход,
	|	(ВЫБОР
	|		КОГДА Себестоимость.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА Себестоимость.СтоимостьРегл + Себестоимость.СтоимостьЗабалансоваяРегл
	|			ИНАЧЕ 0 КОНЕЦ) 										КАК СтоимостьРеглПриход,
	|	(ВЫБОР
	|		КОГДА Себестоимость.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА &КоэффициентПРиВР * Себестоимость.ПостояннаяРазница
	|			ИНАЧЕ 0 КОНЕЦ) 										КАК ПостояннаяРазницаПриход,
	|	(ВЫБОР
	|		КОГДА Себестоимость.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА &КоэффициентПРиВР * Себестоимость.ВременнаяРазница
	|			ИНАЧЕ 0 КОНЕЦ) 										КАК ВременнаяРазницаПриход,		
	|
	|	(ВЫБОР
	|		КОГДА Себестоимость.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА Себестоимость.Количество
	|			ИНАЧЕ 0 КОНЕЦ) 										КАК КоличествоРасход,
	|	(ВЫБОР
	|		КОГДА Себестоимость.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА Себестоимость.Стоимость + Себестоимость.СтоимостьЗабалансовая + Себестоимость.ДопРасходы
	|			ИНАЧЕ 0 КОНЕЦ) 										КАК СтоимостьРасход,
	|	(ВЫБОР
	|		КОГДА Себестоимость.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА Себестоимость.СтоимостьБезНДС + Себестоимость.ДопРасходыБезНДС
	|			ИНАЧЕ 0 КОНЕЦ) 										КАК СтоимостьБезНДСРасход,
	|	(ВЫБОР
	|		КОГДА Себестоимость.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА Себестоимость.СтоимостьРегл + Себестоимость.СтоимостьЗабалансоваяРегл
	|			ИНАЧЕ 0 КОНЕЦ) 										КАК СтоимостьРеглРасход,
	|	(ВЫБОР
	|		КОГДА Себестоимость.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА &КоэффициентПРиВР * Себестоимость.ПостояннаяРазница
	|			ИНАЧЕ 0 КОНЕЦ) 										КАК ПостояннаяРазницаРасход,
	|	(ВЫБОР
	|		КОГДА Себестоимость.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА &КоэффициентПРиВР * Себестоимость.ВременнаяРазница
	|			ИНАЧЕ 0 КОНЕЦ) 										КАК ВременнаяРазницаРасход,		
	|
	|	0 															КАК КоличествоКонечныйОстаток,
	|	0 															КАК СтоимостьКонечныйОстаток,
	|	0 															КАК СтоимостьБезНДСКонечныйОстаток,
	|	0 															КАК СтоимостьРеглКонечныйОстаток,
	|	0 															КАК ПостояннаяРазницаКонечныйОстаток,
	|	0 															КАК ВременнаяРазницаКонечныйОстаток,
	|
	|	(ВЫБОР
	|		КОГДА Себестоимость.Регистратор ССЫЛКА Документ.РасчетСебестоимостиТоваров
	|		 И Себестоимость.ДокументДвижения <> НЕОПРЕДЕЛЕНО
	|			ТОГДА Себестоимость.ДокументДвижения
	|		ИНАЧЕ Себестоимость.Регистратор КОНЕЦ) 					КАК Регистратор,
	|	НАЧАЛОПЕРИОДА(Себестоимость.Период, МЕСЯЦ) 					КАК Период
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК Себестоимость
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ АналитикаНоменклатуры КАК Аналитика
	|		ПО Себестоимость.АналитикаУчетаНоменклатуры = Аналитика.КлючАналитики
	|
	|ГДЕ
	|	Себестоимость.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Себестоимость.Организация В (&МассивОрганизаций)
	|	И &ДетализацияДоРегистратора
	|	И Себестоимость.Активность
	|	И Себестоимость.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ПереносДанных)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Себестоимость.РазделУчета 									КАК РазделИсточникаДанных,
	|
	|	Себестоимость.Организация 									КАК Организация,
	|	Аналитика.Склад 											КАК Склад,
	|
	|	Аналитика.Номенклатура 										КАК Номенклатура,
	|	Аналитика.Характеристика 									КАК Характеристика,
	|	Аналитика.Серия 											КАК Серия,
	|
	|	ВЫБОР КОГДА &ОтключитьВидЗапасов
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов
	|			ТОГДА Себестоимость.ВидЗапасов
	|		КОГДА Аналитика.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	|		КОГДА Себестоимость.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|		КОГДА Себестоимость.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.МатериалДавальца)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
	|		КОНЕЦ 													КАК ВидЗапасов,
	|
	|	0 															КАК КоличествоНачальныйОстаток,
	|	0															КАК СтоимостьНачальныйОстаток,
	|	0 															КАК СтоимостьБезНДСНачальныйОстаток,
	|	0 															КАК СтоимостьРеглНачальныйОстаток,
	|	0 															КАК ПостояннаяРазницаНачальныйОстаток,
	|	0 															КАК ВременнаяРазницаНачальныйОстаток,
	|
	|	(ВЫБОР
	|		КОГДА Себестоимость.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА -Себестоимость.Количество
	|			ИНАЧЕ 0 КОНЕЦ) 										КАК КоличествоПриход,
	|	(ВЫБОР
	|		КОГДА Себестоимость.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА -(Себестоимость.Стоимость + Себестоимость.СтоимостьЗабалансовая + Себестоимость.ДопРасходы)
	|			ИНАЧЕ 0 КОНЕЦ) 										КАК СтоимостьПриход,
	|	(ВЫБОР
	|		КОГДА Себестоимость.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА -(Себестоимость.СтоимостьБезНДС + Себестоимость.ДопРасходыБезНДС)
	|			ИНАЧЕ 0 КОНЕЦ) 										КАК СтоимостьБезНДСПриход,
	|	(ВЫБОР
	|		КОГДА Себестоимость.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА -(Себестоимость.СтоимостьРегл + Себестоимость.СтоимостьЗабалансоваяРегл)
	|			ИНАЧЕ 0 КОНЕЦ) 										КАК СтоимостьРеглПриход,
	|	(ВЫБОР
	|		КОГДА Себестоимость.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА -&КоэффициентПРиВР * Себестоимость.ПостояннаяРазница
	|			ИНАЧЕ 0 КОНЕЦ) 										КАК ПостояннаяРазницаПриход,
	|	(ВЫБОР
	|		КОГДА Себестоимость.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА -&КоэффициентПРиВР * Себестоимость.ВременнаяРазница
	|			ИНАЧЕ 0 КОНЕЦ) 										КАК ВременнаяРазницаПриход,		
	|
	|	(ВЫБОР
	|		КОГДА Себестоимость.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА -Себестоимость.Количество
	|			ИНАЧЕ 0 КОНЕЦ) 										КАК КоличествоРасход,
	|	(ВЫБОР
	|		КОГДА Себестоимость.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА -(Себестоимость.Стоимость + Себестоимость.СтоимостьЗабалансовая + Себестоимость.ДопРасходы)
	|			ИНАЧЕ 0 КОНЕЦ) 										КАК СтоимостьРасход,
	|	(ВЫБОР
	|		КОГДА Себестоимость.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА -(Себестоимость.СтоимостьБезНДС + Себестоимость.ДопРасходыБезНДС)
	|			ИНАЧЕ 0 КОНЕЦ) 										КАК СтоимостьБезНДСРасход,
	|	(ВЫБОР
	|		КОГДА Себестоимость.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА -(Себестоимость.СтоимостьРегл + Себестоимость.СтоимостьЗабалансоваяРегл)
	|			ИНАЧЕ 0 КОНЕЦ) 										КАК СтоимостьРеглРасход,
	|	(ВЫБОР
	|		КОГДА Себестоимость.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА -&КоэффициентПРиВР * Себестоимость.ПостояннаяРазница
	|			ИНАЧЕ 0 КОНЕЦ) 										КАК ПостояннаяРазницаРасход,
	|	(ВЫБОР
	|		КОГДА Себестоимость.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА -&КоэффициентПРиВР * Себестоимость.ВременнаяРазница
	|			ИНАЧЕ 0 КОНЕЦ) 										КАК ВременнаяРазницаРасход,		
	|
	|	(ВЫБОР
	|		КОГДА Себестоимость.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА -Себестоимость.Количество
	|			ИНАЧЕ Себестоимость.Количество КОНЕЦ) 				КАК КоличествоКонечныйОстаток,
	|	(ВЫБОР
	|		КОГДА Себестоимость.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА -(Себестоимость.Стоимость + Себестоимость.СтоимостьЗабалансовая + Себестоимость.ДопРасходы)
	|			ИНАЧЕ Себестоимость.Стоимость + Себестоимость.СтоимостьЗабалансовая + Себестоимость.ДопРасходы КОНЕЦ)
	|	 															КАК СтоимостьКонечныйОстаток,
	|	(ВЫБОР
	|		КОГДА Себестоимость.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА -(Себестоимость.СтоимостьБезНДС + Себестоимость.ДопРасходыБезНДС)
	|			ИНАЧЕ Себестоимость.СтоимостьБезНДС + Себестоимость.ДопРасходыБезНДС КОНЕЦ)
	|	 															КАК СтоимостьБезНДСКонечныйОстаток,
	|	(ВЫБОР
	|		КОГДА Себестоимость.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА -(Себестоимость.СтоимостьРегл + Себестоимость.СтоимостьЗабалансоваяРегл)
	|			ИНАЧЕ Себестоимость.СтоимостьРегл + Себестоимость.СтоимостьЗабалансоваяРегл КОНЕЦ)
	|	 															КАК СтоимостьРеглКонечныйОстаток,
	|	(ВЫБОР
	|		КОГДА Себестоимость.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА -&КоэффициентПРиВР * Себестоимость.ПостояннаяРазница
	|			ИНАЧЕ &КоэффициентПРиВР * Себестоимость.ПостояннаяРазница КОНЕЦ)
	|	 															КАК ПостояннаяРазницаКонечныйОстаток,
	|	(ВЫБОР
	|		КОГДА Себестоимость.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА -&КоэффициентПРиВР * Себестоимость.ВременнаяРазница
	|			ИНАЧЕ &КоэффициентПРиВР * Себестоимость.ВременнаяРазница КОНЕЦ)
	|	 															КАК ВременнаяРазницаКонечныйОстаток,
	|
	|	NULL 														КАК Регистратор,
	|	НАЧАЛОПЕРИОДА(Себестоимость.Период, МЕСЯЦ) 					КАК Период
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК Себестоимость
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ АналитикаНоменклатуры КАК Аналитика
	|		ПО Себестоимость.АналитикаУчетаНоменклатуры = Аналитика.КлючАналитики
	|
	|ГДЕ
	|	Себестоимость.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Себестоимость.Организация В (&МассивОрганизаций)
	|	И Себестоимость.Активность
	|	И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ПереносДанных)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Себестоимость.РазделУчета 									КАК РазделИсточникаДанных,
	|
	|	Себестоимость.Организация 									КАК Организация,
	|	Аналитика.Склад 											КАК Склад,
	|
	|	Аналитика.Номенклатура 										КАК Номенклатура,
	|	Аналитика.Характеристика 									КАК Характеристика,
	|	Аналитика.Серия 											КАК Серия,
	|
	|	ВЫБОР КОГДА &ОтключитьВидЗапасов
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов
	|			ТОГДА Себестоимость.ВидЗапасов
	|		КОГДА Аналитика.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	|		КОГДА Себестоимость.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|		КОГДА Себестоимость.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.МатериалДавальца)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
	|		КОНЕЦ 													КАК ВидЗапасов,
	|
	|	Себестоимость.КоличествоНачальныйОстаток 					КАК КоличествоНачальныйОстаток,
	|	Себестоимость.СтоимостьНачальныйОстаток
	|		+ Себестоимость.СтоимостьЗабалансоваяНачальныйОстаток
	|		+ Себестоимость.ДопРасходыНачальныйОстаток		КАК СтоимостьНачальныйОстаток,
	|	Себестоимость.СтоимостьБезНДСНачальныйОстаток
	|		+ Себестоимость.ДопРасходыБезНДСНачальныйОстаток 	КАК СтоимостьБезНДСНачальныйОстаток,
	|	Себестоимость.СтоимостьРеглНачальныйОстаток
	|		+ Себестоимость.СтоимостьЗабалансоваяРеглНачальныйОстаток КАК СтоимостьРеглНачальныйОстаток,
	|	&КоэффициентПРиВР *
	|	Себестоимость.ПостояннаяРазницаНачальныйОстаток 			КАК ПостояннаяРазницаНачальныйОстаток,
	|	&КоэффициентПРиВР *
	|	Себестоимость.ВременнаяРазницаНачальныйОстаток 				КАК ВременнаяРазницаНачальныйОстаток,
	|
	|	Себестоимость.КоличествоПриход								КАК КоличествоПриход,
	|	Себестоимость.СтоимостьПриход
	|		+ Себестоимость.СтоимостьЗабалансоваяПриход
	|		+ Себестоимость.ДопРасходыПриход 					КАК СтоимостьПриход,
	|	Себестоимость.СтоимостьБезНДСПриход
	|		+ Себестоимость.ДопРасходыБезНДСПриход 			КАК СтоимостьБезНДСПриход,
	|	Себестоимость.СтоимостьРеглПриход
	|		+ Себестоимость.СтоимостьЗабалансоваяРеглПриход			КАК СтоимостьРеглПриход,
	|	&КоэффициентПРиВР *
	|	Себестоимость.ПостояннаяРазницаПриход						КАК ПостояннаяРазницаПриход,
	|	&КоэффициентПРиВР *
	|	Себестоимость.ВременнаяРазницаПриход						КАК ВременнаяРазницаПриход,
	|
	|	Себестоимость.КоличествоРасход								КАК КоличествоРасход,
	|	Себестоимость.СтоимостьРасход
	|		+ Себестоимость.СтоимостьЗабалансоваяРасход
	|		+ Себестоимость.ДопРасходыРасход 					КАК СтоимостьРасход,
	|	Себестоимость.СтоимостьБезНДСРасход
	|		+ Себестоимость.ДопРасходыБезНДСРасход 			КАК СтоимостьБезНДСРасход,
	|	Себестоимость.СтоимостьРеглРасход
	|		+ Себестоимость.СтоимостьЗабалансоваяРеглРасход			КАК СтоимостьРеглРасход,
	|	&КоэффициентПРиВР *
	|	Себестоимость.ПостояннаяРазницаРасход						КАК ПостояннаяРазницаРасход,
	|	&КоэффициентПРиВР *
	|	Себестоимость.ВременнаяРазницаРасход						КАК ВременнаяРазницаРасход,
	|
	|	Себестоимость.КоличествоКонечныйОстаток 					КАК КоличествоКонечныйОстаток,
	|	Себестоимость.СтоимостьКонечныйОстаток
	|		+ Себестоимость.СтоимостьЗабалансоваяКонечныйОстаток
	|		+ Себестоимость.ДопРасходыКонечныйОстаток 		КАК СтоимостьКонечныйОстаток,
	|	Себестоимость.СтоимостьБезНДСКонечныйОстаток
	|		+ Себестоимость.ДопРасходыБезНДСКонечныйОстаток 	КАК СтоимостьБезНДСКонечныйОстаток,
	|	Себестоимость.СтоимостьРеглКонечныйОстаток
	|		+ Себестоимость.СтоимостьЗабалансоваяРеглКонечныйОстаток КАК СтоимостьРеглКонечныйОстаток,
	|	&КоэффициентПРиВР *
	|	Себестоимость.ПостояннаяРазницаКонечныйОстаток 				КАК ПостояннаяРазницаКонечныйОстаток,
	|	&КоэффициентПРиВР *
	|	Себестоимость.ВременнаяРазницаКонечныйОстаток 				КАК ВременнаяРазницаКонечныйОстаток,
	|
	|	NULL 														КАК Регистратор,
	|	НАЧАЛОПЕРИОДА(Себестоимость.Период, МЕСЯЦ) 					КАК Период
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			МЕСЯЦ,
	|			,
	|			Организация В (&МассивОрганизаций)
	|			И АналитикаУчетаНоменклатуры В (ВЫБРАТЬ Т.КлючАналитики ИЗ АналитикаНоменклатуры КАК Т)) КАК Себестоимость
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ АналитикаНоменклатуры КАК Аналитика
	|		ПО Себестоимость.АналитикаУчетаНоменклатуры = Аналитика.КлючАналитики
	|) КАК Себестоимость
	|
	|СГРУППИРОВАТЬ ПО
	|	Себестоимость.РазделИсточникаДанных,
	|	Себестоимость.Организация,
	|	Себестоимость.Склад,
	|	Себестоимость.Номенклатура,
	|	Себестоимость.Характеристика,
	|	Себестоимость.Серия,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.Регистратор,
	|	Себестоимость.Период
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область ЗапросыДляВычисленияРасхождений

Функция ТекстЗапросаРасхождения()
	
	// Рассчитаем разницу (Партионный учет - Себестоимость)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Т.Период									КАК Период,
	|	Т.Организация								КАК Организация,
	|	Т.Номенклатура								КАК Номенклатура,
	|	Т.Характеристика							КАК Характеристика,
	|	Т.Серия										КАК Серия,
	|	Т.Склад										КАК Склад,
	|	Т.ВидЗапасов								КАК ВидЗапасов,
	|	""%3""										КАК ИсточникДанных,
	|	NULL 										КАК РазделИсточникаДанных,
	|	NULL										КАК Регистратор,
	|
	|	СУММА(Т.КоличествоНачальныйОстаток) 		КАК КоличествоНачальныйОстаток,
	|	СУММА(Т.СтоимостьНачальныйОстаток) 			КАК СтоимостьНачальныйОстаток,
	|	СУММА(Т.СтоимостьБезНДСНачальныйОстаток) 	КАК СтоимостьБезНДСНачальныйОстаток,
	|	СУММА(Т.СтоимостьРеглНачальныйОстаток) 		КАК СтоимостьРеглНачальныйОстаток,
	|	СУММА(Т.ПостояннаяРазницаНачальныйОстаток) 	КАК ПостояннаяРазницаНачальныйОстаток,
	|	СУММА(Т.ВременнаяРазницаНачальныйОстаток) 	КАК ВременнаяРазницаНачальныйОстаток,
	|
	|	СУММА(Т.КоличествоПриход) 					КАК КоличествоПриход,
	|	СУММА(Т.СтоимостьПриход) 					КАК СтоимостьПриход,
	|	СУММА(Т.СтоимостьБезНДСПриход) 				КАК СтоимостьБезНДСПриход,
	|	СУММА(Т.СтоимостьРеглПриход) 				КАК СтоимостьРеглПриход,
	|	СУММА(Т.ПостояннаяРазницаПриход) 			КАК ПостояннаяРазницаПриход,
	|	СУММА(Т.ВременнаяРазницаПриход) 			КАК ВременнаяРазницаПриход,
	|
	|	СУММА(Т.КоличествоРасход) 					КАК КоличествоРасход,
	|	СУММА(Т.СтоимостьРасход) 					КАК СтоимостьРасход,
	|	СУММА(Т.СтоимостьБезНДСРасход) 				КАК СтоимостьБезНДСРасход,
	|	СУММА(Т.СтоимостьРеглРасход) 				КАК СтоимостьРеглРасход,
	|	СУММА(Т.ПостояннаяРазницаРасход) 			КАК ПостояннаяРазницаРасход,
	|	СУММА(Т.ВременнаяРазницаРасход) 			КАК ВременнаяРазницаРасход,
	|
	|	СУММА(Т.КоличествоКонечныйОстаток)			КАК КоличествоКонечныйОстаток,
	|	СУММА(Т.СтоимостьКонечныйОстаток) 			КАК СтоимостьКонечныйОстаток,
	|	СУММА(Т.СтоимостьБезНДСКонечныйОстаток) 	КАК СтоимостьБезНДСКонечныйОстаток,
	|	СУММА(Т.СтоимостьРеглКонечныйОстаток) 		КАК СтоимостьРеглКонечныйОстаток,
	|	СУММА(Т.ПостояннаяРазницаКонечныйОстаток) 	КАК ПостояннаяРазницаКонечныйОстаток,
	|	СУММА(Т.ВременнаяРазницаКонечныйОстаток) 	КАК ВременнаяРазницаКонечныйОстаток
	|ПОМЕСТИТЬ Расхождения
	|ИЗ
	|(ВЫБРАТЬ
	|	Т.Период							КАК Период,
	|	Т.Организация						КАК Организация,
	|	Т.Номенклатура						КАК Номенклатура,
	|	Т.Характеристика					КАК Характеристика,
	|	Т.Серия								КАК Серия,
	|	Т.Склад								КАК Склад,
	|	Т.ВидЗапасов						КАК ВидЗапасов,
	|
	|	Т.КоличествоНачальныйОстаток 		КАК КоличествоНачальныйОстаток,
	|	Т.СтоимостьНачальныйОстаток 		КАК СтоимостьНачальныйОстаток,
	|	Т.СтоимостьБезНДСНачальныйОстаток 	КАК СтоимостьБезНДСНачальныйОстаток,
	|	Т.СтоимостьРеглНачальныйОстаток 	КАК СтоимостьРеглНачальныйОстаток,
	|	Т.ПостояннаяРазницаНачальныйОстаток КАК ПостояннаяРазницаНачальныйОстаток,
	|	Т.ВременнаяРазницаНачальныйОстаток 	КАК ВременнаяРазницаНачальныйОстаток,
	|
	|	Т.КоличествоПриход 					КАК КоличествоПриход,
	|	Т.СтоимостьПриход 					КАК СтоимостьПриход,
	|	Т.СтоимостьБезНДСПриход 			КАК СтоимостьБезНДСПриход,
	|	Т.СтоимостьРеглПриход 				КАК СтоимостьРеглПриход,
	|	Т.ПостояннаяРазницаПриход 			КАК ПостояннаяРазницаПриход,
	|	Т.ВременнаяРазницаПриход 			КАК ВременнаяРазницаПриход,
	|
	|	Т.КоличествоРасход 					КАК КоличествоРасход,
	|	Т.СтоимостьРасход 					КАК СтоимостьРасход,
	|	Т.СтоимостьБезНДСРасход 			КАК СтоимостьБезНДСРасход,
	|	Т.СтоимостьРеглРасход 				КАК СтоимостьРеглРасход,
	|	Т.ПостояннаяРазницаРасход 			КАК ПостояннаяРазницаРасход,
	|	Т.ВременнаяРазницаРасход 			КАК ВременнаяРазницаРасход,
	|
	|	Т.КоличествоКонечныйОстаток 		КАК КоличествоКонечныйОстаток,
	|	Т.СтоимостьКонечныйОстаток 			КАК СтоимостьКонечныйОстаток,
	|	Т.СтоимостьБезНДСКонечныйОстаток 	КАК СтоимостьБезНДСКонечныйОстаток,
	|	Т.СтоимостьРеглКонечныйОстаток 		КАК СтоимостьРеглКонечныйОстаток,
	|	Т.ПостояннаяРазницаКонечныйОстаток 	КАК ПостояннаяРазницаКонечныйОстаток,
	|	Т.ВременнаяРазницаКонечныйОстаток 	КАК ВременнаяРазницаКонечныйОстаток
	|ИЗ
	|	Партии КАК Т
	|ГДЕ
	|	Т.Регистратор ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Период							 КАК Период,
	|	Т.Организация						 КАК Организация,
	|	Т.Номенклатура						 КАК Номенклатура,
	|	Т.Характеристика					 КАК Характеристика,
	|	Т.Серия								 КАК Серия,
	|	Т.Склад								 КАК Склад,
	|	Т.ВидЗапасов						 КАК ВидЗапасов,
	|
	|	-Т.КоличествоНачальныйОстаток 		 КАК КоличествоНачальныйОстаток,
	|	-Т.СтоимостьНачальныйОстаток 		 КАК СтоимостьНачальныйОстаток,
	|	-Т.СтоимостьБезНДСНачальныйОстаток 	 КАК СтоимостьБезНДСНачальныйОстаток,
	|	-Т.СтоимостьРеглНачальныйОстаток 	 КАК СтоимостьРеглНачальныйОстаток,
	|	-Т.ПостояннаяРазницаНачальныйОстаток КАК ПостояннаяРазницаНачальныйОстаток,
	|	-Т.ВременнаяРазницаНачальныйОстаток  КАК ВременнаяРазницаНачальныйОстаток,
	|   
	|	-Т.КоличествоПриход 				 КАК КоличествоПриход,
	|	-Т.СтоимостьПриход 					 КАК СтоимостьПриход,
	|	-Т.СтоимостьБезНДСПриход 			 КАК СтоимостьБезНДСПриход,
	|	-Т.СтоимостьРеглПриход 				 КАК СтоимостьРеглПриход,
	|	-Т.ПостояннаяРазницаПриход 			 КАК ПостояннаяРазницаПриход,
	|	-Т.ВременнаяРазницаПриход 			 КАК ВременнаяРазницаПриход,
	|
	|	-Т.КоличествоРасход 				 КАК КоличествоРасход,
	|	-Т.СтоимостьРасход 					 КАК СтоимостьРасход,
	|	-Т.СтоимостьБезНДСРасход 			 КАК СтоимостьБезНДСРасход,
	|	-Т.СтоимостьРеглРасход 				 КАК СтоимостьРеглРасход,
	|	-Т.ПостояннаяРазницаРасход 			 КАК ПостояннаяРазницаРасход,
	|	-Т.ВременнаяРазницаРасход 			 КАК ВременнаяРазницаРасход,
	|
	|	-Т.КоличествоКонечныйОстаток 		 КАК КоличествоКонечныйОстаток,
	|	-Т.СтоимостьКонечныйОстаток 		 КАК СтоимостьКонечныйОстаток,
	|	-Т.СтоимостьБезНДСКонечныйОстаток 	 КАК СтоимостьБезНДСКонечныйОстаток,
	|	-Т.СтоимостьРеглКонечныйОстаток 	 КАК СтоимостьРеглКонечныйОстаток,
	|	-Т.ПостояннаяРазницаКонечныйОстаток  КАК ПостояннаяРазницаКонечныйОстаток,
	|	-Т.ВременнаяРазницаКонечныйОстаток 	 КАК ВременнаяРазницаКонечныйОстаток
	|ИЗ
	|	СебестоимостьТоваров КАК Т
	|ГДЕ
	|	Т.Регистратор ЕСТЬ NULL
	|) КАК Т
	|
	|СГРУППИРОВАТЬ ПО
	|	Т.Период,
	|	Т.Организация,
	|	Т.Номенклатура,
	|	Т.Характеристика,
	|	Т.Серия,
	|	Т.Склад,
	|	Т.ВидЗапасов
	|
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаОтборОшибки()
	
	// Проблемная позиция определяется следующими условиями (по И)
	// - нет остатка на конец месяца по количеству
	// - есть остаток на конец месяца по сумме
	// - есть обороты за месяц
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Т.Период									КАК Период,
	|	Т.Организация								КАК Организация,
	|	Т.Номенклатура								КАК Номенклатура,
	|	Т.Характеристика							КАК Характеристика,
	|	Т.Серия										КАК Серия,
	|	Т.Склад										КАК Склад,
	|	Т.ВидЗапасов								КАК ВидЗапасов
	|ПОМЕСТИТЬ ОтборОшибки
	|ИЗ
	|	Партии КАК Т
	|СГРУППИРОВАТЬ ПО
	|	Т.Период,
	|	Т.Организация,
	|	Т.Номенклатура,
	|	Т.Характеристика,
	|	Т.Серия,
	|	Т.Склад,
	|	Т.ВидЗапасов
	|ИМЕЮЩИЕ
	|	СУММА(Т.КоличествоКонечныйОстаток) = 0
	|	И
	|	(СУММА(Т.СтоимостьКонечныйОстаток) <> 0
	|		ИЛИ СУММА(Т.СтоимостьБезНДСКонечныйОстаток) <> 0
	|		ИЛИ СУММА(Т.СтоимостьРеглКонечныйОстаток) <> 0
	|		ИЛИ СУММА(Т.ПостояннаяРазницаКонечныйОстаток) <> 0
	|		ИЛИ СУММА(Т.ВременнаяРазницаКонечныйОстаток) <> 0)
	|	И
	|	(СУММА(Т.КоличествоПриход) <> 0
	|		ИЛИ СУММА(Т.СтоимостьПриход) <> 0
	|		ИЛИ СУММА(Т.СтоимостьБезНДСПриход) <> 0
	|		ИЛИ СУММА(Т.СтоимостьРеглПриход) <> 0
	|		ИЛИ СУММА(Т.ПостояннаяРазницаПриход) <> 0
	|		ИЛИ СУММА(Т.ВременнаяРазницаПриход) <> 0
	|		ИЛИ СУММА(Т.КоличествоРасход) <> 0
	|		ИЛИ СУММА(Т.СтоимостьРасход) <> 0
	|		ИЛИ СУММА(Т.СтоимостьБезНДСРасход) <> 0
	|		ИЛИ СУММА(Т.СтоимостьРеглРасход) <> 0
	|		ИЛИ СУММА(Т.ПостояннаяРазницаРасход) <> 0
	|		ИЛИ СУММА(Т.ВременнаяРазницаРасход) <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Период									КАК Период,
	|	Т.Организация								КАК Организация,
	|	Т.Номенклатура								КАК Номенклатура,
	|	Т.Характеристика							КАК Характеристика,
	|	Т.Серия										КАК Серия,
	|	Т.Склад										КАК Склад,
	|	Т.ВидЗапасов								КАК ВидЗапасов
	|ИЗ
	|	СебестоимостьТоваров КАК Т
	|СГРУППИРОВАТЬ ПО
	|	Т.Период,
	|	Т.Организация,
	|	Т.Номенклатура,
	|	Т.Характеристика,
	|	Т.Серия,
	|	Т.Склад,
	|	Т.ВидЗапасов
	|ИМЕЮЩИЕ
	|	СУММА(Т.КоличествоКонечныйОстаток) = 0
	|	И
	|	(СУММА(Т.СтоимостьКонечныйОстаток) <> 0
	|		ИЛИ СУММА(Т.СтоимостьБезНДСКонечныйОстаток) <> 0
	|		ИЛИ СУММА(Т.СтоимостьРеглКонечныйОстаток) <> 0
	|		ИЛИ СУММА(Т.ПостояннаяРазницаКонечныйОстаток) <> 0
	|		ИЛИ СУММА(Т.ВременнаяРазницаКонечныйОстаток) <> 0)
	|	И
	|	(СУММА(Т.КоличествоПриход) <> 0
	|		ИЛИ СУММА(Т.СтоимостьПриход) <> 0
	|		ИЛИ СУММА(Т.СтоимостьБезНДСПриход) <> 0
	|		ИЛИ СУММА(Т.СтоимостьРеглПриход) <> 0
	|		ИЛИ СУММА(Т.ПостояннаяРазницаПриход) <> 0
	|		ИЛИ СУММА(Т.ВременнаяРазницаПриход) <> 0
	|		ИЛИ СУММА(Т.КоличествоРасход) <> 0
	|		ИЛИ СУММА(Т.СтоимостьРасход) <> 0
	|		ИЛИ СУММА(Т.СтоимостьБезНДСРасход) <> 0
	|		ИЛИ СУММА(Т.СтоимостьРеглРасход) <> 0
	|		ИЛИ СУММА(Т.ПостояннаяРазницаРасход) <> 0
	|		ИЛИ СУММА(Т.ВременнаяРазницаРасход) <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Период									КАК Период,
	|	Т.Организация								КАК Организация,
	|	Т.Номенклатура								КАК Номенклатура,
	|	Т.Характеристика							КАК Характеристика,
	|	Т.Серия										КАК Серия,
	|	Т.Склад										КАК Склад,
	|	Т.ВидЗапасов								КАК ВидЗапасов
	|ИЗ
	|	Расхождения КАК Т
	|СГРУППИРОВАТЬ ПО
	|	Т.Период,
	|	Т.Организация,
	|	Т.Номенклатура,
	|	Т.Характеристика,
	|	Т.Серия,
	|	Т.Склад,
	|	Т.ВидЗапасов
	|ИМЕЮЩИЕ
	|	СУММА(Т.КоличествоКонечныйОстаток) = 0
	|	И
	|	(СУММА(Т.СтоимостьКонечныйОстаток) <> 0
	|		ИЛИ СУММА(Т.СтоимостьБезНДСКонечныйОстаток) <> 0
	|		ИЛИ СУММА(Т.СтоимостьРеглКонечныйОстаток) <> 0
	|		ИЛИ СУММА(Т.ПостояннаяРазницаКонечныйОстаток) <> 0
	|		ИЛИ СУММА(Т.ВременнаяРазницаКонечныйОстаток) <> 0)
	|	И
	|	(СУММА(Т.КоличествоПриход) <> 0
	|		ИЛИ СУММА(Т.СтоимостьПриход) <> 0
	|		ИЛИ СУММА(Т.СтоимостьБезНДСПриход) <> 0
	|		ИЛИ СУММА(Т.СтоимостьРеглПриход) <> 0
	|		ИЛИ СУММА(Т.ПостояннаяРазницаПриход) <> 0
	|		ИЛИ СУММА(Т.ВременнаяРазницаПриход) <> 0
	|		ИЛИ СУММА(Т.КоличествоРасход) <> 0
	|		ИЛИ СУММА(Т.СтоимостьРасход) <> 0
	|		ИЛИ СУММА(Т.СтоимостьБезНДСРасход) <> 0
	|		ИЛИ СУММА(Т.СтоимостьРеглРасход) <> 0
	|		ИЛИ СУММА(Т.ПостояннаяРазницаРасход) <> 0
	|		ИЛИ СУММА(Т.ВременнаяРазницаРасход) <> 0)
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область ЗапросыФинальные

Функция ТекстЗапросаИтоговый(ТолькоСОшибками)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Т.Период									КАК Период,
	|	Т.Организация								КАК Организация,
	|	Т.Номенклатура								КАК Номенклатура,
	|	Т.Характеристика							КАК Характеристика,
	|	Т.Серия										КАК Серия,
	|	Т.Склад										КАК Склад,
	|	Т.ВидЗапасов								КАК ВидЗапасов,
	|	Т.ИсточникДанных							КАК ИсточникДанных,
	|	Т.РазделИсточникаДанных						КАК РазделИсточникаДанных,
	|	Т.Регистратор								КАК Регистратор,
	|
	|	СУММА(Т.КоличествоНачальныйОстаток) 		КАК КоличествоНачальныйОстаток,
	|	СУММА(Т.СтоимостьНачальныйОстаток) 			КАК СтоимостьНачальныйОстаток,
	|	СУММА(Т.СтоимостьБезНДСНачальныйОстаток) 	КАК СтоимостьБезНДСНачальныйОстаток,
	|	СУММА(Т.СтоимостьРеглНачальныйОстаток) 		КАК СтоимостьРеглНачальныйОстаток,
	|	СУММА(Т.ПостояннаяРазницаНачальныйОстаток) 	КАК ПостояннаяРазницаНачальныйОстаток,
	|	СУММА(Т.ВременнаяРазницаНачальныйОстаток) 	КАК ВременнаяРазницаНачальныйОстаток,
	|
	|	СУММА(Т.КоличествоПриход) 					КАК КоличествоПриход,
	|	СУММА(Т.СтоимостьПриход) 					КАК СтоимостьПриход,
	|	СУММА(Т.СтоимостьБезНДСПриход) 				КАК СтоимостьБезНДСПриход,
	|	СУММА(Т.СтоимостьРеглПриход) 				КАК СтоимостьРеглПриход,
	|	СУММА(Т.ПостояннаяРазницаПриход) 			КАК ПостояннаяРазницаПриход,
	|	СУММА(Т.ВременнаяРазницаПриход) 			КАК ВременнаяРазницаПриход,
	|
	|	СУММА(Т.КоличествоРасход) 					КАК КоличествоРасход,
	|	СУММА(Т.СтоимостьРасход) 					КАК СтоимостьРасход,
	|	СУММА(Т.СтоимостьБезНДСРасход) 				КАК СтоимостьБезНДСРасход,
	|	СУММА(Т.СтоимостьРеглРасход) 				КАК СтоимостьРеглРасход,
	|	СУММА(Т.ПостояннаяРазницаРасход) 			КАК ПостояннаяРазницаРасход,
	|	СУММА(Т.ВременнаяРазницаРасход) 			КАК ВременнаяРазницаРасход,
	|
	|	СУММА(Т.КоличествоКонечныйОстаток)			КАК КоличествоКонечныйОстаток,
	|	СУММА(Т.СтоимостьКонечныйОстаток) 			КАК СтоимостьКонечныйОстаток,
	|	СУММА(Т.СтоимостьБезНДСКонечныйОстаток) 	КАК СтоимостьБезНДСКонечныйОстаток,
	|	СУММА(Т.СтоимостьРеглКонечныйОстаток) 		КАК СтоимостьРеглКонечныйОстаток,
	|	СУММА(Т.ПостояннаяРазницаКонечныйОстаток) 	КАК ПостояннаяРазницаКонечныйОстаток,
	|	СУММА(Т.ВременнаяРазницаКонечныйОстаток) 	КАК ВременнаяРазницаКонечныйОстаток
	|ИЗ
	|
	|(ВЫБРАТЬ
	|	Т.Период							КАК Период,
	|	Т.Организация						КАК Организация,
	|	Т.Номенклатура						КАК Номенклатура,
	|	Т.Характеристика					КАК Характеристика,
	|	Т.Серия								КАК Серия,
	|	Т.Склад								КАК Склад,
	|	Т.ВидЗапасов						КАК ВидЗапасов,
	|	Т.ИсточникДанных					КАК ИсточникДанных,
	|	Т.РазделИсточникаДанных				КАК РазделИсточникаДанных,
	|	Т.Регистратор						КАК Регистратор,
	|
	|	Т.КоличествоНачальныйОстаток 		КАК КоличествоНачальныйОстаток,
	|	Т.СтоимостьНачальныйОстаток 		КАК СтоимостьНачальныйОстаток,
	|	Т.СтоимостьБезНДСНачальныйОстаток 	КАК СтоимостьБезНДСНачальныйОстаток,
	|	Т.СтоимостьРеглНачальныйОстаток 	КАК СтоимостьРеглНачальныйОстаток,
	|	Т.ПостояннаяРазницаНачальныйОстаток КАК ПостояннаяРазницаНачальныйОстаток,
	|	Т.ВременнаяРазницаНачальныйОстаток 	КАК ВременнаяРазницаНачальныйОстаток,
	|
	|	Т.КоличествоПриход 					КАК КоличествоПриход,
	|	Т.СтоимостьПриход 					КАК СтоимостьПриход,
	|	Т.СтоимостьБезНДСПриход 			КАК СтоимостьБезНДСПриход,
	|	Т.СтоимостьРеглПриход 				КАК СтоимостьРеглПриход,
	|	Т.ПостояннаяРазницаПриход 			КАК ПостояннаяРазницаПриход,
	|	Т.ВременнаяРазницаПриход 			КАК ВременнаяРазницаПриход,
	|
	|	Т.КоличествоРасход 					КАК КоличествоРасход,
	|	Т.СтоимостьРасход 					КАК СтоимостьРасход,
	|	Т.СтоимостьБезНДСРасход 			КАК СтоимостьБезНДСРасход,
	|	Т.СтоимостьРеглРасход 				КАК СтоимостьРеглРасход,
	|	Т.ПостояннаяРазницаРасход 			КАК ПостояннаяРазницаРасход,
	|	Т.ВременнаяРазницаРасход 			КАК ВременнаяРазницаРасход,
	|
	|	Т.КоличествоКонечныйОстаток 		КАК КоличествоКонечныйОстаток,
	|	Т.СтоимостьКонечныйОстаток 			КАК СтоимостьКонечныйОстаток,
	|	Т.СтоимостьБезНДСКонечныйОстаток 	КАК СтоимостьБезНДСКонечныйОстаток,
	|	Т.СтоимостьРеглКонечныйОстаток 		КАК СтоимостьРеглКонечныйОстаток,
	|	Т.ПостояннаяРазницаКонечныйОстаток 	КАК ПостояннаяРазницаКонечныйОстаток,
	|	Т.ВременнаяРазницаКонечныйОстаток 	КАК ВременнаяРазницаКонечныйОстаток
	|ИЗ
	|	Партии КАК Т
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Период							 КАК Период,
	|	Т.Организация						 КАК Организация,
	|	Т.Номенклатура						 КАК Номенклатура,
	|	Т.Характеристика					 КАК Характеристика,
	|	Т.Серия								 КАК Серия,
	|	Т.Склад								 КАК Склад,
	|	Т.ВидЗапасов						 КАК ВидЗапасов,
	|	Т.ИсточникДанных					 КАК ИсточникДанных,
	|	Т.РазделИсточникаДанных				 КАК РазделИсточникаДанных,
	|	NULL								 КАК Регистратор,
	|
	|	-Т.КоличествоНачальныйОстаток 		 КАК КоличествоНачальныйОстаток,
	|	-Т.СтоимостьНачальныйОстаток 		 КАК СтоимостьНачальныйОстаток,
	|	-Т.СтоимостьБезНДСНачальныйОстаток 	 КАК СтоимостьБезНДСНачальныйОстаток,
	|	-Т.СтоимостьРеглНачальныйОстаток 	 КАК СтоимостьРеглНачальныйОстаток,
	|	-Т.ПостояннаяРазницаНачальныйОстаток КАК ПостояннаяРазницаНачальныйОстаток,
	|	-Т.ВременнаяРазницаНачальныйОстаток  КАК ВременнаяРазницаНачальныйОстаток,
	|
	|	-Т.КоличествоПриход 				 КАК КоличествоПриход,
	|	-Т.СтоимостьПриход 					 КАК СтоимостьПриход,
	|	-Т.СтоимостьБезНДСПриход 			 КАК СтоимостьБезНДСПриход,
	|	-Т.СтоимостьРеглПриход 				 КАК СтоимостьРеглПриход,
	|	-Т.ПостояннаяРазницаПриход 			 КАК ПостояннаяРазницаПриход,
	|	-Т.ВременнаяРазницаПриход 			 КАК ВременнаяРазницаПриход,
	|
	|	-Т.КоличествоРасход 				 КАК КоличествоРасход,
	|	-Т.СтоимостьРасход 					 КАК СтоимостьРасход,
	|	-Т.СтоимостьБезНДСРасход 			 КАК СтоимостьБезНДСРасход,
	|	-Т.СтоимостьРеглРасход 				 КАК СтоимостьРеглРасход,
	|	-Т.ПостояннаяРазницаРасход 			 КАК ПостояннаяРазницаРасход,
	|	-Т.ВременнаяРазницаРасход 			 КАК ВременнаяРазницаРасход,
	|
	|	-Т.КоличествоКонечныйОстаток 		 КАК КоличествоКонечныйОстаток,
	|	-Т.СтоимостьКонечныйОстаток 		 КАК СтоимостьКонечныйОстаток,
	|	-Т.СтоимостьБезНДСКонечныйОстаток 	 КАК СтоимостьБезНДСКонечныйОстаток,
	|	-Т.СтоимостьРеглКонечныйОстаток 	 КАК СтоимостьРеглКонечныйОстаток,
	|	-Т.ПостояннаяРазницаКонечныйОстаток  КАК ПостояннаяРазницаКонечныйОстаток,
	|	-Т.ВременнаяРазницаКонечныйОстаток 	 КАК ВременнаяРазницаКонечныйОстаток
	|ИЗ
	|	Партии КАК Т
	|ГДЕ
	|	НЕ (Т.Регистратор ЕСТЬ NULL)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Период							КАК Период,
	|	Т.Организация						КАК Организация,
	|	Т.Номенклатура						КАК Номенклатура,
	|	Т.Характеристика					КАК Характеристика,
	|	Т.Серия								КАК Серия,
	|	Т.Склад								КАК Склад,
	|	Т.ВидЗапасов						КАК ВидЗапасов,
	|	Т.ИсточникДанных					КАК ИсточникДанных,
	|	Т.РазделИсточникаДанных				КАК РазделИсточникаДанных,
	|	Т.Регистратор						КАК Регистратор,
	|
	|	Т.КоличествоНачальныйОстаток 		КАК КоличествоНачальныйОстаток,
	|	Т.СтоимостьНачальныйОстаток 		КАК СтоимостьНачальныйОстаток,
	|	Т.СтоимостьБезНДСНачальныйОстаток 	КАК СтоимостьБезНДСНачальныйОстаток,
	|	Т.СтоимостьРеглНачальныйОстаток 	КАК СтоимостьРеглНачальныйОстаток,
	|	Т.ПостояннаяРазницаНачальныйОстаток КАК ПостояннаяРазницаНачальныйОстаток,
	|	Т.ВременнаяРазницаНачальныйОстаток 	КАК ВременнаяРазницаНачальныйОстаток,
	|
	|	Т.КоличествоПриход 					КАК КоличествоПриход,
	|	Т.СтоимостьПриход 					КАК СтоимостьПриход,
	|	Т.СтоимостьБезНДСПриход 			КАК СтоимостьБезНДСПриход,
	|	Т.СтоимостьРеглПриход 				КАК СтоимостьРеглПриход,
	|	Т.ПостояннаяРазницаПриход 			КАК ПостояннаяРазницаПриход,
	|	Т.ВременнаяРазницаПриход 			КАК ВременнаяРазницаПриход,
	|
	|	Т.КоличествоРасход 					КАК КоличествоРасход,
	|	Т.СтоимостьРасход 					КАК СтоимостьРасход,
	|	Т.СтоимостьБезНДСРасход 			КАК СтоимостьБезНДСРасход,
	|	Т.СтоимостьРеглРасход 				КАК СтоимостьРеглРасход,
	|	Т.ПостояннаяРазницаРасход 			КАК ПостояннаяРазницаРасход,
	|	Т.ВременнаяРазницаРасход 			КАК ВременнаяРазницаРасход,
	|
	|	Т.КоличествоКонечныйОстаток 		КАК КоличествоКонечныйОстаток,
	|	Т.СтоимостьКонечныйОстаток 			КАК СтоимостьКонечныйОстаток,
	|	Т.СтоимостьБезНДСКонечныйОстаток 	КАК СтоимостьБезНДСКонечныйОстаток,
	|	Т.СтоимостьРеглКонечныйОстаток 		КАК СтоимостьРеглКонечныйОстаток,
	|	Т.ПостояннаяРазницаКонечныйОстаток 	КАК ПостояннаяРазницаКонечныйОстаток,
	|	Т.ВременнаяРазницаКонечныйОстаток 	КАК ВременнаяРазницаКонечныйОстаток
	|ИЗ
	|	СебестоимостьТоваров КАК Т
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Период							 КАК Период,
	|	Т.Организация						 КАК Организация,
	|	Т.Номенклатура						 КАК Номенклатура,
	|	Т.Характеристика					 КАК Характеристика,
	|	Т.Серия								 КАК Серия,
	|	Т.Склад								 КАК Склад,
	|	Т.ВидЗапасов						 КАК ВидЗапасов,
	|	Т.ИсточникДанных					 КАК ИсточникДанных,
	|	Т.РазделИсточникаДанных				 КАК РазделИсточникаДанных,
	|	NULL								 КАК Регистратор,
	|
	|	-Т.КоличествоНачальныйОстаток 		 КАК КоличествоНачальныйОстаток,
	|	-Т.СтоимостьНачальныйОстаток 		 КАК СтоимостьНачальныйОстаток,
	|	-Т.СтоимостьБезНДСНачальныйОстаток 	 КАК СтоимостьБезНДСНачальныйОстаток,
	|	-Т.СтоимостьРеглНачальныйОстаток 	 КАК СтоимостьРеглНачальныйОстаток,
	|	-Т.ПостояннаяРазницаНачальныйОстаток КАК ПостояннаяРазницаНачальныйОстаток,
	|	-Т.ВременнаяРазницаНачальныйОстаток  КАК ВременнаяРазницаНачальныйОстаток,
	|
	|	-Т.КоличествоПриход 				 КАК КоличествоПриход,
	|	-Т.СтоимостьПриход 					 КАК СтоимостьПриход,
	|	-Т.СтоимостьБезНДСПриход 			 КАК СтоимостьБезНДСПриход,
	|	-Т.СтоимостьРеглПриход 				 КАК СтоимостьРеглПриход,
	|	-Т.ПостояннаяРазницаПриход 			 КАК ПостояннаяРазницаПриход,
	|	-Т.ВременнаяРазницаПриход 			 КАК ВременнаяРазницаПриход,
	|
	|	-Т.КоличествоРасход 				 КАК КоличествоРасход,
	|	-Т.СтоимостьРасход 					 КАК СтоимостьРасход,
	|	-Т.СтоимостьБезНДСРасход 			 КАК СтоимостьБезНДСРасход,
	|	-Т.СтоимостьРеглРасход 				 КАК СтоимостьРеглРасход,
	|	-Т.ПостояннаяРазницаРасход 			 КАК ПостояннаяРазницаРасход,
	|	-Т.ВременнаяРазницаРасход 			 КАК ВременнаяРазницаРасход,
	|
	|	-Т.КоличествоКонечныйОстаток 		 КАК КоличествоКонечныйОстаток,
	|	-Т.СтоимостьКонечныйОстаток 		 КАК СтоимостьКонечныйОстаток,
	|	-Т.СтоимостьБезНДСКонечныйОстаток 	 КАК СтоимостьБезНДСКонечныйОстаток,
	|	-Т.СтоимостьРеглКонечныйОстаток 	 КАК СтоимостьРеглКонечныйОстаток,
	|	-Т.ПостояннаяРазницаКонечныйОстаток  КАК ПостояннаяРазницаКонечныйОстаток,
	|	-Т.ВременнаяРазницаКонечныйОстаток 	 КАК ВременнаяРазницаКонечныйОстаток
	|ИЗ
	|	СебестоимостьТоваров КАК Т
	|ГДЕ
	|	НЕ (Т.Регистратор ЕСТЬ NULL)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Период							КАК Период,
	|	Т.Организация						КАК Организация,
	|	Т.Номенклатура						КАК Номенклатура,
	|	Т.Характеристика					КАК Характеристика,
	|	Т.Серия								КАК Серия,
	|	Т.Склад								КАК Склад,
	|	Т.ВидЗапасов						КАК ВидЗапасов,
	|	Т.ИсточникДанных					КАК ИсточникДанных,
	|	Т.РазделИсточникаДанных				КАК РазделИсточникаДанных,
	|	Т.Регистратор						КАК Регистратор,
	|
	|	Т.КоличествоНачальныйОстаток 		КАК КоличествоНачальныйОстаток,
	|	Т.СтоимостьНачальныйОстаток 		КАК СтоимостьНачальныйОстаток,
	|	Т.СтоимостьБезНДСНачальныйОстаток 	КАК СтоимостьБезНДСНачальныйОстаток,
	|	Т.СтоимостьРеглНачальныйОстаток 	КАК СтоимостьРеглНачальныйОстаток,
	|	Т.ПостояннаяРазницаНачальныйОстаток КАК ПостояннаяРазницаНачальныйОстаток,
	|	Т.ВременнаяРазницаНачальныйОстаток 	КАК ВременнаяРазницаНачальныйОстаток,
	|
	|	Т.КоличествоПриход 					КАК КоличествоПриход,
	|	Т.СтоимостьПриход 					КАК СтоимостьПриход,
	|	Т.СтоимостьБезНДСПриход 			КАК СтоимостьБезНДСПриход,
	|	Т.СтоимостьРеглПриход 				КАК СтоимостьРеглПриход,
	|	Т.ПостояннаяРазницаПриход 			КАК ПостояннаяРазницаПриход,
	|	Т.ВременнаяРазницаПриход 			КАК ВременнаяРазницаПриход,
	|
	|	Т.КоличествоРасход 					КАК КоличествоРасход,
	|	Т.СтоимостьРасход 					КАК СтоимостьРасход,
	|	Т.СтоимостьБезНДСРасход 			КАК СтоимостьБезНДСРасход,
	|	Т.СтоимостьРеглРасход 				КАК СтоимостьРеглРасход,
	|	Т.ПостояннаяРазницаРасход 			КАК ПостояннаяРазницаРасход,
	|	Т.ВременнаяРазницаРасход 			КАК ВременнаяРазницаРасход,
	|
	|	Т.КоличествоКонечныйОстаток 		КАК КоличествоКонечныйОстаток,
	|	Т.СтоимостьКонечныйОстаток 			КАК СтоимостьКонечныйОстаток,
	|	Т.СтоимостьБезНДСКонечныйОстаток 	КАК СтоимостьБезНДСКонечныйОстаток,
	|	Т.СтоимостьРеглКонечныйОстаток 		КАК СтоимостьРеглКонечныйОстаток,
	|	Т.ПостояннаяРазницаКонечныйОстаток 	КАК ПостояннаяРазницаКонечныйОстаток,
	|	Т.ВременнаяРазницаКонечныйОстаток 	КАК ВременнаяРазницаКонечныйОстаток
	|ИЗ
	|	Расхождения КАК Т
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Период							КАК Период,
	|	Т.Организация						КАК Организация,
	|	Т.Номенклатура						КАК Номенклатура,
	|	Т.Характеристика					КАК Характеристика,
	|	Т.Серия								КАК Серия,
	|	Т.Склад								КАК Склад,
	|	Т.ВидЗапасов						КАК ВидЗапасов,
	|	""%1""								КАК ИсточникДанных,
	|	NULL								КАК РазделИсточникаДанных,
	|	NULL								КАК Регистратор,
	|
	|	0									КАК КоличествоНачальныйОстаток,
	|	0									КАК СтоимостьНачальныйОстаток,
	|	0									КАК СтоимостьБезНДСНачальныйОстаток,
	|	0									КАК СтоимостьРеглНачальныйОстаток,
	|	0									КАК ПостояннаяРазницаНачальныйОстаток,
	|	0									КАК ВременнаяРазницаНачальныйОстаток,
	|
	|	0									КАК КоличествоПриход,
	|	0									КАК СтоимостьПриход,
	|	0									КАК СтоимостьБезНДСПриход,
	|	0									КАК СтоимостьРеглПриход,
	|	0									КАК ПостояннаяРазницаПриход,
	|	0									КАК ВременнаяРазницаПриход,
	|
	|	0									КАК КоличествоРасход,
	|	0									КАК СтоимостьРасход,
	|	0									КАК СтоимостьБезНДСРасход,
	|	0									КАК СтоимостьРеглРасход,
	|	0									КАК ПостояннаяРазницаРасход,
	|	0									КАК ВременнаяРазницаРасход,
	|
	|	0									КАК КоличествоКонечныйОстаток,
	|	0									КАК СтоимостьКонечныйОстаток,
	|	0									КАК СтоимостьБезНДСКонечныйОстаток,
	|	0									КАК СтоимостьРеглКонечныйОстаток,
	|	0									КАК ПостояннаяРазницаКонечныйОстаток,
	|	0									КАК ВременнаяРазницаКонечныйОстаток
	|ИЗ
	|	Расхождения КАК Т
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Период							КАК Период,
	|	Т.Организация						КАК Организация,
	|	Т.Номенклатура						КАК Номенклатура,
	|	Т.Характеристика					КАК Характеристика,
	|	Т.Серия								КАК Серия,
	|	Т.Склад								КАК Склад,
	|	Т.ВидЗапасов						КАК ВидЗапасов,
	|	""%2""								КАК ИсточникДанных,
	|	NULL								КАК РазделИсточникаДанных,
	|	NULL								КАК Регистратор,
	|
	|	0									КАК КоличествоНачальныйОстаток,
	|	0									КАК СтоимостьНачальныйОстаток,
	|	0									КАК СтоимостьБезНДСНачальныйОстаток,
	|	0									КАК СтоимостьРеглНачальныйОстаток,
	|	0									КАК ПостояннаяРазницаНачальныйОстаток,
	|	0									КАК ВременнаяРазницаНачальныйОстаток,
	|
	|	0									КАК КоличествоПриход,
	|	0									КАК СтоимостьПриход,
	|	0									КАК СтоимостьБезНДСПриход,
	|	0									КАК СтоимостьРеглПриход,
	|	0									КАК ПостояннаяРазницаПриход,
	|	0									КАК ВременнаяРазницаПриход,
	|
	|	0									КАК КоличествоРасход,
	|	0									КАК СтоимостьРасход,
	|	0									КАК СтоимостьБезНДСРасход,
	|	0									КАК СтоимостьРеглРасход,
	|	0									КАК ПостояннаяРазницаРасход,
	|	0									КАК ВременнаяРазницаРасход,
	|
	|	0									КАК КоличествоКонечныйОстаток,
	|	0									КАК СтоимостьКонечныйОстаток,
	|	0									КАК СтоимостьБезНДСКонечныйОстаток,
	|	0									КАК СтоимостьРеглКонечныйОстаток,
	|	0									КАК ПостояннаяРазницаКонечныйОстаток,
	|	0									КАК ВременнаяРазницаКонечныйОстаток
	|ИЗ
	|	Расхождения КАК Т
	|) КАК Т
	|
	|ГДЕ
	|	НЕ &ПартионныйУчетВерсии22
	|//ТолькоСОшибками	И (Т.Период, Т.Организация, Т.Номенклатура, Т.Характеристика, Т.Серия, Т.Склад, Т.ВидЗапасов) В
	|//ТолькоСОшибками		(ВЫБРАТЬ Т.Период, Т.Организация, Т.Номенклатура, Т.Характеристика, Т.Серия, Т.Склад, Т.ВидЗапасов ИЗ ОтборОшибки КАК Т)
	|
	|СГРУППИРОВАТЬ ПО
	|	Т.Период,
	|	Т.Организация,
	|	Т.Номенклатура,
	|	Т.Характеристика,
	|	Т.Серия,
	|	Т.Склад,
	|	Т.ВидЗапасов,
	|	Т.ИсточникДанных,
	|	Т.РазделИсточникаДанных,
	|	Т.Регистратор
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период,
	|	Организация,
	|	Склад,
	|   Номенклатура,
	|	Характеристика,
	|	Серия,
	|	ВидЗапасов,
	|	ИсточникДанных,
	|	РазделИсточникаДанных,
	|   Регистратор
	|АВТОУПОРЯДОЧИВАНИЕ
	|";
	
	Если ТолькоСОшибками Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ТолькоСОшибками", "");
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область ВспомогательныеФункции

Функция ОбъединениеТекстовЗапроса()
	Возврат	"
		|
		| ОБЪЕДИНИТЬ ВСЕ
		|
		|";
КонецФункции

Функция РазделениеТекстовЗапросовПакета()
	Возврат	"
		|
		|;
		|//////////////////////////////////////////////////////////////////////////////
		|
		|";
	КонецФункции

	
Процедура ПолучитьДоступныеОрганизации(Организация)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Настройка.Организация КАК Ссылка
	|ПОМЕСТИТЬ ВТОрганизацииСФИФОСкользящая
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаОрганизаций.СрезПоследних(
	|			&НачалоПериода,
	|			&Организация В (Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка), НЕОПРЕДЕЛЕНО)
	|				И Организация <> ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация)) КАК Настройка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УчетныеПолитикиОрганизаций КАК СпрУчетнаяПолитика
	|		ПО Настройка.УчетнаяПолитика = СпрУчетнаяПолитика.Ссылка
	|ГДЕ
	|	СпрУчетнаяПолитика.МетодОценкиСтоимостиТоваров = ЗНАЧЕНИЕ(Перечисление.МетодыОценкиСтоимостиТоваров.ФИФОСкользящаяОценка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Обороты.Организация КАК Ссылка
	|ПОМЕСТИТЬ ВТОрганизацииСДвижениями
	|ИЗ
	|	(ВЫБРАТЬ
	|		Т.Организация КАК Организация
	|	ИЗ
	|		РегистрНакопления.СебестоимостьТоваров.Обороты(&НачалоПериода, &КонецПериода, , ) КАК Т
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Т.Организация
	|	ИЗ
	|		РегистрНакопления.ПартииТоваровОрганизаций.Обороты(&НачалоПериода, &КонецПериода, , ) КАК Т
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Т.Организация
	|	ИЗ
	|		РегистрНакопления.ПартииТоваровПереданныеНаКомиссию.Обороты(&НачалоПериода, &КонецПериода, , ) КАК Т
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Т.Организация
	|	ИЗ
	|		РегистрНакопления.ПартииПроизводственныхЗатрат.Обороты(&НачалоПериода, &КонецПериода, , ) КАК Т
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Т.Организация
	|	ИЗ
	|		РегистрНакопления.ПартииЗатратНаВыпуск.Обороты(&НачалоПериода, &КонецПериода, , ) КАК Т
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Т.Организация
	|	ИЗ
	|		РегистрНакопления.ПартииРасходовНаСебестоимостьТоваров.Обороты(&НачалоПериода, &КонецПериода, , ) КАК Т) КАК Обороты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Организации КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОрганизацииСДвижениями КАК ОрганизацииСДвижениями
	|		ПО Т.Ссылка = ОрганизацииСДвижениями.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОрганизацииСФИФОСкользящая КАК ОрганизацииСФИФОСкользящая
	|		ПО Т.Ссылка = ОрганизацииСФИФОСкользящая.Ссылка
	|ГДЕ
	|	&Организация В (Т.Ссылка, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка), НЕОПРЕДЕЛЕНО)
	|	И Т.Ссылка <> ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация)
	|	И ОрганизацииСФИФОСкользящая.Ссылка ЕСТЬ NULL 
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|АВТОУПОРЯДОЧИВАНИЕ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОрганизацииСФИФОСкользящая.Ссылка КАК Ссылка
	|ИЗ
	|	ВТОрганизацииСФИФОСкользящая КАК ОрганизацииСФИФОСкользящая
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|АВТОУПОРЯДОЧИВАНИЕ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОрганизацииСФИФОСкользящая.Ссылка КАК Ссылка
	|ИЗ
	|	ВТОрганизацииСФИФОСкользящая КАК ОрганизацииСФИФОСкользящая
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОрганизацииСДвижениями КАК ОрганизацииСДвижениями
	|		ПО ОрганизацииСФИФОСкользящая.Ссылка = ОрганизацииСДвижениями.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|АВТОУПОРЯДОЧИВАНИЕ";

	Запрос.УстановитьПараметр("Организация",   Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",  КонецПериода);

	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	МассивИсключенныхОрганизаций 	 = РезультатЗапроса[2].Выгрузить().ВыгрузитьКолонку("Ссылка");
	МассивОрганизацийСФИФОСкользящая = РезультатЗапроса[3].Выгрузить().ВыгрузитьКолонку("Ссылка");
	МассивОрганизаций 			 	 = РезультатЗапроса[4].Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецПроцедуры

Процедура ДобавитьПредупреждениеОбОсобенностяхФормированияОтчета(ДокументРезультат)
	
	Если УниверсальныеМеханизмыПартийИСебестоимостиПовтИсп.ПартионныйУчетВерсии22(НачалоПериода) Тогда
		
		// Отчет не сформирован - сообщим о причинах.
		ДатаПереходаНаПартионныйУчетВерсии22 = УниверсальныеМеханизмыПартийИСебестоимостиПовтИсп.ДатаПереходаНаПартионныйУчетВерсии22();
		
		Если НЕ ЗначениеЗаполнено(ДатаПереходаНаПартионныйУчетВерсии22) Тогда
			ТекстПредупреждения = 
				НСтр("ru ='Отчет не используется при включенном партионном учете версии 2.2.'");
		Иначе
			ТекстПредупреждения = 
				НСтр("ru ='Отчет может быть сформирован только по тем периодам, в которых не использовался партионный учет версии 2.2.
				|Дата перехода на партионный учет версии 2.2: %1'");
			ТекстПредупреждения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ТекстПредупреждения,
				ПротоколРасчетаПартийИСебестоимости.ПредставлениеПериодаРасчета(ДатаПереходаНаПартионныйУчетВерсии22));
		КонецЕсли;
		
	ИначеЕсли НЕ ЗначениеЗаполнено(МассивОрганизаций) Тогда
		
		// Нет данных для формирования отчета
		Если ЗначениеЗаполнено(МассивОрганизацийСФИФОСкользящая) Тогда
			ТекстПредупреждения = 
				НСтр("ru ='За указанный период нет оборотов по организациям, у которых на %1 использовался метод оценки стоимости ""ФИФО (скользящая оценка)"":
				|	%2'") + Символы.ПС;
		Иначе
			ТекстПредупреждения = 
				НСтр("ru ='Нет организаций, у которых на %1 использовался метод оценки стоимости ""ФИФО (скользящая оценка)"":'") + Символы.ПС;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(МассивИсключенныхОрганизаций) Тогда
			ТекстПредупреждения = ТекстПредупреждения
				+ НСтр("ru ='В отчет не включены организации, имеющие метод оценки стоимости, отличный от ""ФИФО (скользящая оценка)"":
					|	%3'");
		КонецЕсли;
		
		ТекстПредупреждения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ТекстПредупреждения,
			Формат(НачалоПериода, "ДЛФ=D"),
			УниверсальныеМеханизмыПартийИСебестоимости.ПредставлениеОрганизаций(МассивОрганизацийСФИФОСкользящая, ", "),
			УниверсальныеМеханизмыПартийИСебестоимости.ПредставлениеОрганизаций(МассивИсключенныхОрганизаций, ", "));
		
	ИначеЕсли ЗначениеЗаполнено(МассивИсключенныхОрганизаций) Тогда
		
		// Отчет сформирован не по всем организациям.
		ТекстПредупреждения = 
			НСтр("ru ='Отчет сформирован по оборотам только тех организаций, у которых на %1 использовался метод оценки стоимости ""ФИФО (скользящая оценка)"":
			|	%2
			|В отчет не включены организации, имеющие метод оценки стоимости, отличный от ""ФИФО (скользящая оценка)"":
			|	%3'");
		ТекстПредупреждения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ТекстПредупреждения,
			Формат(НачалоПериода, "ДЛФ=D"),
			УниверсальныеМеханизмыПартийИСебестоимости.ПредставлениеОрганизаций(МассивОрганизаций, ", "),
			УниверсальныеМеханизмыПартийИСебестоимости.ПредставлениеОрганизаций(МассивИсключенныхОрганизаций, ", "));
		
	Иначе
		
		// Отчет сформирован без особенностей.
		ТекстПредупреждения = "";
		
	КонецЕсли;
	
	ТаблицаПредупреждение = Новый ТабличныйДокумент;
	ОбластьПредупреждение = ТаблицаПредупреждение.Область(1,1,1,1);
	
	ОбластьПредупреждение.Текст 	 = СокрЛП(ТекстПредупреждения);
	ОбластьПредупреждение.ЦветТекста = ЦветаСтиля.ЦветОтрицательногоЧисла;
	
	ДокументРезультат.ВставитьОбласть(
		ОбластьПредупреждение,
		ДокументРезультат.Область(1,1,1,1),
		ТипСмещенияТабличногоДокумента.ПоВертикали);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
