#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ТипСделкиДоступенПоФункциональнымОпциям(ТипСделки)  Экспорт
	
	Если ТипСделки = Перечисления.ТипыСделокСКлиентами.ТиповаяПродажа Тогда
		
		Если ПолучитьФункциональнуюОпцию("ИспользоватьКоммерческиеПредложенияКлиентам")
			И ПолучитьФункциональнуюОпцию("ИспользоватьПочтовыйКлиент")
			И ПолучитьФункциональнуюОпцию("ИспользоватьЗаказыКлиентов")
			И ПолучитьФункциональнуюОпцию("ИспользоватьБизнесПроцессыИЗадачи") Тогда
			
			Возврат Истина;
			
		Иначе
			
			Возврат Ложь;
			
		КонецЕсли;
		
	Иначе
		Возврат Истина;
	КонецЕсли;
	
	
КонецФункции

#КонецОбласти

#КонецЕсли