#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЭтотОбъект.ПредставлениеXML = Параметры.ПредставлениеXML;

	ЭтотОбъект.КартинкаФайлЗаписан = БиблиотекаКартинок.Записать;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаЗаписать(Команда)

	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Заголовок = НСтр("ru='Выберите файл, куда записать содержимое XML'");
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Расширение = "xml";
	Диалог.Фильтр = НСтр("ru='Файл xml (*.xml)|*.xml'");
	Если Диалог.Выбрать() Тогда
		ИмяФайла = Диалог.ПолноеИмяФайла;
	Иначе
		Возврат;
	КонецЕсли;

	Если НЕ ПустаяСтрока(ИмяФайла) Тогда

		Если ПустаяСтрока(ЭтотОбъект.ПредставлениеXML) Тогда

			ТекстСообщения = НСтр("ru='Текст пустой. Нечего сохранять.'");
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = ТекстСообщения;
			Сообщение.Поле  = "ПредставлениеXML"; // Идентификатор.
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();

		Иначе

			ЗаписьТекста = Новый ЗаписьТекста(ИмяФайла, "UTF-8", Символы.ПС, Ложь, Символы.ПС);
				ЗаписьТекста.Записать(ЭтотОбъект.ПредставлениеXML);
			ЗаписьТекста.Закрыть();

			ПоказатьОповещениеПользователя(
				НСтр("ru='Файл записан.'"),
				"file://" + СтрЗаменить(ИмяФайла, "\", "/"),
				ИмяФайла,
				ЭтотОбъект.КартинкаФайлЗаписан);

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти
