#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ДанныеСайтаСтруктура = ПолучитьАдресСайта();
	ОткрытьФорму("Обработка.ОбменССайтами.Форма.СписокСайтовЮМИ");
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресСайта()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеСайта.АдресСайта,
	|	ДанныеСайта.Код,
	|	ДанныеСайта.URLАдминЗоны
	|ИЗ
	|	Справочник.Сайты КАК ДанныеСайта";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество()<=1 Тогда
		Выборка.Следующий();
		Возврат Новый Структура("АдресСайта, URLАдминЗоны", Выборка.АдресСайта, Выборка.URLАдминЗоны);
	КонецЕсли;
	
КонецФункции

#КонецОбласти
