
#Область ПрограммныйИнтерфейс
    
// Возвращает полный словарь подсистемы (имена событий и шаблоны комментариев для журнала регистрации,
// шаблоны текстов сообщений и другие строковые константы, используемые подсистемой).
//
// Параметры:
//  нет
//
// Возвращаемое значение:
//   Структура - сформированный словарь.
//
Функция СловарьПодсистемы() Экспорт
	
	Локаль = ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка();
	Словарь = Новый Структура;
    
    Фрагмент = НСтр("ru = 'Файлы областей данных'", Локаль);
    Словарь.Вставить("КорневоеСобытие", Фрагмент);
    
    Фрагмент = НСтр("ru = 'Файл с идентификатором ''%1'' не найден.'");
    Словарь.Вставить("ФайлНеНайденПоИдентификатору", Фрагмент);
    
    Фрагмент = НСтр("ru = 'Файл ''%1'' не найден.'");
    Словарь.Вставить("ФайлНеНайденПоПолномуИмени", Фрагмент);
    
    Фрагмент = НСтр("ru = 'Не задано имя файла для сохранения.'");
    Словарь.Вставить("ИмяФайлаДляСохраненияНеЗадано", Фрагмент);
    
    Фрагмент = НСтр("ru = 'Отсутствует информация о файле.'");
    Словарь.Вставить("ИнформацияОФайлеОтсутствует", Фрагмент);
    
    Фрагмент = НСтр("ru = 'Неверный тип задания файла.'");
    Словарь.Вставить("НеверныйТипЗаданияФайла", Фрагмент);
    
    Фрагмент = НСтр("ru = 'Удаление файла из хранилища.'", Локаль);
    Словарь.Вставить("УдалениеФайлаИзХранилища", Фрагмент);
    
    Фрагмент = НСтр("ru = 'Установка признака ''Временный''.'", Локаль);
    Словарь.Вставить("УстановкаПризнакаВременный", Фрагмент);
    
    Возврат Словарь;
    
КонецФункции

#КонецОбласти 
