
#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("Номенклатура") Тогда
		Номенклатура = Параметры.Отбор.Номенклатура;
		Параметры.Отбор.Удалить("Номенклатура");
	КонецЕсли;
	
	Если Параметры.Отбор.Свойство("Характеристика") Тогда
		Характеристика = Параметры.Отбор.Характеристика;
		Параметры.Отбор.Удалить("Характеристика");
	КонецЕсли;
	
	Если Параметры.Отбор.Свойство("Упаковка") Тогда
		Упаковка = Параметры.Отбор.Упаковка;
		Параметры.Отбор.Удалить("Упаковка");
	КонецЕсли;
	
	Если Параметры.Отбор.Свойство("Владелец") Тогда
		Владелец = Параметры.Отбор.Владелец;
	КонецЕсли;
	
	Если Параметры.Отбор.Свойство("ТипНоменклатуры") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ТипНоменклатуры = Параметры.Отбор.ТипНоменклатуры;
		СтрокаПоиска = СокрЛП(Параметры.СтрокаПоиска);
		
		Запрос = Новый Запрос;
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НоменклатураПоставщиков.Ссылка
		|ИЗ
		|	Справочник.НоменклатураПоставщиков КАК НоменклатураПоставщиков
		|ГДЕ
		|	НЕ НоменклатураПоставщиков.ПометкаУдаления
		|	И НоменклатураПоставщиков.Номенклатура.ТипНоменклатуры В(&ТипНоменклатуры)
		|	И (НоменклатураПоставщиков.Артикул ПОДОБНО &СтрокаПоиска
		|		ИЛИ НоменклатураПоставщиков.Код ПОДОБНО &СтрокаПоиска
		|		ИЛИ НоменклатураПоставщиков.Наименование ПОДОБНО &СтрокаПоиска)
		|	//%ПрочиеУсловия";
		
		Запрос.УстановитьПараметр("ТипНоменклатуры", ТипНоменклатуры);
		Запрос.УстановитьПараметр("СтрокаПоиска", ?(СтрокаПоиска = Неопределено, "", СтрокаПоиска) + "%");
		
		ПрочиеУсловия = "";
		ЧастьУсловия = " И НоменклатураПоставщиков.%Параметр = &%Параметр";
		Если ЗначениеЗаполнено(Владелец) Тогда
			Запрос.УстановитьПараметр("Владелец", Владелец);
			ПрочиеУсловия = ПрочиеУсловия + СтрЗаменить(ЧастьУсловия, "%Параметр", "Владелец");
		КонецЕсли;
		Если ЗначениеЗаполнено(Номенклатура) Тогда
			Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
			ПрочиеУсловия = ПрочиеУсловия + СтрЗаменить(ЧастьУсловия, "%Параметр", "Номенклатура");
		КонецЕсли;
		Если ЗначениеЗаполнено(Характеристика) Тогда
			Запрос.УстановитьПараметр("Характеристика", Характеристика);
			ПрочиеУсловия = ПрочиеУсловия + СтрЗаменить(ЧастьУсловия, "%Параметр", "Характеристика");
		КонецЕсли;
		Если ЗначениеЗаполнено(Упаковка) Тогда
			Запрос.УстановитьПараметр("Упаковка", Упаковка);
			ПрочиеУсловия = ПрочиеУсловия + СтрЗаменить(ЧастьУсловия, "%Параметр", "Упаковка");
		КонецЕсли;
		Запрос.Текст = СтрЗаменить(ТекстЗапроса,"//%ПрочиеУсловия", ПрочиеУсловия);
		
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

