
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Параметры.ЗакрыватьПриВыборе            = Истина;
	Параметры.ЗакрыватьПриЗакрытииВладельца = Истина;
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры);
	
	Если ПрименениеПриказа107н Тогда
		Элементы.КодОКАТО.Заголовок = НСтр("ru='ОКТМО'");
	Иначе
		Элементы.КодОКАТО.Заголовок = НСтр("ru='ОКАТО'");
	КонецЕсли;
	
	УправлениеПоказателямиПлатежаВБюджет();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Модифицированность И Не Готово Тогда
		
		Отказ = Истина;
		
		СписокКнопок = Новый СписокЗначений();
		СписокКнопок.Добавить("Закрыть", НСтр("ru = 'Закрыть'"));
		СписокКнопок.Добавить("НеЗакрывать", НСтр("ru = 'Не закрывать'"));
		
		ПоказатьВопрос(
			Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект), 
			НСтр("ru = 'Все измененные данные будут потеряны. Закрыть форму?'"), 
			СписокКнопок);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = "Закрыть" Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВидПеречисленияВБюджетПриИзменении(Элемент)
	
	ВидПеречисленияВБюджетПриИзмененииСервер();
	
КонецПроцедуры

&НаСервере
Процедура ВидПеречисленияВБюджетПриИзмененииСервер()
	
	Если ВидПеречисленияВБюджет = Перечисления.ВидыПеречисленийВБюджет.НалоговыйПлатеж Тогда
		СтатусСоставителя = "01";
		ПоказательОснования = "";
		ПоказательПериода = "";
		ПоказательТипа = "";
		
	ИначеЕсли ВидПеречисленияВБюджет = Перечисления.ВидыПеречисленийВБюджет.ТаможенныйПлатеж Тогда
		СтатусСоставителя = "06";
		ПоказательОснования = "";
		ПоказательПериода = "";
		ПоказательТипа = "";
	
	ИначеЕсли ВидПеречисленияВБюджет = Перечисления.ВидыПеречисленийВБюджет.ИнойПлатеж Тогда
		СтатусСоставителя = "08";
		ПоказательОснования = "0";
		ПоказательПериода = "0";
		ПоказательНомера = "0";
		ПоказательДаты = "0";
		ПоказательТипа = ?(ПрименениеПриказа126н, "", "0");
		
	КонецЕсли;
	
	УправлениеПоказателямиПлатежаВБюджет();
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусСоставителяПриИзменении(Элемент)
	
	Если ПустаяСтрока(СтатусСоставителя) Тогда
		СтатусСоставителя = "01";
	КонецЕсли;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусСоставителяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Список = ПлатежиВБюджетКлиентСервер.СтатусыПлательщика(ПрименениеПриказа107н, ТекущаяДата);
	ПоказатьВыборИзМеню(Новый ОписаниеОповещения("СтатусСоставителяНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура("Элемент", Элемент)), Список, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусСоставителяНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Элемент = ДополнительныеПараметры.Элемент;
	
	ЭлементСписка = ВыбранныйЭлемент;
	Если ЭлементСписка <> Неопределено Тогда
		СтатусСоставителя = ЭлементСписка.Значение;
		СтатусСоставителяПриИзменении(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КодОКАТОПриИзменении(Элемент)
	
	ОчиститьСообщения();
	Если Не ПлатежиВБюджетКлиентСервер.КорректныйОКТМО(КодОКАТО) Тогда
		ТекстСообщения = НСтр("ru = 'При заполнении одиннадцатизначного кода ОКТМО, значение ""000"" в 9-11 знаках кода недопустимо.
			|
			|Введите 8-значный код муниципального образования или укажите идентификатор населенного пункта в 9-11 знаках.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "КодОКАТО", "Объект");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказательОснованияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Список = ПлатежиВБюджетКлиентСервер.ОснованияПлатежа(ВидПеречисленияВБюджет, ПрименениеПриказа107н, ТекущаяДата);
	
	ПоказатьВыборИзМеню(Новый ОписаниеОповещения("ПоказательОснованияНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура("Элемент", Элемент)), Список, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказательОснованияНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Элемент = ДополнительныеПараметры.Элемент;
	
	ЭлементСписка = ВыбранныйЭлемент;
	Если ЭлементСписка <> Неопределено Тогда
		ПоказательОснования = ЭлементСписка.Значение;
		СтатусСоставителяПриИзменении(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказательПериодаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтруктураПараметры = Новый Структура("ПоказательПериода, ПоказательОснования",
		ПоказательПериода,
		ПоказательОснования);
	
	ОткрытьФорму(
		"Документ.СписаниеБезналичныхДенежныхСредств.Форма.ФормаВводаПериода",
		СтруктураПараметры,
		Элемент,,,,
		Новый ОписаниеОповещения("ПоказательПериодаНачалоВыбораЗавершение", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказательПериодаНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Значение = Результат;
	Если Значение <> Неопределено Тогда
		ПоказательПериода = Значение;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказательДатыПриИзменении(Элемент)
	
	Если ПустаяСтрока(СтрЗаменить(ПоказательДаты, ".", "")) Тогда
		ПоказательДаты = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказательТипаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Список = ПлатежиВБюджетКлиентСервер.ТипыПлатежа(ВидПеречисленияВБюджет, ПрименениеПриказа107н);
	
	ПоказатьВыборИзМеню(Новый ОписаниеОповещения("ПоказательТипаНачалоВыбораЗавершение", ЭтотОбъект), Список, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказательТипаНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	ЭлементСписка = ВыбранныйЭлемент;
	Если ЭлементСписка <> Неопределено Тогда
		ПоказательТипа = ЭлементСписка.Значение;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	ОчиститьСообщения();
	
	Если Не Модифицированность Или ТолькоПросмотр Тогда
		
		Закрыть();
		
	Иначе
		СтруктураОбъекта = Новый Структура;
		СтруктураОбъекта.Вставить("ВидПеречисленияВБюджет", ВидПеречисленияВБюджет);
		СтруктураОбъекта.Вставить("КодБК",                  КодБК);
		СтруктураОбъекта.Вставить("КодОКАТО",               КодОКАТО);
		СтруктураОбъекта.Вставить("ПоказательДаты",         ПоказательДаты);
		СтруктураОбъекта.Вставить("ПоказательНомера",       ПоказательНомера);
		СтруктураОбъекта.Вставить("ПоказательОснования",    ПоказательОснования);
		СтруктураОбъекта.Вставить("ПоказательПериода",      ПоказательПериода);
		СтруктураОбъекта.Вставить("ПоказательТипа",         ПоказательТипа);
		СтруктураОбъекта.Вставить("СтатусСоставителя",      СтатусСоставителя);
		
		Готово = Истина;
		
		Закрыть(СтруктураОбъекта);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеПоказателямиПлатежаВБюджет()
	
	Элементы.ВидПеречисленияВБюджет.Видимость = (ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПрочаяВыдачаДенежныхСредств);
	
	Если ВидПеречисленияВБюджет = Перечисления.ВидыПеречисленийВБюджет.НалоговыйПлатеж Тогда
		
		Элементы.ПоказательПериода.Видимость      = Истина;
		Элементы.КодТаможенногоОргана.Видимость   = Ложь;
		Элементы.ПоказательНомера.Видимость       = Истина;
		Элементы.ПоказательДаты.Видимость         = Истина;
		
	ИначеЕсли ВидПеречисленияВБюджет = Перечисления.ВидыПеречисленийВБюджет.ТаможенныйПлатеж Тогда
		
		Элементы.ПоказательПериода.Видимость      = Ложь;
		Элементы.КодТаможенногоОргана.Видимость   = Истина;
		Элементы.ПоказательНомера.Видимость       = Истина;
		Элементы.ПоказательДаты.Видимость         = Истина;
		
	ИначеЕсли ВидПеречисленияВБюджет = Перечисления.ВидыПеречисленийВБюджет.ИнойПлатеж Тогда
		
		Элементы.ПоказательПериода.Видимость      = Ложь;
		Элементы.КодТаможенногоОргана.Видимость   = Ложь;
		Элементы.ПоказательНомера.Видимость       = Ложь;
		Элементы.ПоказательДаты.Видимость         = Ложь;
		
	КонецЕсли;
	
	Элементы.ПоказательТипа.Видимость = Не ПрименениеПриказа126н;
	
КонецПроцедуры

#КонецОбласти