
&НаСервере
Функция ЭтоКорректныйУзелОбмена(УзелОбмена)
	
	УзелОбменаЭтаИБ = УзелОбмена = ПланыОбмена.Б_ОбменССайтом.УзелОбменаЭтойИБСервер();
	
	Если УзелОбменаЭтаИБ Тогда
		Возврат Ложь;
		
		Б_ОбменССайтомКлиентСервер.СообщитьПользователю(НСтр("ru = 'Узел соответствует этой информационной базе и не может использоваться в обмене с сайтом. Используйте другой узел обмена или создайте новый.'"));
	Иначе
		Возврат Истина;

		Б_ОбменССайтомСервер.ВыполнитьОбмен(УзелОбмена.Ссылка);
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ЭтоКорректныйУзелОбмена(ПараметрКоманды) тогда
	
		УзелОбмена = ПараметрКоманды;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("УзелОбмена", УзелОбмена);
		ПараметрыФормы.Вставить("ПринудительнаяПолноеОбновлениеДанныхТовара", Ложь);
		
		ОткрытьФорму("ПланОбмена.Б_ОбменССайтом.Форма.ФормаВыполнениеОбмена", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, УзелОбмена);
	Иначе
		
		Б_ОбменССайтомКлиентСервер.СообщитьПользователю(НСтр("ru = 'Узел соответствует этой информационной базе и не может использоваться в обмене с сайтом. Используйте другой узел обмена или создайте новый.'"));
		
	КонецЕсли;
	
КонецПроцедуры


