////////////////////////////////////////////////////////////////////////////////
// МОДУЛЬ СОДЕРЖИТ ПРОЦЕДУРЫ ПОЛУЧЕНИЯ ПЕРЕМЕННЫХ ДЛЯ ФОРМИРОВАНИЯ УПР. ОТЧ.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает макет электронной формы анализа показателя
//
// Возвращаемое значение:
//  ТабличныйДокумент - макет табличного документа
//
Функция МакетСтраницыПоказателя() Экспорт
	
	Перем МакетСтраницыПоказателя;
	
	МакетСтраницыПоказателя = Отчеты.МониторЦелевыхПоказателей.ПолучитьМакет("МакетСтраницыПоказателя");
	
	Возврат МакетСтраницыПоказателя;
	
КонецФункции

// Возвращает макет электронной формы анализа показателя
//
// Возвращаемое значение:
//  ТабличныйДокумент - макет табличного документа
//
Функция ПолучитьМатрицуСостояний() Экспорт
	
	Перем МакетМатрицаСостоянийПоказателей;
	
	МакетМатрицаСостоянийПоказателей = Отчеты.МониторЦелевыхПоказателей.ПолучитьМакет("МатрицаСостоянийПоказателей");
	
	Возврат МакетМатрицаСостоянийПоказателей;
	
КонецФункции

// Возвращает область "РазделительБлоков" макета электронной формы анализа показателя
//
// Возвращаемое значение:
//  ТабличныйДокумент - макет области табличного документа документа, для разделения блоков информации
//
Функция ПолучитьРазделительПечатнойФормыВариантаАнализа() Экспорт
	
	Перем РазделительБлоков;
	
	МакетПечатнойФормыВариантаАнализа = МакетСтраницыПоказателя();
	РазделительБлоков = МакетПечатнойФормыВариантаАнализа.ПолучитьОбласть("РазделительБлоков");
	
	Возврат РазделительБлоков;
	
КонецФункции

#КонецОбласти
