////////////////////////////////////////////////////////////////////////////////
// Обработки.ОблачныйАрхив.Команды.НастройкаОблачногоАрхива: Модуль объекта.
//
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ИмяФормы = "Обработка.ОблачныйАрхив.Форма.НастройкаОблачногоАрхива"; // Идентификатор

	ОткрытьФорму(
		ИмяФормы,
		Новый Структура,
		ПараметрыВыполненияКоманды.Источник,
		ИмяФормы + ?(ПараметрыВыполненияКоманды.Окно = Неопределено, ".ОтдельноеОкно", ""),
		ПараметрыВыполненияКоманды.Окно);

КонецПроцедуры

#КонецОбласти
