
#Область ОбработчикиСобытийФормы
    
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    ИдентификаторФайла = Запись.ИдентификаторФайла;
    
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьОповещение(Команда)
    ОтправитьОповещениеНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
    
&НаСервере
Процедура ОтправитьОповещениеНаСервере()
    
    ИнтеграцияОбъектовОбластейДанных.ОповеститьОбИзмененииОбъекта(
        Запись.УчетнаяСистема, Запись.ИдентификаторОбъекта, Истина);
    
КонецПроцедуры

#КонецОбласти 
