#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	АдресСхемы = Параметры.АдресСхемы;
	
	СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемы);
	
	Отчет.КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы));
	
	Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(Параметры.НастройкиСписка.ПолучитьНастройки());
	Отчет.КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(Параметры.НастройкиСписка.ПользовательскиеНастройки);
	Отчет.КомпоновщикНастроек.Восстановить();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаЗавершитьРедактирование(Команда)
	
	Закрыть(Отчет.КомпоновщикНастроек);
	
КонецПроцедуры

#КонецОбласти
