
#Область СлужебныеПроцедурыИФункции

Функция ПолучитьРезультатПроверки(Форма, ЕстьСсылки = Неопределено) Экспорт
	
	Если ЕстьСсылки = Неопределено Тогда
		ЕстьСсылки = ПолучитьИзВременногоХранилища(Форма.АдресХранилища);
	КонецЕсли;
	
	Если ЕстьСсылки Тогда
		ТекущаяСтраница = Форма.Элементы.ГруппаОбъектИспользуетсяОбъектИспользуется;
	Иначе
		ТекущаяСтраница = Форма.Элементы.ГруппаОбъектИспользуетсяОбъектНеИспользуется;
	КонецЕсли;
	
	Форма.Элементы.ГруппаОбъектИспользуетсяСтраницы.ТекущаяСтраница = ТекущаяСтраница;
	
КонецФункции

#КонецОбласти
