#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	СтруктураЦелевыхПараметров = Справочники.НаправленияДеятельности.СтруктураЦелевыхПараметровКонтрактаГОЗ();
	ЗаполнитьЗначенияСвойств(СтруктураЦелевыхПараметров, Параметры);
	ЗаполнитьЗначенияСвойств(ЭтаФорма, СтруктураЦелевыхПараметров);
	
	ВалютаРеглУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	Элементы.ГруппаОсновныеПараметры.Заголовок = СтрШаблон(НСтр("ru = 'Основные параметры контракта (%1)'"), ВалютаРеглУчета);
	Элементы.ГруппаЗатраты.Заголовок = СтрШаблон(НСтр("ru = 'Целевые затраты (%1)'"), ВалютаРеглУчета);
	
	Если ЗначениеЗаполнено(Параметры.ЗаголовокКомандыСохранить) Тогда
		Элементы.ФормаСохранить.Заголовок = Параметры.ЗаголовокКомандыСохранить;
	КонецЕсли;
	
	Элементы.ФормаСохранить.Видимость = НЕ Параметры.ТолькоПросмотр;
	
	ТолькоПросмотр = Параметры.ТолькоПросмотр; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы И Модифицированность Тогда
		Отказ = Истина;
		ТекстПредупреждения = НСтр("ru = 'Данные не перенесены в направление деятельности. После закрытия, сделанные Вами изменения сохранены не будут.'");
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		Отказ = Истина;
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработчикОповещенияВопросПередЗакрытием", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Данные не перенесены в направление деятельности. Перенести?'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	
	Модифицированность = Ложь;
	Закрыть(ЦелевыеПараметрыКонтракта());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработчикОповещенияВопросПередЗакрытием(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ОчиститьСообщения();
		Отказ = Ложь;
		Модифицированность = Ложь;
		Закрыть(ЦелевыеПараметрыКонтракта());
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЦелевыеПараметрыКонтракта()
	
	ЦелевыеПараметры = Справочники.НаправленияДеятельности.СтруктураЦелевыхПараметровКонтрактаГОЗ();
	ЗаполнитьЗначенияСвойств(ЦелевыеПараметры, ЭтаФорма);
	Возврат ЦелевыеПараметры;
	
КонецФункции

#КонецОбласти
