
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура РазрешитьРедактирование(Команда)
	
	Результат = Новый Массив;
	
	Если РазрешитьРедактированиеТипНоменклатуры Тогда
		Результат.Добавить("ТипНоменклатуры");
	КонецЕсли;
	
	Если РазрешитьРедактированиеИспользованиеХарактеристик Тогда
		Результат.Добавить("ИспользоватьХарактеристики");
		Результат.Добавить("ИспользованиеХарактеристик");
		Результат.Добавить("ВладелецХарактеристик");
	КонецЕсли;
	
	Если РазрешитьРедактированиеИспользованияСерий Тогда
		Результат.Добавить("ИспользоватьСерии");
		Результат.Добавить("ПолитикиУчетаСерий");
		Результат.Добавить("НастройкаИспользованияСерий");
		Результат.Добавить("ТочностьУказанияСрокаГодностиСерии");
		Результат.Добавить("ВладелецСерий");
		Результат.Добавить("НастройкиСерийБерутсяИзДругогоВидаНоменклатуры");
		Результат.Добавить("ЕстьИндивидуальныеНастройкиПолитикиУчетаСерий");
	КонецЕсли;
	
	Если РазрешитьРедактированиеВариантаОформленияУслуги ТОгда
		Результат.Добавить("ВариантОформленияПродажи");
	КонецЕсли;
	
	Если РазрешитьРедактированиеАлкогольнаяПродукция ТОгда
		Результат.Добавить("АлкогольнаяПродукция");
	КонецЕсли;
	
	Если РазрешитьРедактированиеСодержитДрагоценныеМатериалы ТОгда
		Результат.Добавить("СодержитДрагоценныеМатериалы");
	КонецЕсли;
	
	Если РазрешитьРедактированиеВариантаОказанияУслуги Тогда
		Результат.Добавить("ВариантОказанияУслуг");
	КонецЕсли;
	
	Если РазрешитьРедактированиеНастроекНабора Тогда
		Результат.Добавить("ВариантПредставленияНабораВПечатныхФормах");
		Результат.Добавить("ВариантРасчетаЦеныНабора");
	КонецЕсли;
	
	Если РазрешитьРедактированиеВариантаЗаданияТоварныхКатегорий Тогда
		Результат.Добавить("ТоварныеКатегорииОбщиеСДругимВидомНоменклатуры");
		Результат.Добавить("ВладелецТоварныхКатегорий");
	КонецЕсли;
	
	Закрыть(Результат);
	
КонецПроцедуры // РазрешитьРедактирование()

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	РазрешитьРедактированиеИспользованиеХарактеристик   = Истина;
	РазрешитьРедактированиеТипНоменклатуры              = Истина;
	РазрешитьРедактированиеИспользованияСерий           = Истина;
	РазрешитьРедактированиеВариантаОформленияУслуги     = Истина;
	РазрешитьРедактированиеАлкогольнаяПродукция         = Истина;
	РазрешитьРедактированиеСодержитДрагоценныеМатериалы = Истина;
	РазрешитьРедактированиеВариантаОказанияУслуги       = ПолучитьФункциональнуюОпцию("ИспользоватьПродажуАгентскихУслуг");
	РазрешитьРедактированиеНастроекНабора               = Истина;
	РазрешитьРедактированиеВариантаЗаданияТоварныхКатегорий = Истина;
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

#КонецОбласти
