&НаСервере
Функция СформироватьМассивОрганизаций(Источник)
        
    МассивОрганизаций = Новый Массив;
	
	Для Каждого СтрокаЗадания из Источник.МаршрутныеЗадания Цикл
		
		Основание=СтрокаЗадания.МаршрутноеЗадание.ДокументОснование;
		
		Если Основание.Метаданные().Реквизиты.Найти("Организация") = Неопределено тогда
			Продолжить;
		КонецЕсли;	
		
		Организация=Основание.Организация;
		
		Если МассивОрганизаций.Найти(Организация) = Неопределено тогда
			МассивОрганизаций.Добавить(Организация);
		КонецЕсли;	
		  
	КонецЦикла;
	      
    Возврат МассивОрганизаций;

КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	МассивОрганизаций = СформироватьМассивОрганизаций(ПараметрКоманды);
	ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПрочиеРасходы");
	
	Для Каждого Организация из МассивОрганизаций Цикл
			
		СтруктураПараметры = Новый Структура;
		СтруктураПараметры.Вставить("Основание", Новый Структура("ХозяйственнаяОперация", ХозяйственнаяОперация));
	    		
		ФормаОбъекта = ОткрытьФорму(
		"Документ.ПрочиеДоходыРасходы.ФормаОбъекта",
		СтруктураПараметры,
		ПараметрыВыполненияКоманды.Источник,
		Истина,
		ПараметрыВыполненияКоманды.Окно);	        			
		
		ФормаОбъекта.Объект.Организация=Организация;
		ФормаОбъекта.Объект.Основание=ПараметрКоманды;
		
    КонецЦикла;	
	
КонецПроцедуры
